{"id": "'Jinn' Is a Remarkably Honest Portrait of Black Muslim Girlhood ", "paragraph": "All photos courtesy Orion Classics. Director and screenwriter Nijla Mu'min’s anticipated debut feature film,  Jinn, which opens on November 15, takes the universally relatable coming-of-age narrative and frames it within the specific Black-American Muslim experience of girlhood. Aptly, that framing starts with a titular metaphor. Jinn are supernatural beings mentioned throughout the Quran. Unlike humans, who are made out of fixed clay, Jinn are unbound, extra-dimensional beings made of smokeless fire. They are unreliable; they shapeshift and have no loyalty to form—and in that sense, truth.As the movie  Jinn reminds us, such is also often the case with teenagers. Amid the setting of Oakland, California—where Mu’min partially grew up—we meet Summer (played by Zoe Renee), a 17-year-old figuring out what form she wants to take; negotiating the tension between who she wants to be and who her community expects her to be. Summer's mother, Jade (Simone Missick), is a news anchor who decides to revert to Islam, all while the public is watching (and judging). Summer, being a teenage girl insecure about how she's seen in the world, is apprehensive at first. Through the lens of this tense mother-daughter relationship, Mu'min exhumes the often overlooked intricacies of Black Muslim girlhood, as we see Summer grappling with her sexuality, faith, and sense of self. And throughout, Mu'min refuses to present tropes typically attached to Muslims and Black girl or make preachy declarations about Black American Muslim identity. Rather, Summer is rich, complicated, and, as she says herself, \"full of fire.\" Jinn debuted at the 2018 SXSW Film Festival, where it won the Special Jury Award for writing. The film also won awards at the American Black Film Festival, the Blackstar Film Festival, and the Roxbury Film Festival. Mu'min's work focuses on telling stories about Black women, and she recently joined the all-female directorial team of Ava Duvernay's television show Queen Sugar. We recently spoke to the up-and-coming filmmaker about her upbringing in the East Bay, and her inspirations for the film.  NAJMA SHARIF: I feel like the underlying theme of   Jinn is the gaze; the idea that jinn are these shapeshifting, unseen spirits adds to that. And there’s several scenes in the film that really speak to how being both Black and Muslim makes one hyper-visible. As a Black, Muslim woman yourself, how have you’ve grappled with people’s perception of you—this gaze—and how you've been expected to perform? NIJLA MU’MIN: Early on in my life, I learned or observed how people around me were kind of navigating the layers of their identity or kind of negotiating their identity to get through life. I remember my father, who has worked in retail a lot of his life, selling clothes; I remember he was salah at work. I think he worked at some clothing store, and he almost got fired for making prayer at the job and, you know, a lot of people would get scared and maybe they would stop prayer or just get another job, but he continued to do it. He was not going to allow that stigma around Islam—that type of Islamophobia—to stop him from being a Muslim. He would go through the airport wearing a kufi—and this was post 9/11. He was always very proudly a Muslim, and that is the example I had early on from my father. For myself, though, when I was a really young girl, that was my whole world. Same.I went to the masjid. I thought everyone should be a Muslim like my father. I asked my father if Janet Jackson was a Muslim, cause that was my world. When I was in junior high, I learned that being a Muslim was not normal. To be a Muslim, and as an African American, there’s a lot of stereotypes and misconceptions about what a Muslim was. I found myself in situations where I would clarify for teenagers what was a Muslim. Did you ever feel embarrassed doing that? As a kid I remember thinking my mom or my dad were doing the most by praying in public.Yes! Sometimes I felt kind of embarrassed, especially we would go out to dinner and the waiter or the waitress would come and start to read us the specials and my dad would make a point to tell him, “No, we’re Muslim, we don’t eat pork.” He would go on this whole thing about us being Muslim, he was always so proud. Sometimes I was like “No, dad, please chill out.”I’m sure it’s way different now. Do you see what they were trying to instill in us, what truth they were living at the time? How have your ideas surrounding this changed?I mean, now I look back at it as an adult and I see it as legacy. My father was trying to build his legacy for his children. Even if I’m not a practicing Muslim, I have a legacy that is rooted in a history of African-American Muslims in the Bay Area. He was just really trying to build that for us, and I’m really grateful because I have a sense of self that is so much stronger. I can look back and know why I’m the person I am based on the early example of my parents, who really encouraged a love for Islam. I look back and I’m grateful for it, but as a teenager, you just want to assimilate into something else and not even understand why. Some of my best memories are at the masjid, as a kid. I really loved studying Islam and the Quran. Sometimes it was torturous, because you had to memorize a lot and behave a certain way because you’re in the house of Allah. Now looking back, I see what discipline it instilled in me and the value in having seen the many ways people practiced Islam. I want to know more about your relationship to the masjid, being that the masjid is a centerpiece in   Jinn. How did that shape you and what kinds of memories do you have?My relationship growing up with the masjid was really beautiful. My earliest memories were there. It seems like we were there so much of the time. When we’d go visit my father, he would always take us. It was just something to look forward to. We had a really beautiful masjid in an architectural sense ––a large Victorian building. There was the Clara Muhammad school on the side of it, and that is where my brother and sister went their first years of elementary school. They also had a preschool that I went to. It was an educational space; it was a community space; a family space; a place for prayer and laughter. After the service, people would go out and buy stuff. My dad would sell scarves outside the masjid, so I was in love with this market. Like the ecosystem of the mosque...It was just this whole world: You can get your scarves and your Quran, you can get anything you needed in this little market. That was my world as a young girl and my mother was not really observing at that time—I was going more with my father. ... Definitely, as I got older—especially as I got to be a teenager and I had a lot of friends who were not Muslim—I was just confused learning about my sexuality, not really having anybody to talk to about what I was doing within my community. I was really looking for a way to fit in and understand who I was. There's also the limitations to what the masjid can offer you as a kid versus as you're becoming a young woman. The masjid isn't the place to be talking about sexuality and boys. Definitely, there's really no space for that. I'm really glad you brought that up because I couldn't really talk to my dad at all about something like that. Even my mom, I couldn't talk about those things. I'd be at school and getting these Lil’ Kim tapes and Lil’ Kim is talking about sex on the tape and things that were so obscene––this was in junior high. There was no thing called “slut shaming,” people called you a “hoe.” There was so much that was going on with public school girls that was outside of anything that I felt could be handled in the masjid. It was really two different worlds.I also loved the khutbah scene, because it shows this sermon in the middle of the day and then there's a cut to Summer getting ready to go to a party and smoking weed, and it feels like there are so many contradictions there. I could relate, because that's been me—where I'm ready to go to a party after going to jummah that afternoon. Let's segue into discussing those contradictions and the perceptions––it's not about dispelling them per say, but it's toying with them for people who don't get the many intricacies of our existence; how we live with and justify those contradictions, this haraam-halal spectrum that exists and where we draw the line.The contradictions are very important. I didn't want to stray away from that because humanity is full of contradictions and to not portray that would be false. I think sometimes we portray Muslims [either] as extremists or like a perfect person who never does anything wrong. Right, a lot of depictions are of very goody-two-shoes Muslims who pray five times a day and are the perfect student and the perfect daughter and the one mistake they make is, like, not even scandalous. So it was really refreshing to see a character like Summer.At that time you want to have fun. I went to my first party when I was in junior high school and there would be these girls doing these lap dances on these boys, I've never seen anything like that. It was a culture shock. A guy pulled my hand to do a lap dance, and I'm like, I don't know what I'm doing, I don't know what this is, it looks fun? But I was thinking,  I shouldn't be doing this. I'm not that type of girl, I'm Muslim. There's just all these things; but you want to have fun and you want to be in the in-crowd and be flirtatious. I wanted to channel all of that into Summer. She's definitely cognizant that she's straddling these worlds, and she's really trying to make them fit, and I think when it went too far for her is in the scene where you see her take a picture that's not appropriate. That's when she really feels the repercussions of that kind of shapeshifting of your identity and how that could be dangerous to you or your community. I wanted to show the contradictions because I've seen the contradictions in my own life, in my own family, in people in my community. I don't think that makes them bad people, it just makes them people. My father used to go to this club and go dancing; I never thought there was anything wrong with him going to dance at the club growing up. He didn't drink, he wasn't bringing a woman home; he just went and liked the dance. We have to make space for different types of expression.  For More Stories Like This, Sign Up for Our Newsletter Also, the contradictions aren't really contradictions in the sense that someone can't contradict their own actions. It's more of how people perceive how Muslims should act and what contradicts that, which is a whole other thing. How much of that contradiction is even ours to claim? I'm really interested in this idea of transformation in   Jinn , because that goes hand-in-hand with contradictions and coming of age. What has transformation looked like for you? Would you believe you're still transforming how you present yourself to the world?Transformation, to me, is a lot about just remaining open to growth, even at this age. I'm in my thirties. I just want to continue to be open to different ways of seeing the world, and different interpretations, even related to Islam. I meet different Muslims all the time, and they're practicing in ways that maybe aren't that familiar to me, but I want to remain open to that and not closed off. Sometimes, when we talk about religion and we talk about Islam, it's either this way or that way. That's a very limiting way to grow in a spiritual manner—to be told that your being or who you are is not acceptable in that world. Get your horoscope in your inbox, every day."}