{"id": "What we know about the bombs sent to Trump's biggest critics", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.At least six bombs targeting high-profile liberal figures were delivered over the last 48 hours, sending shockwaves down the spine of the Acela corridor as the Trump administration’s violent invective manifested in what officials are calling an act of terror. The scare began Tuesday, when authorities discovered a pipe bomb left in the mailbox of Democratic donor George Soros in Katonah, New York. Late Tuesday night, Secret Service agents charged with sorting mail discovered an explosive device addressed to former Secretary of State Hillary Clinton’s home in Chappaqua, New York. The next morning, agents discovered another bomb, addressed to former President Barack Obama’s office in Washington D.C. Hours later, CNN’s New York headquarters were evacuated after an explosive device addressed to former CIA director John Brennan, a frequent contributor to the network, was discovered in a mailroom. The offices of Rep. Debbie Wasserman Schultz near Fort Lauderdale, Florida, were also evacuated Wednesday after receiving a package containing an explosive device. According to NBC, the package was originally addressed to former Attorney General Eric Holder, but was undeliverable and rerouted to Wasserman Schultz, whose office was listed as the package’s return address. Reports also indicate a bomb addressed to Democratic Rep. Maxine Waters was intercepted by Capitol Hill police at a Congressional mail processing center. New York Governor Andrew Cuomo also said he had been targeted with a suspicious package, though that claim — and another suggesting the White House was a target — was later debunked.John Miller, the head of the NYPD’s counterterrorism unit, said Wednesday that the bombs addressed to CNN, Obama, Clinton, Soros, and possibly others, appeared to be sent by the same person. He says his office and the FBI are both investigating the bombs as a pattern. The recipients of the bombs are all frequent targets of right-wing conspiracies, though authorities have so far declined to speculate on the bomb makers’ specific motive. At least six bombs targeting high-profile liberal figures were delivered over the last 48 hours, sending shockwaves down the spine of the Acela corridor as the Trump administration’s violent invective manifested in what officials are calling an act of terror. The scare began Tuesday, when authorities discovered a pipe bomb left in the mailbox of Democratic donor George Soros in Katonah, New York. Late Tuesday night, Secret Service agents charged with sorting mail discovered an explosive device addressed to former Secretary of State Hillary Clinton’s home in Chappaqua, New York. The next morning, agents discovered another bomb, addressed to former President Barack Obama’s office in Washington D.C. Hours later, CNN’s New York headquarters were evacuated after an explosive device addressed to former CIA director John Brennan, a frequent contributor to the network, was discovered in a mailroom. The offices of Rep. Debbie Wasserman Schultz near Fort Lauderdale, Florida, were also evacuated Wednesday after receiving a package containing an explosive device. According to NBC, the package was originally addressed to former Attorney General Eric Holder, but was undeliverable and rerouted to Wasserman Schultz, whose office was listed as the package’s return address. Reports also indicate a bomb addressed to Democratic Rep. Maxine Waters was intercepted by Capitol Hill police at a Congressional mail processing center. New York Governor Andrew Cuomo also said he had been targeted with a suspicious package, though that claim — and another suggesting the White House was a target — was later debunked.John Miller, the head of the NYPD’s counterterrorism unit, said Wednesday that the bombs addressed to CNN, Obama, Clinton, Soros, and possibly others, appeared to be sent by the same person. He says his office and the FBI are both investigating the bombs as a pattern. The recipients of the bombs are all frequent targets of right-wing conspiracies, though authorities have so far declined to speculate on the bomb makers’ specific motive. In a speech Wednesday afternoon, President Donald Trump made assurances that thorough investigations into the devices were underway. “The safety of the American people is my highest and absolute priority,” Trump said. “The full weight of our government is being deployed to bring these despicable acts to justice.Trump also called for unity, saying, “Threats and political violence of any kind has no place in the United States of America.\"Law enforcement agencies have described the devices as functional but rudimentary. Photos of the device sent to CNN reveal what appears to be a small pipe bomb with electrical and battery components. Experts say the bombs are likely the work of an amateur bomb maker who probably learned how to make explosives from the internet, and warn that this pattern will probably continue for at least a few days. “What we’re seeing is the ability to create panic without killing or hurting anybody. These are crude, small devices.” said Scott Stewart, a former U.S. State Department special agent who now supervises terrorism and security issues for Stratfor, a global intelligence firm. “This is about terror, and the messaging. I don’t think it’s possible for those devices to kill someone. Badly injure, maybe, but certainly not enough to take down a building.” Investigators will be be looking for what’s known as the “bomb maker’s signature,” or, in other words, “How the connections were made, how they were assembled, what was the activation device, was the recipe something taken off the internet,” said Stewart. Investigators will also carry out forensic testing on the devices, looking for things like microscopic DNA traces, and tracking down where the particular components were purchased. They may also be looking for other evidentiary indicators, like whether there was a letter sent alongside the devices. “Because this appears to have a political motive, I’m sure the FBI is combing protective intelligence databases for threats against these particular individuals,” said Stewart. Former FBI special agent Jeff Danik said the bombs “could be a very dangerous situation” depending on how functional they are. The real concern would be if the person behind the explosives switches to a “softer target,” since all the recipients so far have extensive security protections and mail screening systems that identified the bombs before they were delivered. “We’re likely to see more devices,” Stewart said. “Someone who has this amount of anger and motivation probably won’t stop.” Here’s what we know so far:On Monday, a six-inch bomb containing black explosive powder was found in the mailbox of George Soros, a billionaire liberal philanthropist who is known to fund progressive causes. Authorities say a caretaker at the house picked up the manila package, which was not delivered through the U.S. mail but apparently marked to look as though it was, and started to bring it inside. Upon realizing the package contained an explosive device, the caretaker dropped it in a wooded area and notified police, who detonated the bomb somewhere near Soros’ home. Soros was not home at the time. The device is believed to be a pipe bomb, similar to ones also sent to the Clinton residence and the Obama residence. Read more:  A bomb was found inside George Soros' mailboxThe Secret Service intercepted an explosive package mailed to the resident of former President Barack Obama. Authorities say Obama and his family were unharmed and not in danger. The device is believed to be a pipe bomb, similar to ones also sent to the Clinton residence and the Soros residence. Read more:  Secret Service intercepts bombs addressed to Hillary Clinton and Barack ObamaThe Secret Service intercepted and disposed of a “functional explosive” addressed to the home of Hillary and Bill Clinton in Chappaqua, New York. Bill was reportedly in the house but was unharmed, while Hillary was in Florida campaigning for Democrats for the upcoming midterms. \"We are fine thanks to the men and women of the Secret Service,” Clinton said in Florida. “Every day, we are grateful for their service and commitment. And obviously, never more than today. But it is a troubling time, isn't it?\"The device is believed to be a pipe bomb, similar to ones also sent to the Obama residence and the Soros residence. Read more:  Secret Service intercepts bombs addressed to Hillary Clinton and Barack ObamaTwo CNN anchors were reporting on the bombs sent to the Clintons and Obamas, when they were notified on-air that they had to evacuate the building because an explosive device had been discovered in the CNN mailroom. CNN reporters continued reporting on the incident from the street outside their headquarters in the Time Warner building. Authorities disposed of the device, which was sent along with an envelope containing an unidentified white powder. The contents of the powder are still under investigation. Notably, there do not appear to be any postal markings on the envelope in which the bomb was contained, and CNN reports that authorities believe the bomb was dropped off by a courier. Read more:  CNN anchors evacuate on-air after report of bombA suspicious package addressed to former Attorney General Eric Holder’s office instead arrived at the office of Congresswoman Debbie Wasserman Schultz near Fort Lauderdale, Florida. The package arrived at Wasserman Schultz’s office because she was listed as the return address on the envelope, NBC reported. The Broward County Sheriff’s Office deployed a bomb squad to the scene. Read more:  Office of Rep. Debbie Wasserman Schultz evacuated due to suspicious packageYet another bomb may have been mailed to Democratic Rep. Maxine Waters. Authorities confirmed they are investigating a package in the Congressional mailroom, and ABC and CNN are both reporting Waters was the target, citing confidential law enforcement sources. Read more:  Another bomb said to target Rep. Maxine Waters discovered in Congressional mail officeA few false reports of bombs targeting politicians began to circulate on Wednesday. Most notably, CNN reported that the White House had been sent a suspicious package. This turned out to be false. San Diego police said they were investigating a suspicious package found outside of an office building that housed a regional office for Sen. Kamala Harris, a California Democrat. Harris’ office released a statement saying that they were not targeted in the attack.Police also performed a sweep of former Vice President Joe Biden’s home in Delaware, though it’s unclear if this was in response to a threat or just as a precaution. And on Wednesday, after his office and his own brother denied reports that explosive devices were mailed to his offices, New York Gov. Andrew Cuomo claimed at an NYPD press conference that a device was, in fact, sent to him. “A device has been sent to my office in Manhattan, which we were just informed about,” Cuomo said. “That device is also being handled.”CNN then reported that the “device” was actually just an information package, and the NYPD confirmed in a statement that Cuomo had not been targeted. According to a Cuomo spokesperson, the \"suspicious package\" actually contained information files on the Proud Boys, a hate group that recently started a violent brawl in upper Manhattan. Read more:  New York Governor Andrew Cuomo says someone mailed a bomb to his office tooCover image: Police tape blocks the Columbus Circle subway exit outside of the Time Warner Center in New York, U.S., on Wednesday, Oct. 24, 2018. U.S. news media stepped up security measures on Wednesday after a suspicious package was found at CNN's New York offices, the latest in a string of incidents this week that also targeted Barack Obama, Hillary Clinton and George Soros. Photographer: Philip Brian Tabuas/Bloomberg via Getty Images"}