{"id": "The Final '2 Dope Queens' Podcast Was a Perfect Interview with Michelle Obama", "paragraph": "via GettyDope queens Phoebe Robinson and Jessica Williams surprised fans on Wednesday with two announcements: that their popular WNYC podcast 2 Dope Queens is ending, and that their final episode is an interview with Michelle Obama. There couldn’t have been a more epic final guest, as the two have been vocal with their love for the former First Lady throughout the show’s three-year run. And it turns out she’s been admiring them back! Obama reached out to  them ahead of the release of her book,  Becoming, and Robinson was surprised to find her own book, Everything Is Trash, on the shelf in Obama’s Washington, DC, office. In classic dope queen style, the two open the interview telling Obama that Phoebe is wearing her finest wig (her “Chaka Khan”) and Jessica has brushed her edges for the momentous occasion. Obama is in her best form as well, using humor to inspire and bond with the queens. Managing her hair in the White House was actually a topic in her book, and she jokes, “People don't understand, it's like, getting your hair done every day will mess with your hair. […] My whole goal was [...] I want to leave here with the hair I came with.” She points out that she tried “a little bit of everything: braids, weaves, wigs extensions,” but adds on a more serious note, “This wasn't just a First Lady journey. This is a black professional women's journey.”Much like Obama,  2 Dope Queens has had the same mission to help women, people of color, and the LGBTQ community find their voice. This is something Obama acknowledges, paying respect to Robinson and Williams. “To be funny means you have to be smart. There's something that was in you from the time you were four or three. If you talk to your parents they could see that in you,” she says.When explaining the root of her desire to create the non-profit organization Global Girls Alliance, Obama admits she and her siblings were never raised to think they were special. “My mother was like, ‘No, there are a lot of other kids who were as smart as you.’ But the difference between success and failure when you're a woman, when you're a minority, is really slim,” she says. “And, if you get the wrong message it sits with you the wrong way.” This is something Obama dealt with as a major black figure in America who had to navigate the respectability that comes with being First Lady, the politics and racism that came with being a black woman in that space, and being her regular self. Robinson and Williams understand this as black women who paved a way for themselves by talking openly, with humor, and sharing details of their lives that are not always deemed respectable. All three have found the space to honor themselves and women like them while sharing their wisdom and having fun.This contrast made for a really striking moment when Williams asked if Obama feels like she can express more of her anger now that she’s out of office. “You know in all truthfulness, no,” Obama says. “I think that labels and stereotypes stick if you've grown up sort of thinking ‘watch your mouth, be careful.’”“If you're a woman and you're too angry, people stop hearing the point,” she says, adding “And I'd love to be able to get in and emotionally, psychologically change that. But the truth is that people will hear things differently from me.” It makes sense considering this is the woman who coined the slogan “When they go low we go high.” To that point, Obama explained, “I had to learn how to separate my anger from the point, from the goal. And that is what I try to mentor young people to do. It's like have the feeling, don't deny the feeling exists ... But if I'm trying to move an issue, if my anger doesn't work to move the issue, then it's not helpful. And that's what ‘going high’ means. ... It's just like, what's your goal? And usually your goal isn't to just be angry.”The queens also put Obama through their rapid fire questions round, where she joked she didn’t have to choose between a Beyonce concert and lunch with Oprah because she could actually do both. That’s the exact definition of goals.Obama treated the queens and listeners to a passage from  Becoming, sharing this bit of sage advice:For me, becoming isn't about arriving somewhere or achieving a certain aim. I see it instead as forward motion, a means of evolving. A way to reach continuously toward a better self...Becoming requires equal parts patience and rigor. Becoming is never giving up on the idea that there is more growing to be done.From the offset of her entry into our cultural lexicon, Obama has exemplified her own definition of becoming. And so have Williams and Robinson. This interview became a space to celebrate all of their achievements, and to look back at what they themselves have become. Sign up for our newsletter  to get the best of VICE delivered to your inbox daily.  Follow Taylor Hosking on Twitter.Sign up for the best of VICE, delivered to your inbox daily."}