{"id": "Game Developers Give Advice On How To Make Their Industry a Better Place", "paragraph": "Image courtesy of Rockstar GamesOne of the most common questions I’ve heard since Telltale Games imploded without paying severance to hundreds of employees and a combination of perplexing admissions and in-depth reporting unearthed a culture of crunch within Rockstar Games is understandable: Is it possible to buy and enjoy games by these companies, given everything we now know?The most common answer is: “Well, don’t buy the game. Vote with your wallet, and send a message!” Except it’s not that simple. On one hand, the popularity of these games, especially  Red Dead Redemption 2, means any boycott is unlikely to be large enough to materially impact the bottom line of the bad actors involved to prove a point. Secondly, Kotaku reported employee bonuses are tied up in the game’s financial success, meaning any real boycott would end up financially undermining the very people you’re trying to help.But...that doesn’t take it off the table. In the same way one person recycling every day won’t individually alter the temperature of the planet, it can still be the right thing to do  for you. It all depends on where you draw the line. Did Telltale go too far? Did Rockstar? We all have our own individual priorities that, by design, put some problems above others; the world is fucked in more ways than one, and it’s impossible to live life without ethical compromise. You do not become a bad person for participating in a flawed system you did not build yourself, but it’s also incumbent on you to find ways to push back or improve that very same system.We talked through this problem on an emergency podcast today.Separately, on Twitter, I flipped this question to developers.The answers varied, but shared a common theme: buy and enjoy the games built by them, even if you come to realize the circumstances they were developed may have been harmful.“I would prefer someone just play whatever they want and then vote for folks who will lead the way on progressive, future of work issues,” said Campo Santo ( Firewatch) co-founder Sean Vanaman, who previously worked at Telltale Games. “In the case of [Telltale Games] I’d already given much of myself making the game under difficult circumstances. I think it’s ok to participate as a customer in a broken system if you do so eyes-open and advocate consistently over the long term for improvements to the system, but it’s a matter of unique perspective, I might feel differently had I stayed at [Telltale Games] through the end.”Voting is important. There’s a distressingly important midterm election in a few weeks, actually. Please vote! But voting, like buying or not buying an ethically compromised product, can feel empty; it comes at the  end of the process. Voting isn’t activism, and there’s a difference between the two. Activism is finding ways to empower a local candidate pressing issues in a direction you think would make the world better. Activism is showing up to a local chapter of an issue or political party, and seeing what you can do to help. Small steps matter.“Buy the game and have fun playing it,” said Iron Galaxy (Divekick) CEO Dave Lang, whose studio has previously disclosed they routinely turn away business deals that would have their studio working excessive hours. “For me I just don’t think this will be an effective form of protest, so putting myself in the shoes of the dev team I’d just assume see people enjoying the things I’ve worked on, even if the circumstances I worked on were shit.”This came up over and over, in conversations both private and public with developers who responded to my tweet. Many are proud of the work they did, despite the circumstances, and that pushing back on labor conditions is a fight never ending—but it must happen  earlier.“This isn't a thing you can punish at the register,” said No Goblin (100ft Robot Golf) founder Dan Teasdale. “Buy and enjoy the work that's done by developers, but don't support or give a platform to the industry organizations and foundations that downplay negative quality of life policies.”Though Teasdale doesn’t point to any organization specifically, it’s easy to imagine he’s talking the Entertainment Software Association, a group ostensibly representing the “industry,” but in reality, it’s an advocacy group for the biggest publishers. When Waypoint asked now-former ESA president Mike Gallagher about crunch at E3, he said they were “listening,” but refused to outline any specific steps it was taking to better labor conditions.“Asking players to ‘suffer’ (not play a game they want to play) for injustices they have no personal stake in will never work,” said designer Tyler Glaiel (The End is Nigh), “but you can convince people to buy games from developers that don't do those things instead, and buy those at full price instead of waiting for sales.”This is an underappreciated point of empowerment. Rather than avoiding buying games from companies that insult your personal values,  do buy them from places that compliment them.Another note: if a developer has a game listed on Steam, itch.io, and a personal website, buy it anywhere but Steam. Sure, yes, Steam is a useful tool and it’s nice to have your games in a single spot, but itch.io gives developers greater flexibility in profit margins, and on a personal website, nearly all of it goes to them. For smaller developers, the dollars add up. Other forms of economic reinforcement include supporting creators on Patreon—or tipping.You may not have much money, though. OK, what then? This sounds crude, but it’s true: tell them you love the work they do. You’d be surprised how far a positive thought goes in 2018.“My take is that boycotting sales won't make a dent in projects of this magnitude,” said Overkill (The Walking Dead) systems designer Miodrag Kovachevic. “If players want to help, call out companies and higher-ups every time all the time something like this happens. Attack it with the same fervor that's used for Season Passes, DLCs, etc.”There hasn’t been nearly the same fervor around the treatment of labor than there has around, say, loot boxes. Loot boxes are terrible and exploitative, don’t get me wrong, but the incendiary discussion around loot boxes actually nudged some companies in a way we’ve yet to meaningfully see with crunch practices. You’ll notice Kovachevic’s examples all riff on the same thing: players being asked to spend more money. There’s less fervor around labor because it isn’t personally localized; it happens to  other people, thus demanding empathy.Again, there’s no clear path out of this. Unionization would help. And activism. And better labor regulations. There is no ideal, utopian world—only a less flawed one. That it seems insurmountable is not an excuse to throw up your hands, hand over a credit card, and do nothing. Find ways—on a daily basis, on a game-by-game basis—to move the ball forward. You, like many other people, may buy  Red Dead Redemption 2. I will be one of those people. But if you do, go in with eyes open.In other words:Follow Patrick on Twitter. If you have a tip or a story idea, drop him an email: patrick.klepek@vice.com.  Have thoughts? Swing by Waypoint's forums to share them! Email is a thing."}