{"id": "There Are No Good Guys in ‘Narcos: Mexico’", "paragraph": "photo courtesy of NetflixNarcos show runner and executive producer Eric Newman first had the idea for the series in the mid-90s. He heard a story about Columbia's deadly Cali Cartel and it blew his mind. He started researching the group, thought it would make a great movie, and kept it in his back pocket while searching for the right partner to bring his vision to the screen. Enter Netflix. In a meeting with the streaming giant years after the Cartel caught his eye and kept his interest, they asked Newman if he had something that could work in Latin America. He did, something he’d been holding onto forever. His Narcos movie idea turned into a TV show—something the producer for the silver screen never thought he'd make. That show was a smash now in its fourth season, this time moving on from the Cali Cartel in Columbia to Mexico's Guadalajara Cartel for Narcos: Mexico, which premieres on November 16. This season follows the intertwining stories of DEA Agent Kiki Camarena (Michael Peña) and Miguel Ángel Félix Gallardo aka El Padrino (Diego Luna), the godfather of the Mexican drug cartels. VICE talked to Newman by phone to find out how the drug war didn’t really start until Camarena was murdered, why El Padrino was a man caught between a rock and a hard place, and how the Guadalajara Cartel spawned drug lord legends like Rafael Caro Quintero, the Arellano Félix brothers, Ernesto Fonseca Carrillo aka Don Neto, and Joaquín “El Chapo” Guzmán. Here’s what he had to say.VICE: Why did you decide to focus Narcos Mexico on Kiki Camarena, the DEA agent who was killed in Mexico in 1985?Eric Newman: This season is very much about the collision of these two guys, Felix Gallardo who's the leader and founder of Guadalajara cartel and Kiki Camarena, the DEA agent based in Guadalajara who's kinda on to him. It was very much the kind of inciting incident where everybody woke up and realized they were in a drug war. It’s impossible to tell the story of Mexican drug trafficking without telling that story. I don't think either of them realized what they were getting into and how big this was gonna get. It's a sort of a fascinating place to start and I think it worked out really well.The new series shows how at first the U.S. government wasn't even that interested in what was going on in Mexico until Kiki was killed. Would you say Kiki’s murder was the start of the war on drugs as we know it today? It was definitely the moment where we realized we were in a war. It was a huge wake-up call. What happens when a cop gets killed in America is different than what happens down there. Cops get killed all the time in Mexico and Columbia by the scores. But for Americans, who thought they were invulnerable, like they couldn't be touched it was like “No, no, no.” It’s much bigger and much more out of control then we thought. And so, that moment for both sides is the beginning of what we have now, where half a million people have died.El Padrino is seen as the Godfather of the Mexican drug cartels, but in the series, watching the portrayal, it seems like a lot of times he's a man between a rock and hard place. Can you explain that characterization? Look, I don't believe that the world is full of good guys and bad guys. I tend to believe that it's full of bad guys and very bad guys. And I think that you can humanize almost anyone. I like to think that everybody is either the hero or the victim in their own story. They're never the villain. Nobody says “Fuck, I'm the bad guy” and I think that the same is true of narco traffickers. They have a justification for what they do. It might not be a sufficient excuse, but if you're listening, it's enough of an explanation as to how they found themselves in this position. One thing you cannot discount in this story is the role that America plays as the largest market for cocaine in the world. The role that the Mexican government and law enforcement play in letting this go as far they did [is also important.] This is not a guy who introduced political and police corruption to Mexico. He didn't invent that. He just saw an opportunity and exploited it. He’s a man who’s done a lot of evil, but he's not a monster. He’s a guy in a bad spot. These guys are one step ahead of the ax. I think you can find humanity in anyone and I think it's very important to us, on our show, that we continue to bring it out of these people because otherwise you're just watching a cartoon character. At the end of season three it kinda looked like the next season would feature the Lord of the Skies. So what happened? Is that storyline still gonna be explored? Because you went back in history further with El Padrino. When I looked at it I was thinking 'OK, we can definitely just pick it up with Amado Carrillo Fuentes because he's one of the most significant traffickers in history.' Maybe the most significant in some ways, but I kinda thought, if you really wanna understand this you gotta go back and start over and start at the beginning where all these guys were. Becasue they were all under the same umbrella, El Señor de Los Cielos, Chapo Guzman, Ismael Zambada, and Hector Palma. These guys were household names down [in Mexico.] Some of them were even household names in the [US] like Chapo. But, they all started working for this guy.The Guadalajara cartel had many drug lord legends besides El Padrino like you said. What role did Rafael Caro Quintero and Don Neto play in the organization and in the story? In the organization and the story Rafa Quintero is believed to have invented sinsemilla. He was a genius. A different kind of genius than Gallardo. He was a grower and he was younger and maybe more impulsive. He was sort of brilliant, at least the cultivation genius. Fonseca Carrillo was an old-school trafficker [with] deep roots. Felix Gallardo was not born into trafficking. He’d been a policeman who became a trafficker. Fonseca Carillo had been a trafficker. He was an O.G. He’d been in from the beginning and had a certain level of credibility that Gallardo didn't have on his own. At the time, before they got into cocaine, Rafa Quintero had the product. He actually figured out how to grow it and that was a game-changer. By the way, this was all before cocaine. Cocaine hadn’t happened yet. And Rafa Quintero is now back in the game in a big way. He's one of the leaders of the Sinaloa cartel. He is full on. El Chapo got his start in the Guadalajara Cartel too. How important was it for the show to portray him as an up-and-comer in the series and is it all a set-up for his story going into the next season? It certainly gives us some options. The first goal was very much to tell the story of how interconnected all these guys are and what the significance of this organization was, in that, if it weren't for them none of these other guys would exist. Chapo wouldn't exist. El Señor de Los Cielos wouldn't exist. None of them would exist without these guys, without the Guadalajara Cartel. It's a fun beat when you meet Chapo. It's pretty cool. It's like 'Oh shit, that's Chapo.' You don't know who he is until he says his name and so that's kinda fun. I think there is definitely a lot of different ways we can go if we were to continue the series.Narcos: Mexico really pulls back the veil on the corruption in Mexico and how high it goes. Why do you think the drug cartels and political corruption go hand in hand in Mexico? I think that there are very complicated situations that America has to take a lot of responsibility for. It depends on how generous you're being when you look at the American role in Latin America, but it's been pretty horrible, objectively. In terms of the people we've chosen to support. We've done some really brutal economic things that have hurt these countries financially. We don't cast judgment on anyone really. Everybody's responsible for this disaster. There are no good guys and bad guys. It's bad guys and really bad guys. I think that our obligation, though we're not a documentary film, is to achieve as much objectivity as we can. Corruption has always existed in Mexico, in terms of the police. They look the other way and protect their partners. Years of political corruption and a rich smuggling tradition [found the] perfect product, which was cocaine. It was pound for pound, maybe the most lucrative substance that's ever existed. It's worth its weight in gold many times over. I think all of those things conspired to create this kinda unholy alliance and if America was your neighbor and they had an insatiable demand for cocaine, why wouldn't you do everything you could to sell it to them? Your film career started on Wayne's World way back in 1992. What do you think is the most important thing you've learned about the industry? There’ve been so many changes in the business since I got into it. I thought that I was going to be a movie producer my whole life and I did fine. I made some cool movies and I did alright, but the best thing that's ever happened to me, is my move into television with Narcos. That never would've happened if the business hadn't changed around me. What I think I've learned and what I’d recommend to anyone is make shit that you wanna see. You're not gonna be good at making shit that other people wanna see. You're certainly not gonna enjoy it. The best thing we can do is make the stuff that we’d want to see. I’m one of the biggest fans of our show, because it's made for me. It's exactly what I'm into. The fact that I still get to do that [makes me] go to work every day feeling pretty lucky.Sign up for our newsletter to get the best of VICE delivered to your inbox daily.Follow Seth Ferranti on Twitter.Sign up for the best of VICE, delivered to your inbox daily."}