{"id": "The NYPD has started arresting Proud Boys involved in violent Manhattan brawl", "paragraph": "Watch VICE News Tonight on HBO weekdays at 7:30.The New York Police Department has started arresting members of the fascist street gang “Proud Boys” in relation to the violent brawl on the Upper East Side of Manhattan last week. As of Friday afternoon, two Proud Boys had been taken into police custody. Geoffrey Young, 38, was arrested Thursday and slapped with misdemeanor rioting charge and an attempted assault with intent to cause physical injury, also a misdemeanor, according to court records. On Friday, police confirmed that they’d taken another into custody another Proud Boy, whom the Daily Beast identified as Jay or “Johnny” Kinsman. Charges against Kinsman are pending. “Investigation continues with additional arrests expected,” NYPD Chief of Detectives Dermot F. Shea tweeted Friday. Proud Boys founder Gavin McInnes told the New York Times he was making arrangements for at least eight of the members to turn themselves in and said they were “going to be in the Tombs by tonight.” McInnes has touted himself and his organization as an ally to law enforcement: On Sunday, during a podcast segment, McInnes boasted that he had “a lot of support in the NYPD.” At the same time, McInnes has made it clear he has no problem with Proud Boys committing violent acts, which he has said is “a really effective way to solve problems.”The New York Police Department has started arresting members of the fascist street gang “Proud Boys” in relation to the violent brawl on the Upper East Side of Manhattan last week. As of Friday afternoon, two Proud Boys had been taken into police custody. Geoffrey Young, 38, was arrested Thursday and slapped with misdemeanor rioting charge and an attempted assault with intent to cause physical injury, also a misdemeanor, according to court records. On Friday, police confirmed that they’d taken another into custody another Proud Boy, whom the Daily Beast identified as Jay or “Johnny” Kinsman. Charges against Kinsman are pending. “Investigation continues with additional arrests expected,” NYPD Chief of Detectives Dermot F. Shea tweeted Friday. Proud Boys founder Gavin McInnes told the New York Times he was making arrangements for at least eight of the members to turn themselves in and said they were “going to be in the Tombs by tonight.” McInnes has touted himself and his organization as an ally to law enforcement: On Sunday, during a podcast segment, McInnes boasted that he had “a lot of support in the NYPD.” At the same time, McInnes has made it clear he has no problem with Proud Boys committing violent acts, which he has said is “a really effective way to solve problems.”The NYPD said Monday that they were seeking 12 people in connection with last Friday’s events, including nine Proud Boys. The Times also reported that police have opened a “broad criminal inquiry into the group’s activities” after members clashed with protesters last Friday following McInnes’ speaking appearance at the Metropolitan Republican Club.READ: Cuomo calls for FBI and New York hate crime investigation into Proud Boy violenceWidely circulated video of last week’s clashes showed a few dozen Proud Boys, many wearing red MAGA hats and their trademark black-and-yellow Fred Perry shirts, roaming the streets, shouting homophobic slurs, and violently beating protesters. In one video, a Proud Boy is heard bragging about kicking a “foreigner” in the head. The incident prompted an outcry from state and city officials, who condemned the Proud Boys and urged the NYPD — which was initially criticized for not doing enough to protect protesters — to investigate and arrest the violent instigators. In the aftermath of the clashes, the NYPD arrested three anti-fascist demonstrators who were protesting McInnes’ speech but did not immediately arrest any Proud Boys. Disclosure: The Proud Boys organization was founded by Gavin McInnes, a co-founder of VICE Media. McInnes left VICE in 2008 and has not been involved in the company since. Cover image: Geoffrey Young (Photos provided by NYPD)"}