{"id": "MashableCloudflare just dropped a free privacy app for mobile browsing", "paragraph": "It's never just between you and your phone. What you Google in the wee hours of the morning isn't for your eyes only. Instead, your search queries and history are logged and tracked by a host of companies who likely don't have your best interests at heart. The web services giant Cloudflare has released a free app for iOS and Android that helps you cut out at least a few of those unwanted prying eyes. The app, 1.1.1.1, is an extension and simplification of a service Cloudflare began offering in April of 2018: a free, fast, and private DNS resolver. SEE ALSO: The only app that matters this year is Signal\"Nearly everything on the Internet starts with a DNS request,\" explains the 1.1.1.1 webpage. \"DNS is the Internet’s directory. Click on a link, open an app, send an email and the first thing your device does is ask the directory: Where can I find this?\"In other words, though you may not realize it, every day you're on the internet you're interacting with a DNS server or resolver in some way or another. And companies are watching.  Image:  screenshot / app store\"Your ISP, and anyone else listening in on the Internet, can see every site you visit and every app you use — even if their content is encrypted,\" Cloudflare adds. \"Creepily, some DNS providers sell data about your Internet activity or use it to target you with ads.\"The 1.1.1.1 app does an end run around this by creating a secure connection for your phone. \"We will never log your IP address (the way other companies identify you),\" notes Cloudflare. \"And we’re not just saying that. We’ve retained KPMG to audit our systems annually to ensure that we're doing what we say.\"Again, this is all offered totally free to the user. As an added bonus, the company claims that running the app on your phone will likely make internet queries faster on your device. Importantly, downloading and running 1.1.1.1 does not mean that no one is snooping on your web browsing. It does, however, make it harder for some companies to do so.Hey, just because a victory is small doesn't mean it's unimportant. A step in the right direction is better than no steps at all. "}