{"id": "MashableTile Mate and Pro review: A good idea made better with replaceable batteriesRelated reviewsRelated reviews", "paragraph": "The new Tile Mate and Tile Pro look good on paper. The company, known for its small Bluetooth trackers that you attach to things like keychains, has fixed the Achilles' heel of the two products without significantly changing their design. And they still cost the same: $24.99 for the Mate and $34.99 for the Pro.The big change: a door on the back of each for a replaceable battery. Previous generations of Tile trackers didn't have replaceable batteries, so a dead one meant tossing the tracker and buying a new one. Maybe.SEE ALSO: How to functionally abandon emailMost importantly, these updates don't change what a Tile a can do. It's an easy way to keep track of pretty much anything likes keys, a pet, or a backpack. Using Bluetooth, it connects to your phone, and you can ring the tracker if you misplace it. Both the Mate and Pro will allow you to track things; the difference is design and the hardware inside.That's not the only upgrade, though: Tile has improved the built-in speaker as well as the Bluetooth connection in both models as well. Plus, the company is rolling out a \"premium\" service, which includes battery replacements, enhanced support, and smart-tracking features for a monthly or yearly cost.However, after a few weeks of testing, should all users upgrade to the Mate and Pro?The front of the new Tile trackers is basically identical to previous versions.Image:  ZLATA IVLEVA/MASHABLEThis updated line of trackers doesn't change the design at all. It's an iterative update that mostly involves the addition of a removable battery door on the back. The Mate is the cheaper of the two and has a smooth plastic build. It doesn't feel high-end and attracts scuffs and scratches from the get-go. It's slim (just 0.25 inches) and light (at 0.26 ounces).If you need something more durable, you can pay a bit more for the Pro model. It has a grippy plastic build that gives it a more tactile feel. It also looks better and is much harder to scuff. A metallic rim holds the whole tracker together and makes it more resistant to drops. It's a bit wider than the Mate, but it packs a larger battery and louder speaker.The Tile Mate in white.Image:  ZLATA IVLEVA/MASHABLEThe Tile Pro in black.Image:  ZLATA IVLEVA/MASHABLEBoth the Mate and Pro put the hold for the key ring in the top corner, a design Tiles have become known for. Attaching one to a pair of keys, a backpack, or even a dog collar is a breeze. Unlike the Tile Slim, which is flat, these don't have an adhesive built into the back. I don't find myself craving this option, though. The smaller footprint of the Mate makes it more versatile, in my opinion, as long as you're willing to live with getting it scratched up.The battery cover is on the back, though it's sometimes hard to open.Image:  ZLATA IVLEVA/MASHABLEAs I mentioned, the big upgrade for the new Tile Mate and Pro is the user-replaceable battery. Even better, it's the same type that typically found in watches (CR1632 in Mate or CR2032 for Pro), making replacements readily available. It's a big fix that's better for the consumer and the environment. Having to throw out your Tile and buy a new one when it died sucked, truly sucked. So being able to extend the life of a product and letting you get at least a year out of it from the get-go is excellent, and the implementation of a removable door is very good.The battery door is a bit easier to open on the Mate.Image:  ZLATA IVLEVA/MASHABLEThe battery door on the Pro is a bit harder to open and conceals a larger battery.Image:  ZLATA IVLEVA/MASHABLEYou can slide the door off with a firm press of your thumb, and luckily you don't need another tool to remove the main cover. The first time attempting to remove it can be tough, so don't be afraid to use some force — neither the Pro or Mate will break easily. Also, be advised: You'll probably set off the ringer when attempting to remove the cover.The battery is a bit wedged into its chamber so it won't easily fall out. That's helpful, but it also means you'll probably need a pen or paper clip to push it out.When I met with Simon Fleming-Wood, the chief experience officer at Tile, he discussed the different ways of implementing the replaceable battery. At one point a screw holding it closed was considered and even a swivel design, similar to an old-school Flip camera. Ultimately it came down to making it simple while ensuring it won't open by accident.This implementation is pretty solid. Choosing a lithium-ion battery with a port would have required an entirely new design, Fleming-Wood said. It also keeps the cost lower and doesn't require you to charge the Tile. I think the last thing anyone wants is another device they have to charge.The Tile Mate has an improved speaker and antenna inside.Image:  ZLATA IVLEVA/MASHABLEThe speakers in both the Mate and Pro got an upgrade. The Mate's speaker is only slightly louder than the original. However, the Pro is considerably louder and can be heard even when it's in a pocket. Via the Tile app for iOS and Android you can pick the actual sound it makes from a few options. The Bluetooth connectivity range has also increased, on both; it's up to 150 feet on the Mate and up to 300 feet on the Pro. I tested them at both my office and my home, and I was impressed with the results. While the signal can vary depending on your phone, I didn't experience any drops. This is great since when it's in range, you can ring the tracker. If you're not, you can look at the map in the Tile app to see where it was last seen. Then, once you're near where it last was, you can ring it to have the Tile make a sound.Tile is rolling out a Premium subscription service for power users.Image:  ZLATA IVLEVA/MASHABLEBesides the two new models, I've also been playing around with Tile Premium. It's a subscription plan for power users — those who really rely on Tile to track a lot of their stuff.It costs $2.99 a month or $29.99 for a year, but it's not a necessity — the Tiles will work without a subscription, of course. The biggest advantage is the free battery replacements. A new battery will be automatically mailed to you before the old one in your Mate or Pro dies.You also get a 30-day location history that you can access via the app, support via text messages, a three-year warranty, and more sharing features. Premium users also get access to Smart Alerts, a feature that's in beta. This enhances the experience by notifying you when you leave something behind.You'll need to have your address saved in Tile so it knows where home is. Then if you, say, leave without your keys, Tile can send you a notification to let you know they were left behind, using geofencing tech. However, in my testing, it failed twice to remind me out of five times in my first few tests. Reminder: the feature is in beta.Now is the time to get a Tile Mate.Image:  ZLATA IVLEVA/MASHABLEAt $24.99, the Tile Mate with a user replaceable battery and tracking features makes sense for returning and new users alike. Plus it's portable enough that it won't add much weight to your keys. It's best to think of Tile as a safety net; it's that extra protection for remembering crucial items like keys, a bag, or a laptop. While you may not have lost something yet, when it does happen (and it happens to the best of us), it should be easier to find.While the entry-level Mate makes sense for most, the $35 Pro has a leg up. Its design is more durable and can handle scratches better, plus it has a louder speaker. The battery inside the Mate and Pro is supposed to last a year.I can't wholeheartedly recommend the Premium service just yet, since the Smart Alerts are a work in progress. But if you're already sold on Tile, it might be worth it for the automatic battery replacements and location history.For most, though, I say: pass on the service, and just get yourself a Mate.\nEvery product here is independently selected by Mashable journalists. If you buy something featured, we may earn an affiliate commission which helps support \nour work.\n"}