{"id": "MashableSupreme Court says these young climate activists can sue the federal government", "paragraph": "The young people have prevailed. After a back-and-forth battle with the Trump administration, the U.S. Supreme Court decided Friday that a group of 21 11- to 22-year-old climate change activists can sue the government for harming their futures with a national energy system that produces dangerous amounts of greenhouse gases.SEE ALSO: Why the Trump administration is terrified of these childrenThe highest court in the U.S. had previously halted the trial after the Donald Trump administration's Department of Justice requested to hold off on hearing the group's arguments against the country's climate change policies.The trial was supposed to start last week in Juliana v. United States. But just days before, the Supreme Court effectively said \"hold up\" in response to the DOJ request. The government said the trial would bring \"irreparable harm\" to the country.Then, on Friday, the Supreme Court denied the stay — meaning the trial can go forward. The suit is filed in a U.S. district court in Oregon. Now the trial could start this month, according to NPR. The 22-year-old plaintiff named in the case, Kelsey Juliana, retweeted a post about the SCOTUS trial news Friday evening.BREAKING: United States Supreme Court Denies Trump Administration’s Request for Stay - ​​Juliana v. United States​​ Moves Forward, Again. Read full press release: https://t.co/KJ8WKF4N3l #youthvgov #TrialoftheCentury #LetTheYouthBeHeard pic.twitter.com/EyEg7QMuWj— Our Children's Trust (@youthvgov) November 3, 2018The nonprofit group Our Children's Trust celebrated the news and, in a statement, Juliana said, \"...these defendants are treating this case, our democracy, and the security of mine and future generations like it’s a game. I’m tired of playing this game.\"\"These defendants\" is the U.S. government. The climate fight moves forward."}