{"id": "MashableLeftovers season is here, so it's time to upgrade your food container situation", "paragraph": "Leftover season is upon us, which means that now is the time to invest in some solid Tupperware. You may be thinking that the mix-matched menagerie of lids and plastic containers you have tucked away in your kitchen will do the trick, but I regret to inform you that it will not. Come the end of your Thanksgiving meal, as you try to fit your leftovers into whatever food storage containers you have, you'll wish you'd invested in some sturdy containers worthy of storing the meal you spent hours—days, even!—creating.SEE ALSO: Let Alexa manage your fridge with this smart invention —  Future BlinkBeyond the holidays, the right food containers can make a hell of a difference when you're packing your lunch, meal prepping, or storing things in the freezer for a later date. So, why not take this opportunity to invest in some food storage that will actually serve your needs rather than those flimsy plastic containers that came with your last Seamless order?With so many options available, wading through the vast food container selections can be exhausting, so we've broken down the most vital information to consider before clicking buy.Food containers often fall into one of these two categories. Plastic containers are lightweight and easily transportable, while glass tends to be sturdier and best for reheating leftovers. But which is actually better? It depends on what you intend on doing with your containers.Typically, glass container is reserved for meals stored in the freezer or the fridge that can easily be transferred to the oven for heating up, while plastic containers are ideal for packing your lunches, Kim Kimbriel, a Container Store buyer told the Washington Post.When it comes to plastic containers, there has been some concern over materials containing BPA  (bisphenol-A) and phthalates, which may be \"endocrine disrupters\" (meaning that they can mess with your hormones,) according to Harvard Health Publishing. Now it's easier than ever to find plastic containers that are BPA free, but there are still looming concerns over whether or not it's ever really OK to microwave plastic containers. If you're really worried about any potential side effects of using plastic containers, it's probably best to stick with glass.The vast array of container options available is enough to make anyone's head spin. They come in so many different shapes and sizes that it can be difficult to navigate which package or container is right for your particular set of needs.If you're a meal prepper or desire to become one, you'll probably want to invest in a set of rectangular, medium-sized glass containers like Bayco's 8-piece set available on Amazon for $31.99. Perfect for prepping all your meals.Image:  Bayco/amazonThey're easy to stack, heat, and fill with food for the entire week. But if you plan to eat salads primarily or foods that don't require reheating, these deli-style plastic containers from DuraHome might be a worthwhile investment. They're also perfect for freezer storage or holding dry goods.Endless options.Image:  durahome/amazonOh, and if you've been bringing a lot of soups or pastas to work with you, you may want to check out Zojirushi's Stainless-Steel Food Jar.While glass tends to be ideal for most food storage situations, I find that mini plastic containers are perfect for storing those last couple of onion slices, leftover dressing, or herbs in the fridge or freezer.Greenco's mini food storage containers make it easy to hold on to your leftover ingredients without taking up much space. They're BPA-free and freezer safe, but unfortunately they're not microwave compatible.You can store an infinite number of sauces in these bad boys!Image:  greenco/amazonFor all your general leftover needs, a nice set of glass containers that range in size should do the trick. We recommend the 30-piece glass Snapware set, available on Amazon for $$49.99. It may seem like more than you need, but I promise you'll find use for all of it.  You'll be thankful you invested in this 30-piece set.Image:  snapware/amazonBut, if you're convinced it's just too much for you, you can invest in Snapware's six- or eight-piece sets instead.Once you're fully equipped with an arsenal of food containers, you'll be ready for pretty much any leftovers situation.\nEvery product here is independently selected by Mashable journalists. If you buy something featured, we may earn an affiliate commission which helps support \nour work.\n"}