{"id": "MashableGet Dyson's most powerful cordless vacuum on sale for $138 off at Walmart — its lowest price ever", "paragraph": "Dysons are like the Lamborghinis of the vacuum world. But unlike a fancy Italian sports car, Dysons actually go on sale.Dyson's most powerful cordless vacuum, the V10 Motorhead Cordless vacuum, is $138 off right now, taking it down to an ultra-affordable $361.75.As the fanciest of Dyson's cordless stick line, the V10 isn't usually the model on sale. Its little brothers, the V6 and the V8, see deals pretty often — but the V10 is usually chilling at its regular price of $499. We did see it on sale this past Halloween, but today's sale price is about $20 lower than that, making $361.75 the lowest price we've ever seen on this bad boy, including on Amazon. NBD.The V10 sports the same sleek look and lightweight feel as the V6 and V8, but with better battery life (60 minutes on one charge), stronger suction with cyclonic technology, and the Dyson Digital Motor V10 (referred to by Dyson as the most powerful suction of any cordless vacuum ever). There's also an easier, more hygienic emptying bin, and, according to reviews, is significantly less obnoxious sounding. (The other models in the V10 series, the Absolute Cordless and the Animal Vacuum, see larger bins and more accessories and are also on sale — just more expensive.)Multiple attachments make it super versatile, and the HEPA filter traps dust, pet dander, and pollen, preventing it from getting out and messing with your allergies. With the push of a button, it can also be converted into the most badass handheld vacuum you've ever seen, ideal for cleaning in corners and in the car.This is your chance to stop complaining about your floor and snag a vacuum that gets the job done the first time: Regularly $499, you can save $138 and get the V10 for its lowest price ever of $361.75. And be sure to check back to Walmart on the regular this week, as they're dropping new deals every day to prep for Black Friday. Image: dyson  Dyson V10 Motorhead Cordless Vacuum — $360.75 See Details \nHeads up: All products featured here are selected by Mashable's commerce team and meet our rigorous standards for awesomeness. If you buy something, Mashable may earn an affiliate commission. \n"}