{"id": "Mashable'Luke Cage' and 'Iron Fist' are done. Is this the end for the Netflix Marvel-verse?", "paragraph": "Netflix canceled Marvel's Luke Cage on Friday, just one week after canceling Marvel's Iron Fist. With new seasons of Jessica Jones and The Punisher in the pipeline, a fresh Season 3 debut for Daredevil, and no plans to resurrect The Defenders, could this be the end of Netflix and Marvel's game-changing TV partnership?SEE ALSO: Netflix cancels 'Luke Cage,' the second Marvel series to goMarvel's Daredevil first premiered on Netflix in the spring of 2015, surprising television critics and comic book fans alike. The words \"dark\" and \"gritty\" were on repeat – the shadowy aesthetic and relentless fight choreography stunned viewers in the best way. Jessica Jones debuted that fall, the first female superhero headlining any Marvel or DC screen property, before Supergirl, Wonder Woman, or Captain Marvel came into our lives.Bringing in Jessica Jones and then greenlighting Luke Cage for the fall of 2016 set up the Netflix/Marvel universe; much like the Marvel Cinematic Universe, these heroes would have their standalone properties, their origin stories, their own villains and demons and values. But as with the MCU, there was a larger plan in place, the last piece of which came along in 2017 with The Defenders.Perhaps the deluge of Netflix/Marvel shows during that time set up a denouement for the franchise. We were averaging three shows a year, which is no small commitment for a viewer – it's one thing to get that many films in a year, but another entirely to digest nearly 40 episodes of television drama.Consider that Spider-Man: Homecoming, Thor: Ragnarok, Black Panther, Avengers: Infinity War, and Ant-Man and the Wasp all hit theaters during the same 12 months. That adds up to less than a single season of a Marvel property on Netflix, but it's four different properties and a massive crossover team up. It's the entire hype train pulling into the station and the party at the end of it, while putting in as much time on a Netflix series will only inch you out of the station.Jessica Jones (Krysten Ritter), Danny Rand/Iron Fist (Finn Jones), Matt Murdock/Daredevil (Charlie Cox) and Luke Cage (Mike Colter) in 'The Defenders.'Image:  sarah shatz/netflixIt's also been said since as early as Jessica Jones' debut season that 13 episodes is just too long for these shows. Luke Cage Season 1 struggled significantly in the back half, as did Daredevil Season 2 without the Punisher. Iron Fist remains an outlier; many were so put off by the premise and its problematic whitewashing that they didn't even bother, or couldn't get on board with the character even after trying. Iron Fist himself sticks out like a sore thumb in The Defenders, petulant and self-important but inexplicably the hill upon which they are expected to fight and die.Ironically, Luke Cage's Iron Fist crossover was one of the season's strongest episodes, and certainly the most palatable Danny Rand has ever been as a character. It merits asking whether the logical followup to Defenders wasn't just transitioning the Netflix/Marvel universe into crossover shows instead of standalones, difficult though they are to plan and execute.The Iron Fist/Luke Cage alliance strengthened both characters in a way that The Defenders should have – indeed, in a way that Defenders did strengthen Jessica Jones and Matt Murdock. The newer Netflix/Marvel shows still feel rushed compared to the pacing and detail of Daredevil and Jessica Jones' first outings, so it may be that Netflix simply canceled the weaker efforts – even if fixing them was a viable option.There's also the looming specter of Disney's standalone streaming service, which is poised to compete directly with Netflix, Hulu, and the like. Disney has more than enough cash to keep multiple superhero dramas afloat (thanks again, MCU!) and the rights to almost all Marvel characters.With two drastic cancellations so close together, we can't help examining the implications for the wider Netflix/Marvel universe. Ultimately, all these shows were going to end some day and are too costly and detailed to run for seven seasons like a network comedy. This may be the beginning of the end, but perhaps the end was always nigh at this time. In the meantime, we suggest Daredevil Season 3, now streaming on Netflix."}