{"id": "MashableWe regret to inform you Trumpy Bear is a *real* thing you can spend money on", "paragraph": "Looking for something to tightly squeeze while you fear for the future of American politics? Trumpy Bear is here to help... or at least help give you nightmares. The purpose of this terrifying little creature is unclear, but the product is very real.For those who haven't yet seen the commercial for Trumpy Bear, a Trump-themed teddy bear with an American flag blanket hidden in its back, let us fix that.The ad resembles an amateur splicing of deleted scenes from the Twilight films, a classic, embarrassing infomercial, a class project, and an extremely low-budget campaign commercial. And there's a very good chance after watching it you'll think it's fake. But it's unfortunately not.The stuffed bear is really for sale and can be yours for two payments of $19.95 (plus shipping).SEE ALSO: Donald Trump’s election was a 'traumatic experience' for many college studentsThough Trumpy Bear has been advertised for a year, the commercial — complete with clueless-looking actors, poor editing, a laughable voiceover, and completely unrealistic scenarios — is so bizarre that each time a clip is shared on social media it attracts fresh attention.So when Fox News aired a Trumpy Bear ad on Monday morning, people were shook all over again.I can't believe this commercial that just ran on Fox News is for real pic.twitter.com/gGInt8BKhp— Aaron Rupar (@atrupar) November 12, 2018Fox News' Senior Vice President of Eastern Sales, Dom Rossi told Mashable, \"This was a local ad purchase with the cable operator. We do not do business with them nationally.\" But damage was still done.Many people have a hard time believing the bear, with it's ill-fitting blonde combover, long red tie, and white collar and wrist cuffs, is real. And once they find out it is, the reality is equally (if not more) challenging to grasp.Image:  screengrab//gettrumpybear.comAs you may have guessed, many people cope with the upsetting revelation that this bear does exist by mercilessly trolling it. Here are a few examples.The Trumpy Bear is one of the grossest things I’ve ever seen. pic.twitter.com/f13Wj7AAbX— Frederick Joseph (@FredTJoseph) November 12, 2018WARNING: Do not get Trumpy Bear wet. Even a drizzle will ruin his patriotism. pic.twitter.com/msvKGCJfVT— Adam Best (@adamcbest) November 12, 2018*Note: Actual Trumpy Bear may come with Russian Flag, not American.*— Kaluvien (@Kaluvien) November 12, 2018Fitting that Trumpy Bear shits out an American Flag. pic.twitter.com/xWbnSifsi7— Jeremy Newberger (@jeremynewberger) November 12, 2018I wonder if the Trumpy Bear is a licensed product. In the 80s, Kareem Abdul-Jabbar sued a toy company for an unlicensed product called \"Kareeem Abdul-Jabear.\" Part of the terms of his legal victory was that he got to take all the existing bears from the company pic.twitter.com/hc1ct2yHix— john wilmes (@johnwilmeswords) November 12, 2018CNN: WH confirms Trump will not visit Arlington cemetery on Veteran’s Day due to rain.NBC: WH confirms Trump will not visit Arlington cemetery on Veteran’s Day due to rain.Fox News: Show your patriotism by buying Trumpy Bear! The bear with a flag up its butt!— The Volatile Mermaid (@OhNoSheTwitnt) November 12, 2018The Trumpy Bear ad packs everything bad about infomercials into a horribly painful two minutes, and brings politics into the mix to make things even worse.But according to the commercial, the China-made bear will improve your golf game! So how can you pass on an offer like that?UPDATE: Nov. 13, 2018, 9:57 a.m. EST Updated with statement from Fox News."}