{"id": "MashableWhy you should give kids toys that look like them", "paragraph": "Welcome to Small Humans, an ongoing series at Mashable that looks at how to take care of – and deal with – the kids in your life. Because Dr. Spock is nice and all, but it’s 2018 and we have the entire internet to contend with.Now more than ever, it’s particularly evident that children need to be exposed to diversity as young as possible. It’s a topic that can inspire hesitation among a lot of parents, but setting the foundation for inclusivity isn’t as hard as you might think. Interactive play with diverse toys can be a great method to accomplish this. Diversity – which is often used in tandem with inclusion – in this context refers to having access to toys that represent individuals of a range of races/ethnicities, ability statuses, and genders. There are other aspects of diversity that are more challenging to represent without backstories. For those, books are a wonderful way to introduce aspects of diversity like sexual orientation, financial class, language, neurodiversity, and mental health. According to psychologist Dr. Amber A. Hewitt, a specialist in gendered racial socialization, being exposed to diversity via toys has great benefits for identity development. “An inclusive toy box can promote positive racial/ethnic, gender, and cultural identity development for children. It’s important for children to see themselves reflected in their toys,” Hewitt explains. She explains how a lack of representation in one's toy box can send harmful messages ranging from “people who look like me don’t matter” to concerns if there are others who look like them. In this way, diverse toys can promote inclusion by literally making members of marginalized groups more visible in a child's daily life, as well as giving children more models that reflect themselves. “All of the messages can impact a child’s sense of self-worth and can perpetuate stereotypes. It’s important to remember that not all of the messages that children receive are verbal. And children learn, including learning messages about identity, through play,” Hewitt says.It’s hard to think about the subliminal impressions children pick up through toys without thinking of the “Doll Test” of the 1940s. The experiment revealed that all children, including Black children, showed signs of white bias, and the results have been mostly consistent through the years. Hewitt also believes it’s essential that we don’t send gendered messages to children during play. “I encourage caregivers and educators to avoid language based on gender stereotypes which perpetuate assumptions about the types of toys boys and girls “should” play with,” she concludes. It’s important for children to see themselves reflected in their toysAn inclusive range of toys is vital for children of all stages and demographic backgrounds. Not only for reflections of themselves but also as a means of seeing the diversity of the world. The following items set an excellent foundation for an inclusive toy box. By now, you’ve likely heard of Barbie's new STEM-related dolls, as well as the role model collection that’s inspired by many of our favorite IRL heroes including, Chloe Kim, Katherine Johnson, and Ibtihaj Muhammad.But if Barbie is just a bit too problematic for your taste, you have another option: The Lammily Doll. The female Lammily doll hit the scene in 2014, and a male version was released in 2016. Based on the body of the “average” 19-year old American, Lammily brings a realistic image to pretend play. The company even sells reusable stickers and kits to simulate real-life milestones like pimples, bruises, and menstruation. Plus they’re produced by a small family-owned company. As Dr. Hewitt said above, it’s essential we don’t limit children to the narrow classifications of gender-based toys, as those limitations can enforce unwanted gender stereotypes. Unfortunately, children pick up on messages – such as “Boys shouldn’t play with dolls\" – early. Teaching boys, in particular, to feel and express their emotions has benefits throughout their lives. The Wonder Crew is a novel set of dolls made with boys in mind. A recent Doll Of The Year winner, Wonder Crew encourages friendship, caretaking skills, and freedom of expression to young boys. According to its creator, the five-option doll set was created to motivate and remind young boys that they can go anywhere and be anything.    Image:  Courtesy marvelYou may not always know the best way to talk your child about people who are differently abled. Thankfully, the Friends With Diverse Abilities Figure Set by Marvel Education provides an interactive doorway to the conversation. These action-style figures were created for children from kindergarten to third grade, but they have to potential to spark meaningful conversation for folks of any age. Most of the examples are of physical disabilities, including limited mobility, low vision, and deafness. The set also provides examples of gender, racial, and age diversity. If you want to spread the joy, gift them to your child's daycare or preschool Children of the World Memory Game was inspired by the classic song \"If you’re happy and you know it\" and it also exposes 4-to-7-year-olds, and anyone else who plays it, to cultural diversity. The objective of this game is to match boy/girl pairs with information regarding their traditional attire, country name, and background colors. This game is fantastic because it provides an age-appropriate introduction to cultural differences that preschool and early elementary school age children may not encounter otherwise. I’m sure all of us a can remember a time a loved one visited a faraway place and brought back a souvenir. That personal gift connected us to their travel and sometimes created a long-term desire to see the place for ourselves. These artifacts aren’t limited to geographic destinations. They can also be from places that highlight critical cultural movements like museums or monuments. Posters, books, and key chains all have the potential for long-term impact when given with love and a detailed backstory.    However, it’s vital that parents and gift-givers provide cultural context to gifts that relate to specific groups and time periods. If you're concerned that a gift might be culturally appropriative or otherwise problematic, keep the following guidelines in mind. Always include a fact-based description or book that explains the gift within the necessary cultural context in language the child can understand.Prioritize buying items that are explained and sold by members of the group. Teach the child that possession of the item does not qualify them to speak on the culture, specifically over members who belong to that culture.Historical gifts related to the child's own lineage or cultural identity can deepen a sense of appreciation and connection. Childhood is a time for play, exploration, and fun, but the toys we use to support this can have lasting effects beyond just a pleasant afternoon. Read more great stories from Small Humans:   Wild parenting advice from the first man to win a paternity leave suit10 apps to help your kids learn to control their emotions Real life vs. online life: For kids, is there a difference?Baby sleep gadgets to try if you're really tired and desperate"}