{"id": "MashableWith new $2,300 iPad Pro, Apple proves itself a bunch of brilliant jerks", "paragraph": "My 2017 iPad Pro, with uncanny timing, has started acting up these past few days. All of a sudden there's a patch of lighter-than-the-rest pixels at the bottom of the screen, and I can't stop looking at it. It's the proverbial fly in the ointment, the stain you can't remove: a reminder that even mighty Apple technology will break down and die, faster than you'd like. So when Apple came calling with a new iPad Pro lineup Tuesday morning — without mentioning it costs more than $2,300 at the upper end —  I was probably more vulnerable to the sales pitch than the average fanboy. *A 1TB iPad Pro w/ cellular, Apple Care, Apple Pencil and Smart Keyboard is actually $2356* (the 15-inch MacBook Pro starts at $2399 by comparison) pic.twitter.com/wal9tS5Sev— Karissa Bell (@karissabe) October 30, 2018I was dazzled by the 12.6-inch iPad, or rather by the reduced bezel size that trimmed this former monster to the size of legal paper — not that much larger overall than my current 10.1-inch device with larger bezel and case. (Those numbers refer to the size of the screen itself, rather than screen plus bezel; by keeping the former the same, the device shrinks.) I was most definitely seduced by the new flat-sided Apple Pencil, which attaches magnetically to the side of the new iPad Pro — and wirelessly charges at the same time! With my current round Pencil, I had to buy a third-party Pencil-holding case to keep it close, and I invariably forget to plug the Pencil into the lightning port. At the same time, I was sad that Apple had removed the headphone jack (again!), and that it was forcing iPad Pro upgraders to use the insecure Face ID system rather than Touch ID. So much for Pro users who want to listen on superior wired headphones without a mass of dongles, or unlock their iPad Pro while wearing a hat and shades. Ironically, Apple had just revealed it was keeping the headphone jack in the new MacBook Air, and, uh, adding Touch ID. So the company clearly understands that both are important to computer users. And yet it claims to be pitching the iPad Pro at the computer-buying market.Your wallet says no. Your heart says go.And then there was the price tag. To be clear, $2,356 is what it costs for a one-terabyte 12.6-inch iPad Pro with Pencil, Smart Keyboard and Apple Care. (We haven't included the cost of any cases or extra adapters you might need; the iPad Pro charges via USB-C rather than lightning, so anything you attached to your iPad via the old cable system will need to be upgraded with a new dongle.) Sure, not all iPad Pro buyers are going all-out like that. But here's my guess: Apple is going to be extraordinarily good at upselling on this one. In fact, most users are probably going to upsell themselves.If you're in the market for an iPad Pro, why not get the maximum storage? Think of everything you could do with a 1TB device — especially now that you can use fully-fledged Photoshop on it. Not to mention the console-style games Apple is pushing hard (the launch event included a demo of NBA 2K19). SEE ALSO: Apple doesn't need new hardware — it's going to make you buy everything it sellsThis, of course, is Apple's M.O. It's the reason why they don't just issue a press release every year. The product introductions are riots of color and form and function; marketing so good you don't even realize it's marketing. It's easy to imagine the best version of yourself, if only you had this beautiful new, light yet giant screen in your hand.Your wallet says no. Your heart says go. Also part of Apple's M.O. in the Tim Cook era, unfortunately, is this \"my way or the highway\" approach to technology upgrades. You need to plug in an aux cable, for whatever reason? You prefer the secure fingerprint-unlocking system of Touch ID? Tough shit. Go buy a new MacBook Air instead. You have a million lightning cables? Go buy a million USB-C cables. On the pricing front, Apple has always eschewed the low-range market — but now it appears to be eschewing the midrange market, too. It's all about high-end purchasers these days, or making midrange people max out their credit cards, and if that isn't a metaphor for America as a whole I don't know what is. We're used to this approach on the smartphone side of things. Because they are smaller and more frequently used, we even forgive it. We watched Apple release a $1,449 iPhone XS with no Touch ID and no headphone jack, and we said nothing. Then they came for the iPad Pros. Will I get the new iPad Pro anyway? It seems very likely that I will. After all, in order to fix the too-bright patch of pixels on my current device, I will have to walk into the Apple Store. There I will walk past a gleaming display of spanking new slim 1TB iPad Pros, with impossibly large screens, impossibly small bezels, magnetic Pencils attached to perfectly machined, recycled aluminum sides. And right there, I will picture my best self living my best life.My wallet doesn't stand a chance."}