{"id": "MashableEverything announced at the 2018 Apple iPad event", "paragraph": "It feels like we literally just wrapped up a major Apple event with three new iPhones. But wait, there's more...SEE ALSO: Apple's Oct. 30 iPad and Mac event: live blogIt's only been a month, and Apple is already releasing more hardware. This time the company held a special media event at the Brooklyn Academy of Music, where it showed off new iPads, MacBooks, a Mac Mini, and even a revamped Apple Pencil. Here's a look at everything that was revealed. First up was the new MacBook Air equipped with a Retina Display. The popular laptop now has thinner bezels, a thinner profile, and it's lighter than the previous generation at just 2.75 pounds. Also, the MacBook Air is getting Touch ID, which lets you sign into your computer and use Apple Pay with your fingerprint. (Apple decided to ditch the Touch Bar for this laptop.) The MacBook Air has the same keyboard as the MacBook Pro, and a Force Touch trackpad with 20 percent more surface area. All those features aren't cheap. The new MacBook Air starts at $1,199, which is $200 more than its predecessor. The Mac Mini returns.Image:  screenshot / mashableNext up: the Mac mini, which Apple CEO Tim Cook called the \"small but mighty Mac our users have been waiting for.\"The desktop computer is back after four years of no updates. It's now Space Gray and five times faster than the previous model. The entry-level Mac mini features 8 GB memory, a 3.6 GHz quad-core i3 processor, and 128 GB SSD. It starts at $799, but you need to bring your own keyboard, monitor, and mouse.The 11-inch and 12.9-inch iPad Pro are mostly screen.Image:  appleHere's what this event was really about: a completely redesigned iPad Pro. Gone is the home button, which makes room for more screen. The new 11- and 12.9-inch iPad Pro models feature thinner bezels, and they open like the iPhone X series: with Face ID.Cook called the display \"a magical piece of glass.\" Like the new iPhone XR, the iPads have curved edges. They also feature a Liquid Retina display. The Pro line now uses USB-C, which Apple touted as an easier way to connect to other devices and accessories, like cameras. The new iPad Pro also uses the same chip found in the iPhone XS, the A12X Bionic. Plus, there's a new Photoshop app for iPad available next year. The 11-Inch iPad Pro starts at $799, while the 12.9-inch iPad Pro starts at $999.The Apple Pencil magnetically sticks with the new iPad Pro.Image:  Stephanie Keith/Getty ImagesFinally, the Apple Pencil ($129.99) had its moment. The new digital stylus connects magnetically to the iPad Pro and charges wirelessly. Tap it to change modes or double tap to move from different apps. It no longer has a Lightning connector, a big change for streamlined compatibility with the new iPads.Before ending the Brooklyn event, Cook gave a quick update on iOS for Apple's iPhones and iPads, and how it's finally ready for Group FaceTime. The event ended with a performance by singer Lana Del Ray — and no mention of the AirPower charging station. Maybe next year?"}