{"id": "MashableNASA's Kepler Space Telescope is dead. Long live Kepler.", "paragraph": "All good things must come to an end, on Earth and even in space. NASA announced on Tuesday that the Kepler mission — which has transformed how we understand planets outside of our solar system — is officially over.According to the space agency, Kepler has run out of fuel in space, ending its 9.5-year planet hunting mission.\"Before we launched Kepler, we didn't know if planets were common or rare in our galaxy,\" Paul Hertz, NASA's Astrophysics Division director, said in a press call Tuesday.Thanks to Kepler's data, which was all safely beamed back to Earth before the end of the mission, we now know that planets are, in fact, exceedingly common. The spacecraft is responsible for finding more than 2,600 exoplanets circling distant stars in far-off parts of the galaxy. There's poetry in Kepler's ability to make us feel both small and also so connected to the rest of our universe. SEE ALSO: Scientists think they've found a moon orbiting a world outside the solar system\"The science and new discoveries were fantastic and changed our view in many fields of astrophysics and planetary science, including, of course, exoplanets,\" Kepler scientist Steve Howell said via email. \"But what was just as amazing to me was the implications, contacts, and conversations I had over the years with others about religion, life, the universe, and our home planet Earth,\" Howell added. \"I had not expected this amount of world-wide interest in the philosophical arenas nor how deeply engaging the scientific discoveries played into the minds of us all.\"Space fans have known Kepler's end was coming for some time. Kepler — which detected exoplanets by spotting the minute dips in a star's light as a planet passes before it — has experienced a number of technical issues over the years.Artist's illustration of Kepler in spaceImage:  NASAKepler no longer had the ability to keep itself pointed in one direction after it lost the use of two reaction wheels in 2012 and 2013. Since that time, NASA changed the craft's mission to adjust to the telescope's new normal, calling the updated mission K2. And even though the mission is at an end, that doesn't mean Kepler's scientific life is finished.\"We know the spacecraft's retirement isn't the end of Kepler's discoveries,\" Jessie Dotson, Kepler's project scientist at NASA’s Ames Research Center, said in a statement. \"I'm excited about the diverse discoveries that are yet to come from our data and how future missions will build upon Kepler's results.\"There are many exoplanet-hunting missions on the horizon as well. NASA's Transiting Exoplanet Survey Satellite (TESS) is already in space and embarking on its own planetary hunt using a similar method to Kepler, keeping an eye on dips in starlight as planets move between the satellite and its host star.While Kepler was focusing on looking for planets around sun-like stars, TESS will advance its legacy by looking at smaller stars to find Earth-sized worlds out there in the universe. NASA's James Webb Space Telescope will also keep a keen eye on exoplanets, even possibly going so far as to peer into the atmospheres of these worlds to understand if they might be habitable. Kepler's mission is over, but its legacy lives on."}