{"id": "Mashable10 online courses that can teach you something useful for $15 or less", "paragraph": "Are you waist-deep in that Q4 funk? Feeling like you're stuck in a professional rut? Well, to quote Sam the onion man from Holes: We can fix that.For a limited time, the Mashable Shop is having a sale on a set of ten practical courses listed below. Think of it as an early holiday present to your career.Here's the scoop:Yes, you can actually rewire your brain. No, it doesn't involve some fancy-schmancy Inspector Gadget-like procedure. All it takes is a little knowledge of neuroplasticity, or the brain's ability to change and reorganize itself by forming new neural connections. In this 30-lecture course, you'll discover how to eliminate toxic habits, fulfill resolutions, learn new skills, and even edit memories using the power of brain training. Image: Pexels  Neuroplasticity: How to Rewire Your Brain — $10.99 See Details One in four people claims to experience glossophobia, or the fear of public speaking. If you're one of them, this course is for you. Across 206 lectures, it'll teach you how to structure a speech, relate to your audience, and use your body language to your advantage while delivering a talk or demonstration. As a bonus, you'll also get 25 speech guides and more than 50 slide templates that you can use to organize your own presentations. Image: Pexels  The Complete Presentation and Public Speaking Course — $ 9.99 See Details Don't just speed read — speed learn. In this five-hour course, you'll find out how to hack your brain using advanced memory techniques and knowledge of the brain's cognitive functions, which you can then use to learn different skills, dive into new languages, and speed read with higher comprehension. It'll have you gobbling up new information like Pac-Man on a Power Pellet. Image: Pexels  Become A SuperLearner 2: Speed Reading & Memory — $11.99 See Details Wouldn't it be great if Excel could crunch your numbers for you? Well, it can — provided you know a little something about its scripting language, Visual Basic for Applications (VBA), that is. This 10-lecture class covers VBA essentials like recording action sequences into macros so you can start automating tasks in Excel — no previous programming knowledge required. Image: Pexels  Become an Excel VBA Expert for Beginners — $12 See Details Hack your way to happiness with this 33-lecture course from award-winning business school professor and venture capitalist Chris Haroun. Across 30 exercises, he'll use the tips he's come across in meetings with successful business people to teach you how to improve your outlook on life, find your passion, and maximize your overall productivity. Image: Pexels  30-Day Challenge: Boost Your Productivity & Happiness — $10.99 See Details Get some sought-after experience in the markup language HTML 5 by enrolling in this course designed by web development professionals. By the end of its eight sections, you won't just know the basics of HTML 5 syntax, but you'll know the ins and outs of HTML5 Canvas and Graphics and the style sheet language CSS3, too. Image: Pexels  HTML 5 from the Ground Up — $15 See Details Whether you're a blogger, a marketing professional, or just someone who wants to write compelling content, you should know the ins and outs of solid copywriting. This 15-lecture class will teach you how to understand readers' needs, for which you'll then start crafting attention-grabbing headlines, sales copy, and writing that's been optimized to perform well in search. Image: Pexels  Professional Copywriting Masterclass — $12 See Details Get financially literate with the help of this class, which explores the fundamentals of accounting, financial modeling and analysis, and valuation throughout 43 lectures. By the time you've finished it, you'll not only have a better picture of your personal finances and goals, but also some valuable accounting experience that you can add to your résumé. Image: Pexels  Introduction to Finance, Accounting, Modeling, and Valuation — $10.99 See Details If you're starting at ground zero in terms of JavaScript knowledge, a great launchpad for learning the popular programming language is this one-and-a-half-hour crash course. Once you've completed all 16 of its lectures on the Document Object Model (DOM), arrays, events loops, and more, you'll use what you've learned to build your own JavaScript-based webpage. Image: Pexels  Learn Essential JavaScript Fundamentals — $12 See Details This 105-lecture class will teach you everything you wish you learned in school (but didn't), like how to analyze your spending, make a budget, do your taxes, make investments, improve your credit score, and much, much more. Included is a 25-exercise Excel spreadsheet that'll not only help you save and protect your money, but also make more of it. Image: Pexels  The Complete Personal Finance Course — $9.99 See Details \nHeads up: All products featured here are selected by Mashable's commerce team and meet our rigorous standards for awesomeness. If you buy something, Mashable may earn an affiliate commission. \n"}