{"id": "MashableCalifornia cities now have the worst air pollution on Earth as smoke blows into town", "paragraph": "Oakland, a Northern California city with a population of over 425,000, had the worst air quality in the world Saturday morning.Wildfire smoke wafting over from the still-growing Camp Fire — by far the deadliest wildfire in state history — had inundated many heavily-populated California cities and towns with small bits of pollution thinner than the width of a human hair, called Particulate Matter 2.5, or PM 2.5.Berkeley Earth, a scientific climate organization, keeps tabs on air pollution around the globe. As of Nov. 17 at 9:30 a.m. ET, Oakland topped the global list with particle concentrations of 167 μg/m3  (meaning micrograms per cubic meter) — which are levels deemed \"Very Unhealthy\" by the U.S. Environmental Protection Agency. Coming in a distant second is Kanpur, India with particulate levels of 132. Wildfire smoke and haze are enveloping  most of the region this afternoon. Very unhealthy air quality conditions continue. #CampFire #cawx pic.twitter.com/LXmX1RdCce— NWS Sacramento (@NWSSacramento) November 16, 2018For reference, air pollution experts consider India to have the worst air pollution on the planet. Last week, air pollution levels in India's capital city of New Delhi were literally off the charts. The Northern California cities of San Francisco and Oakland also placed in the top five, as of Saturday morning. Friday, the air pollution was no better, with the five top spots all taken by heavily-populated California cities: Stockton, Sacramento, San Francisco, Oakland, and San Jose. For a limited time only, the five cities experiencing the worst air pollution right now are all in California.  #CaliforniaFires #CampFirehttps://t.co/fBjbSgLuM8 pic.twitter.com/ecGk5HZAUW— Robert Rohde (@RARohde) November 16, 2018Increasing amounts of unhealthy to hazardous air pollution in the U.S. are one of the most well-understood and predicted consequences of climate change, as warmer climes produce larger wildfires.It's also well understood that particulate air pollution doesn't just make it difficult to breathe in the short term, but it's linked to serious heart disease.  A recent 10-year-long Environmental Protection Agency study observed some 6,000 people and found exposure to this particulate matter (PM 2.5) accelerated the build-up of plaque inside the walls of blood vessels, which leads to heart attacks, strokes, and even death.  SEE ALSO: When will this terrible wildfire season in California end?California's sustained air quality woes have been further aided by a common weather phenomenon known as an inversion layer, wherein air pollution gets trapped under a layer of warm air, trapping the cooler air below.  This is I-5 in Sacramento at 3:30pm. Smoke so thick you need headlights pic.twitter.com/GhOeBjzf9s— Mark Finan (@kcraFinan) November 15, 2018Climate scientists expect California to experience more smoke-filled autumns as the century progresses, specifically because falls are expected to be drier. This sets the stage for profoundly dry grasslands, scrublands, and forest, which are likely to ignite with any spark. The parched Golden State, however, may get a reprieve from fires around Thanksgiving: Wet storms from Alaska may pour rain over the ashy, smoke-ridden land. "}