{"id": "MashableApple is slowly squeezing even more out of customers", "paragraph": "It’s getting even more expensive to use Apple products.At Tuesday’s Apple event in Brooklyn, the Cupertino-based tech giant unveiled the next generation of the iPad Pro, MacBook Air, and Mac Mini. Each updated device is more powerful than ever, with multiple add-on options that further enhance performance. Of course, those higher-end features come at a price. And Apple’s base pricing for the entry-level version of each of its products is rising, too.SEE ALSO: Everything announced at the 2018 Apple iPad eventTake the new iPad Pro. This generation of Apple’s flagship tablet is faster, thinner, and has more screen space than ever. The most affordable model, the new 11-inch iPad Pro, starts at $799. The 12.9-inch iPad Pro comes in at $999. Not bad for tablets that Apple puts up against competitors’ full-fledged laptops. But if you take a look at the base pricing of the previous generation of iPad Pros, you’ll find the cost for a 2017 10.5-inch iPad Pro and 12.9-inch iPad Pro when they were first released started at $649 and $799, respectively. That’s a $150 less for the 11-inch iPad Pro and $200 less for the 12.9-inch version.The MacBook Air also received a refresh, as was announced in Brooklyn. The previous 13-inch MacBook Air model came out in 2015, so the updated model brings about a much-needed upgrade. But along with the new redesign, keyboard, and retina display comes a new base price. When the previous MacBook Air was launched, one of the more attractive attributes was its $999 starting pricing. Apple has bumped the base price of the new MacBook air to $1,199 — a $200 difference.The most recent Mac Mini, Apple’s tiny desktop computer, was released in 2014, making Apple’s 2018 version overdue. While the long-awaited update is certainly a welcome sight, it also comes with the biggest entry-level price increase. The new base-level Mac Mini starts at $799 for 128 GB SSD, 3.6 GHz quad-core i3, and 8 GB of memory. That’s a whopping $300 price increase from the previous $499 base pricing of the 2014 edition. In fact, back when they first came out, this site opted to review the mid-range 2014 Mac Mini, which came with 2.6GHz dual-core Intel Core i5 processor, 8GB of RAM, and a whopping 1TB hard drive. That mid-range 2014 model sold for $699 — $100 cheaper than the base model of the the newest entry-level Mac Mini. One of the more enticing aspects of the Mac Mini was just how affordable it was compared to every other Mac. While it’s still the least expensive, it’s certainly not as cheap as it once was.Even the peripherals are more expensive.Even the peripherals are more expensive. The new Apple Pencil is $30 more than its predecessor. There’s also a $9 dongle you need to buy if you want to connect your headphones to the now-headphone-jack-less iPad Pro.Last month, Apple announced its new line of iPhones. At a starting price of $999 and $1099 respectively, the iPhone XS and XS Max are the company’s most expensive phones ever. Even the more affordable model released just this month, the iPhone XR, has a more expensive base price at $749 than previous lower-end launch models like the iPhone 8.While Apple’s latest line of products is more impressive than ever, they're becoming more expensive than ever, too. Apple needs to be careful about squeezing too much out of its customers, as they risk pricing many people out."}