{"id": "MashableElon Musk knows some of his tweets are too much and that 'Tesla cannot die'", "paragraph": "Tesla, SpaceX, and the Boring Company CEO Elon Musk made an appearance on Recode's podcast and he talked to the publication's Kara Swisher about tweeting, building a car company, a cyberpunk Tesla pickup truck, electric scooters, and the race to self-driving cars. Plus a whole lot more, like the eccentric billionaire's likely demise on Mars.In an hour-plus conversation the tech journalist hit on a lot of hot topics and Musk didn't evade or skip around most answers. He admitted that his tweeting habit — while not as time-consuming as some might assume, at about 15 minutes a day — led to to some regrettable moments.SEE ALSO: HELP WANTED: Electric car company seeks supervisor for CEO\"It’s fair to say I would probably not have tweeted some of the things I tweeted, that was probably unwise. And probably not gotten into some of the online fights that I got into. I probably shouldn’t have attacked journalists, probably shouldn’t have done that,\" he said.He didn't mention the $40-million tweet that stripped him of his chairman title after the SEC accused him of securities fraud for posting about taking Tesla private. But he did say he can't tweet as freely now because of an SEC settlement. \"I think it’s mostly just if it’s something that might cause a substantial movement in the stock during trading hours,\" he said.So he'll still be tweeting.We got clued into some new Tesla vehicles, like the Roadster sports car and Model Y mid-size SUV. Then Musk got giddy over the future Tesla pickup truck.\"It’s gonna be like a really futuristic-like cyberpunk, Blade Runner pickup truck. It’s gonna be awesome, it’s gonna be amazing. This will be heart-stopping. It stops my heart. It’s like, oh, it’s great,\" he said.But don't expect a Tesla scooter — Musk says it \"lacks dignity\" even if it's an electric vehicle. But an e-bike or electric plane aren't out of the question.As to Tesla competitors, Musk didn't get into it, but he acknowledged that in terms of self-driving cars Google's Waymo is the closest to accomplishing autonomous driving. He says it's a software issue and that Tesla's Autopilot software is the best contender. Tesla is likely to have fully self-driving vehicles out in 2019.\"I don’t wanna sound overconfident, but I would be very surprised if any of the car companies exceeded Tesla in self-driving, in getting to full self-driving,\" he said.All this hard work (and no sleep, though Musk says he's working on resting more) for his various companies really stem from Musk's core belief that his innovations push everyone forward, especially when it comes to electric vehicles.\"Tesla cannot die,\" he told Swisher. \"Tesla is incredibly important for the future of sustainable transport and energy generation. The fundamental purpose, the fundamental good that Tesla provides is accelerating the advent of sustainable transport and energy production.\"The conversation was recorded on Halloween and includes some digging and tunnel dad jokes, naturally."}