{"id": "MashableApple's new MacBook Air is fine. Just fine.", "paragraph": "Apple's MacBook line has clarity again.The MacBook Air, formerly the neglected stepchild among Apple laptops, is reborn: It's still basically the same wedge-shaped computer Steve Jobs introduced in 2008, but it's sporting USB-C ports, a retina display, and a modern chip inside.Importantly, it fills another hole in Apple's lineup: the midrange. When Apple refreshed its MacBook Pros in the summer, it didn't bother updating the non-Touch Bar model, meaning for anyone who didn't want to shell out $1,800+ didn't really have an option if they wanted something with the latest Intel chip tech.SEE ALSO: Is Apple's iPhone XR the best premium phone value of 2018? — Mashable ReviewsThey do now. The new MacBook Air essentially obsoletes the non-Touch Bar MacBook Pro, sporting the same ports — two USB-C/Thunderbolt 3 ports and a headphone jack — and better features (including the secondary T2 chip that helps secure Touch ID and until now has been reserved for Apple's high-end machines) while undercutting the price: The fresh Air starts at $1,199, or $100 less than the weakest Pro.Image:  Pete Pachal/Mashable.That effectively downranks the skinny MacBook to entry level in Apple's lineup, since it starts at $1,099. The revised lineup, stepping from MacBook to Air to Pro, feels right, although it's hard to overlook that Apple has decided in 2018 that its customers should pay more for all their products. That shouldn't be too surprising in a year Apple released a $1,449 smartphone, but it doesn't make it easier to swallow.All that said, Apple technically hasn't discontinued the old MacBook Air. The screen is low-res, and the silicon is wildly outdated, but it's still available for $999, if you want it.I took the 2018 MacBook Air for a spin right at the close of Apple's Brooklyn event. From a distance, the aluminum finish is unmistakably a MacBook. It comes in three finishes: space gray, gold, and traditional silver. My favorite is probably space gray, though the gold is quite nice. It has just a hint of coral, making it closer to the current gold iPhone XS rather than the gold skinny MacBook of old.Image:  Raymond Wong/MashableFirst, the keyboard. Apple says it's the same third-generation butterfly keyboard found in this year's MacBook Pros. Typing things out on a couple of the models at the hands-on area, I felt the experience was subtly different from the Pro keyboard, though. They keys appeared to have a little more cushion, requiring ever-so-slightly more pressure to type.That's a little surprising, since both models should theoretically have the same experience, since both have the extra membrane beneath the keys (which Apple says is to make it quieter, but is probably mostly there to improve reliability). The area was noisy, so it was hard to get a sense of how quiet the keyboard was, but it definitely felt like the keys didn't have the same \"slap\" as the ones on my daily drive, a 2017 MacBook Pro (2nd-gen butterfly), so it wouldn't surprise me if it was a hair quieter.Image:  Raymond Wong/MashableI wish I could marvel at the screen. Apple's 13.3-inch 2,560 x 1,600 display on the Air looks great, certainly. I checked out photos, websites, and various apps, and details (like tiny text) looked crisp and colors looked fantastic in photos. However, the brightness struggled to compete with the studio lights in the hands-on area (iPhones looked fine), so it's not superhuman.Moreover, it's catch-up. Pretty much any screen these days looks better than the old MacBook Air non-retina display. If Apple has upgraded this screen to the point where it deserves to be called \"Liquid Retina\"... well OK, I guess, but, to the eye, it's hard to see how the Air is any better than the display on the Surface Laptop, or the Google Pixelbook, or even Apple's own MacBook Pros. It's a retina display, great. What else ya got?Image:  Raymond Wong/MashableBetter speakers, for starters. Even in a crowded demo room, I could tell the Air's speakers were doing a decent job of playing the audio of a clip from Ready Player One. I'll have to more fully test them out in a full review, but better sound is a welcome upgrade for those of us who spend a great deal of time on conference calls.There's also the Force Touch trackpad. I don't use Force Touch much at all, but I used the new Air to Force-select an address in Notes to call up Apple Maps. Nice, though it's not persuading me to use the feature. The trackpad itself is a fine upgrade, but again — catch-up. It's nice and large (if a bit smaller than the trackpad on the MacBook Pros), but also unremarkable.Image:  Raymond Wong/MashableAs for performance, the new MacBook Air did a fine job. It competently ran a bunch of apps, Safari loaded a half-dozen highly visual websites, and generally didn't lag. App-switching from Xcode to Maps to Photos and back was quick. Touch ID appeared to work as fast as it does on my regular 2017 MacBook Pro.If you think I'm using the word \"fine\" too much, you're probably right. The new MacBook Air looks like a great midrange machine, and Apple's seemingly ticked all the boxes in giving the current Air owners what they want in a modern laptop.Image:  Raymond Wong/MashableThe thing is, there are plenty of modern laptops. If you've already got an Air (or a lower-end Pro) and are looking to upgrade, everything I experienced suggests this is the machine you want. But for anyone else? It's hard to pinpoint where the MacBook Air stands out to the point where you'd buy it over, say, a Lenovo Yoga.Ten years ago, Apple's original MacBook Air set a new bar for laptops. It got a new lease on life today, but this time as a follower, not a leader."}