{"id": "MashablePowerful Stan Lee column from 1968 about racism resurfaces on Twitter", "paragraph": "Following the death of Marvel comics' Stan Lee, people have begun recirculating a 1968 column Lee wrote denouncing racism (something a disturbing number of politicians refuse to do to this day).As part of his storied comics career, Lee spent almost four decades writing regular installments of  \"Stan's Soapbox\" on the backs of comics, in which he frequently fought for his heroes' values of tolerance and equality. SEE ALSO: Chris Evans and Robert Downey Jr. remember Stan Lee with heartfelt posts\"Bigotry and racism are among the deadliest social ills plaguing the world today...It’s totally irrational, patently insane to condemn an entire race — to despise an entire nation — to vilify an entire religion,\" Lee wrote. \"...Sooner or later, if man is ever to be worthy of his destiny, we must fill out hearts with tolerance.\"Stan Lee leaves behind a complicated legacy. He brought joy to the world while causing pain to the little guy behind-the-scenes. But if we can take something positive from the life he lived, it’s that he made sure to take a public stand when it might’ve cost him.December, 1968: pic.twitter.com/9U5TeTtXLc— Siddhant Adlakha (@SidizenKane) November 12, 2018Lee himself resurfaced the column in 2017, after white supremacists marched on Charlottesville, resulting in the death of one woman. In a no-longer-available tweet, he shared the image with the words \"As true today as it was in 1968. Pax et Justitia -Stan.\" 1968, notably, was the year Martin Luther King, Jr. was assassinated, among other events. \"Pax et Justitia\" is Latin for \"peace and justice,\" an ideology pervasive in Lee's comics and in multiple Soapbox columns. Following the Charlottesville tweet, Inverse dug through the archives and found several more examples of Lee fighting prejudice over the decades. He defended Luke Cage's debut and pointed out the allegories of bigotry in X-Men, all as part of the heroic stories readers were hungry to consume.\nEvery product here is independently selected by Mashable journalists. If you buy something featured, we may earn an affiliate commission which helps support \nour work.\n"}