{"id": "MashableFinally, the iPad is exciting again", "paragraph": "Oh, baby! The new 11- and 12.9-inch iPad Pros are  really nice.The last time I was this excited about an iPad was when Apple released the iPad Air 2. Each iteration since then, including the original iPad Pro, has been iterative. The iPad Pro's screen has grown over the years, but this is the first time the hardware (inside and outside) has changed so drastically, the tablet feels entirely new again.This is the iPad's redefining moment, ushering in a new design and features that set it up for building upon for the next decade.SEE ALSO: iPhone XR review: For once, cheaper is betterSince the iPad Pro launched in 2015, Apple has tried year after year to position it as \"real\" computer. With faster processors, better display technologies (like the 120Hz refresh rate ProMotion), and more powerful features introduced in iOS 11 like drag-and-drop and being able to open up to three apps at once, the iPad has inched closer towards being more Mac-like.The iPad Pro is a very capable device, but anyone who thinks it can be a true laptop replacement either has very casual computing needs or has adjusted their workflow to function with iOS's limitations.It's way too soon to say whether the new iPad Pros are more capable of being laptop replacements than the old ones (the software is the real holdup), but I can tell you they're moving closer towards that goal with new features like USB-C that really help push it in the right direction.But first, let's talk about the design. In true Apple form, it is gorgeous. Apple reduced the top and bottom bezels so that they're as thick as the side ones, rounded the display's corners to match the silhouette's curvature, flattened the edges, and slimmed the the tablet to 0.23 inches (5.9mm) thick (the old one is 6.9mm). So expansive!Image:  RAYMOND WONG/MASHABLEIt's a marvelous slab of aluminum and the LCD display, which Apple calls a Liquid Retina display (just like on the iPhone XS), is stunning from all angles.With smaller bezels and a skinnier profile, the new iPad Pros don't feel as ginormous as their screen sizes suggest. The 12.9-inch iPad Pro, previously a behemoth, is now a usable size and no longer looks so silly when you're one-handling it.The thinning of the iPad Pros comes at one loss: the headphone jack is gone. There will be people marching with pitchforks over its removal, but I let those tears out years ago when Apple gutted the headphone jack from the iPhone 7. I've been living a happier and better life with AirPods and wireless cans, so it's really no loss to me.There are some other small, but noteworthy changes I observed during my brief time with both new tablets. The power and volume buttons are flatter, but still very tactile. The speakers are louder and even sounded clearer in the loud hands-on area (I was one of the first to get in so I got to pump it up before it got too rowdy). The camera bump is quite large and protrudes on the back. The buttons are flatter.Image:  RAYMOND WONG/MASHABLEThat camera bump.Image:  RAYMOND WONG/MASHABLEThe three most important changes besides the design are the USB-C port, Face ID, and the new Apple Pencil.Let's start with the USB-C port. Lightning is gone and USB-C is in. That means you can use the same cable from any MacBook (or non-Apple device that uses USB-C) to charge up the new iPad Pros. The port also lets the tablets connect to things like a display (with up to 5K resolution) and a DSLR camera, and it even has reverse power-delivery so you can use it to charge another device like a battery bank.Goodbye Lightning. Hello USB-C!Image:  RAYMOND WONG/MASHABLESwitching from Lightning to USB-C on the iPad Pro indicates a bigger shift of marketing the device as being more laptop-like. Can you see it? That's Face ID and it works in any orientation.Image:  RAYMOND WONG/MASHABLEFace ID — the TrueDepth camera system from the iPhone X (and newer) — is hidden in the top bezel. Most importantly, it works in any orientation. I saw an Apple product person demo Face ID on her face in portrait and landscape and at several in-between angles and it unlocked every time. This is great functionality, and I pray Apple brings it to the iPhone X family.No more rolling off the table.Image:  RAYMOND WONG/MASHABLEThen there's the new Apple Pencil. It's shorter and looks more like a real pencil. It magnetically clips to the side of the iPad Pro, which also wirelessly charges it up. No more removing any caps and jamming it into the charging port. Second, the shape of the body also means it won't roll off tables and flat surfaces. And third, you can tap the pencil to switch modes; in the Notes app, a tap can switch from pen ink to being an eraser. Very cool!It's as precise as before.Image:  RAYMOND WONG/MASHABLEUnderneath the hood, Apple has put a A12X Bionic chip. The custom Apple silicon is based off the powerful A12 Bionic inside of the iPhone XS and XR. Having reviewed both, I'm expecting even more screaming performance from the new iPad Pros. Apple touts up to 35 percent faster single-core CPU performance and up to 90 percent faster multi-core CPU performance compared the previous-generation iPad Pros.That should translate to some serious speed for professional users who do things like make music, edit video, and process images.Apple says these tablets are so powerful they'll blow away most laptops. We'll have to see about that. The iPad Pro's real crutch is iOS, which is fantastic, but it can't compare to a full operating system like macOS or Windows 10. Though iOS 12 flew on the iPad Pros I played with, it still has a ways to catch up to a desktop operating system in terms of productivity.The pressure is on Apple to give the iPad Pro the software love it deserves. Third-party apps like a full-featured version of Photoshop and enhanced Procreate are nice, but the system OS itself could use bigger overhauls, especially with better keyboard support (and perhaps maybe wireless mouse input would nice).The keyboard is still sold separately.Image:  RAYMOND WONG/MASHABLESpeaking of keyboards, the new Apple Smart Keyboard Folio is less...ugly. It still connects to the iPad Pro's Smart Connector (now positioned directly behind the USB-C port instead of the side), but the keyboard doesn't protrude with an unsightly ridge like the old one. The keyboard case is now one smooth cover.The iPad Pro is expensive. It's not for everyone.Image:  RAYMOND WONG/MASHABLEMy first impression of the new iPad Pro is: WANT. I've had no reason to upgrade from my trusty iPad Air 2 especially since iOS 12 gave it brand new life, but after four years, Apple has finally given me enough reasons to get a new iPad.I'm not sure if it can take the place of even my 2015 12-inch MacBook, 2012 13-inch work-issued MacBook Air, or my 2013 13-inch MacBook Pro, or any Windows 10 laptop like the excellent Surface Laptop 2, but I'm excited  to push its limits.The other thing is price. Starting at $799 for the 11-inch iPad Pro with 64GB of storage is a nice chunk of money and more than the previous iPad Pros. You can bump the 11- and 12-inch iPad Pros up to 1TB of storage, but that'll cost you $1,549 and a unreal $1,899, respectively. Somewhere in-between the base and the maxed out storage is the sweet spot.The price is gonna be a huge turnoff for a lot of people who don't need the iPad Pro's performance. If you're just using an iPad for browsing the web, scrolling on Twitter, or watching videos, any cheaper iPad will do fine. The new iPad Pros are really for the professional or creative, where there's real value in spending big money for a powerful device to (hopefully) make more money."}