{"id": "MashableLyft's rewards program will offer perks for choosing Lyft over Uber", "paragraph": "When you're hailing a ride, you probably flip between the Uber and Lyft apps to see which one will give you the best deal. But what if one of them offered you rewards in exchange for your loyalty?Lyft is banking on that idea with its forthcoming rewards program. The company will soon let users earn points for all the money they spend in the app on Lyft rides. Once a user has earned enough points, they can redeem them for Lyft Rewards, such as a ride in a more luxurious car or discounts on future rides. Points will be tracked in the app as part of a user's profile.SEE ALSO: Uber launches program to reward high-performing driversThe Lyft loyalty program will launch next month to select riders in certain cities before rolling out to more people early next year. If you're one of the lucky few chosen customers, you'll receive an email or in-app notification to sign up. It will work in a similar fashion to the company's business rewards program for business trips. Lyft and its chief rival Uber have been increasingly competing for each other's customer base. Both companies recently launched subscription plans: Lyft has its All-Access Pass, while Uber late last month started Ride Pass, a discounted ride program for a set monthly amount. It is unclear whether either has been a major success.Lyft's new reward program comes shortly after Uber offered a rewards program for drivers. This seems to be one of the rare instances where each company is honing in on different sides of the ride-hailing business.Uber has high turnover and split loyalties from drivers, so a way to encourage drivers to stick to its app makes sense. A Stanford University gender pay gap study from earlier this year found that 68 percent of Uber drivers stop driving within six months. A Rideshare Guy blogger said he will consider switching to Uber instead of Lyft because of the new reward system. He wrote, \"If you are like me, a Lyft driver, then this new offering provides an opportunity to reevaluate my driving options and make an educated decision.\"Lyft is hoping passengers will reevaluate their riding options with its new incentives program — and pick Lyft over Uber. It’s hard to resist a good deal. And Lyft knows that."}