{"id": "MashableGet a MacBook Pro (with the Touch Bar!) on sale for less than $1,500 at Amazon and beyond", "paragraph": "Something must be in the water — \"something\" as in a possible new MacBook model — because online retailers have no chill with the MacBook sales lately.This week, you have two chances to save big on a MacBook Pro: Amazon is offering the 2017 13.3-inch Pro for $305 off, and B&H Photo Video is competing by offering the same computer for $400 off. GET ON IT, Y'ALL.As far as we can tell these deals just went live, so congrats — you're one of the lucky ones who caught them early. Devices selling out is likely,  so if you've been waiting for a MacBook Pro sale or are in need of a good holiday gift for someone, we really encourage hopping on this ASAP.Here's what you're getting:The second-to-newest MacBook Pro model from 2017 in space grayApple's Touch Bar — a horizontal retina screen where you control brightness and volume, browse the web, talk to Siri, send iMessages, activate Touch ID, and moreA gorgeous 13.3-inch 2560 x 1600 display and Intel Iris Plus Graphics 650 — not ideal for gaming, but it'll get the job doneA speedy Intel Core i5 processor with up to 3.10 GHz — great for video editing or heavy duty apps like Photoshop8 GB memory and 256 GB SSD, plus four thunderbolt ports, three USB-C ports, and a headphone jack. (MacBooks won't have headphone jacks for much longer, so take advantage while you can.)Basically, you're getting Apple's newest top-notch specs for under $1,500, and that's a hella rare occurrence.Save $305 and get the Pro for $1,494 at Amazon (plus free shipping) here, or save $400 and get the Pro for $1,399 on B&H here. Image: apple  MacBook Pro deal at Amazon — $1,494 See Details  Image: apple  MacBook Pro deal at B&H — $1,399 See Details \nHeads up: All products featured here are selected by Mashable's commerce team and meet our rigorous standards for awesomeness. If you buy something, Mashable may earn an affiliate commission. \n"}