{"id": "MashablePete Davidson's joke on 'SNL' about a GOP candidate and combat vet didn't go over well", "paragraph": "Pete Davidson's appearance on Saturday Night Live's Weekend Update segment grabbed a lot of attention on Sunday with his comments about his real-life break-up with performer Ariana Grande. That left a poor-taste joke poking fun at the physical appearance of candidates running for office initially overlooked. But as the clip spread, backlash started brewing about Davidson's move to mock a Republican congressional candidate who wears an eye patch.SEE ALSO: Pete Davidson asks 'SNL' viewers to cool it with the Ariana Grande break-up stuffDan Crenshaw, a former Navy SEAL who is running as the Republican candidate for the U.S. House of Representatives for Texas's 2nd congressional district, lost his eye in an IED explosion in Afghanistan. He's a combat veteran.In the segment, Davidson said Crenshaw looks like \"a hit man in a porno movie.\" He immediately acknowledged the mean-spiritedness of the comment and said, \"I'm sorry I know he lost his eye in war or whatever.\"Weekend Update co-host Michael Che anticipated the outcry before Davidson even started the joke. After a photo of Crenshaw with an eye patch displayed on the screen, Che lamented, \"Come on, man.\" But Davidson carried on. After his Crenshaw impression, he moved on to a Democrat, \"so I look fair.\" It wasn't all attacks on right-wing candidates, but still.Crenshaw posted about the bad joke Sunday, noting \"I hope [SNL] recognizes that vets don’t deserve to see their wounds used as punchlines for bad jokes.\"Good rule in life: I try hard not to offend; I try harder not to be offended. That being said,  I hope @nbcsnl recognizes that vets don’t deserve to see their wounds used as punchlines for bad jokes.— Dan Crenshaw (@DanCrenshawTX) November 4, 2018A bevy of responses followed, assuring the candidate that joking about his war injuries was in poor taste. People from both the left and right acknowledged that going after physical appearances and former combat veterans was a low blow (even if it's not the worst rhetoric our country has seen in recent years).Yeah, some people dress up as a Mexican border wall and think it's cool; some poke fun at wounded warriors. Both are bad and should be treated as such. If you think one is ok and not the other, check your bias.— Matt (@RealEnglishMatt) November 4, 2018Pete Davidson mocking GOP candidate Dan Crenshaw because he wears an eyepatch after he lost right eye in an IED blast as a Navy SEAL was truly abhorrent and rotten to the core. And the fact that so-called \"joke\" was approved by an entire staff of writers is horrific. #SNL— Joseph A. Wulfsohn (@JosephWulfsohn) November 4, 2018Pete Davidson's \"joke\" was gross and never OK to joke about. Period.That said, Tuesday's SO much bigger for vets than a line on SNL. It's about a GOP that wants to privatize our VA. It's about the 1-in-10 vets who depend on Medicaid, that GOP wants to cut, and more. So, VOTE!— VoteVets (@votevets) November 4, 2018Thank you for your service    It’s sad that Pete Davidson and @nbcsnl don’t recognize what you have sacrificed.  That said, you will be a welcome addition to the US House https://t.co/nLS6Jp8WYd— Sean Spicer (@seanspicer) November 4, 2018The \"unhinged left?\" That's where you go? I don't even know Pete Davidson's political views, but this liberal thinks his joke was lame and mean. But I think your post is worse, bc Pete is a dumb actor. You're a political leaders spewing hate against an entire group of ppl— CeeJayGee (@butchcjg) November 4, 2018Rep. Pete King from New York, who was also included in the segment, took to Twitter to call for Davidson's or someone at NBC's firing. An ironic request from a man who supports a president who has mocked a reporter's physical disability, insulted a Gold Star family, and disparaged John McCain's military service. Trump's still got his job.None of which excuses Davidson's remarks on SNL. He may not be held to the same public standards as a politician (at least in the pre-Trump era), but that doesn't mean he can get away with spouting whatever mean-spirited garbage he wants.Mashable has reached out to NBC for comment and we'll update this story once we hear back. "}