{"id": "MashablePapa from Johny Johny Yes Papa has been replaced by a younger, hotter Papa", "paragraph": "Let's just take a minute to mourn Papa from Johny Johny Yes Papa, who has been tragically replaced by a newer, better Papa. At least we got a good song out of it.SEE ALSO: 'Johny Johny Yes Papa' is just one of many terrifying YouTube videos made for kidsJohny Johny Yes Papa swept social media over the summer with its mildly terrifying animation and lyrical non sequiturs. Some of the videos in the series, which revolved around a family consisting of Papa, Mommy, Johny, and Refrigerator, have been taken down since getting meme'd to hell. Although the new Papa was phased into the series in mid-August — just as the meme started taking off — Billion Surprise Toys seems to be scaling back on old Papa content, taking down the viral videos he's featured in. To add insult to injury, the new Papa appears to be younger, taller, and hotter. sorry but new Papa is a snack & a half!!! pic.twitter.com/ChABrIos2G— demomorgan sung (@morgan_sung) October 24, 2018YouTuber Danny Gonzalez created an absolute gem of a song in tribute to old Papa. The heartfelt music video features a distraught Papa superimposed on choreographed dancers and crooning about being replaced by \"Chad.\" Papa has been replaced :/ pic.twitter.com/pYRhfFj3WT— Spooky Danny Gonzalez (@dannygonzalez) October 23, 2018Over montages of his once-happy marriage to Mommy, old Papa reflects on their \"kids, and a fridge with the sauces inside\" before slashing the memories with \"but it turns out that you were telling lies.\" \"He's so ripped, and so hot,\" old Papa laments, \"How can I compete with that? Now let's together sad.\" In a mid-2000s-like breakup ballad that could rival Ne-Yo's \"So Sick\" or Leona Lewis' \"Bleeding Love,\" old Papa implores Johny to never forget him. It's heartbreaking. Billion Surprise Toys has viciously issued DMCA takedowns of Johny Johny Yes Papa memes, though much of it should fall under fair use. In an extended version of the video that has since been taken down on copyright claims, Gonzalez asks what we were all thinking: Where the hell is old Papa? \"If the marriage wasn't going well, get a divorce,\" Gonzalez rants. \"But the mom rebounded so fast with this guy. This younger, hotter, clean-shaven, ripped, hotter, hot guy? His name's probably Chad.\" Why only replace Papa? Why not replace the other widely known characters? \"I guess they got rid of the refrigerator, too, but that's probably for the best,\" Gonzalez says. We can't wait for old Papa's tell-all about the illicit affair. "}