{"id": "MashableSomeone at Hasbro apparently thought Monopoly for Millennials was a great idea", "paragraph": "Someone really though a millennial version of Monopoly might be a fun idea.The very bitter people behind the board game known for tearing apart friend groups and getting children written out of wills released an especially cursed version of the game titled Monopoly For Millennials. In this version of the game, players don't buy up properties — because what IRL millennial can afford to buy houses when they're too busy spending their money on avocado toast, right? Instead the game employs tired stereotypes of younger generations, as players buy \"experiences\" like going to the Vegan Bistro or crashing on their Friend's Couch. Skip the Boardwalk in favor of a Week-Long Meditation Retreat! Image:  hasbro/walmartYou win the game when you rack up the most Experiences. According to the game description, the board also includes Chance and Community Chest cards \"which are super relatable.\"\"This board game is a great way to bring a fun and relaxed vibe to a party or a casual get-together,\" the description claims. Alternatively: it's a great way to send your friends spiraling over their crushing student loan debt. Speaking of loans, whoever has the most debt gets to roll first. Yikes.Image:  hasbro/walmartThe game pieces include a hashtag, so you know this board game was created by a Fellow Kid.Naturally millennials on Twitter are pretty annoyed by the release. After all, the game doesn't include typical millennial experiences like trying to live without healthcare or dealing with a rapidly declining job market as older generations refuse to retire.I'm not sure who @hasbro made Monopoly for Millennials for? As if we don't get shit on enough lol... A game about millennial life should absolutely include paying rent. A lot of it. The vast majority of us can't afford to spend money on \"experiences.\" Anyway, disappointed.— Sarah (@SarahTeeRaymo) November 12, 2018Monopoly for Millennials might be one of the worst things ive ever seen you ruined monopoly— Elvis Demars (@MONARCHSFAN90) November 12, 2018Next, Monopoly for Baby Boomers: where you buy property for below value price, only people of color go to jail, and when you pass “Go” you get to complain about Millennials!!! pic.twitter.com/Nb8vSl79AW— Jon (@jknit135) November 12, 2018Should you actually want to play this cursed game, you can find it at Walmart for $19.82. Or you could just treat yourself to brunch, instead. "}