{"id": "MashableTwitter quietly fired a suspected Saudi Arabian spy in 2015, report says", "paragraph": "We've all seen what can happen when nefarious interests weaponize a social media platform like Twitter. Now imagine how much worse it would be if some foreign agent actually got a job at the company.That's what happened in 2013, apparently. In a sprawling Saturday New York Times report looking at the Saudi Arabian leadership's social media campaign to silence critics and influence thinking, one detail stands out: The story of former Twitter employee Ali Alzabarah.SEE ALSO: Twitter's Jack Dorsey doesn't use a computer or a tablet, apparentlyAlzabarah joined the company in 2013 and worked his way into an engineering position that afforded him access to \"the personal information and account activity of Twitter’s users, including phone numbers and I.P. addresses, unique identifiers for devices connected to the internet,\" the Times report said.Intelligence officials alerted Twitter executives at the end of 2015 that Saudi leadership had been \"grooming\" Alzabarah to keep tabs on accounts belonging to dissidents and critics of the Saudi government. Twitter never shared this widely and didn't confirm it for the NYT report; the info comes instead from \"five people briefed on the matter.\"Although an internal investigation ultimately turned up no evidence that Alzabarah had shared sensitive data, three of the Times sources noted that Saudia intelligence agents \"eventually persuaded him to peer into several user accounts.\"Alzabarah was placed on administrative leave and investigated shortly after Western intelligence officials approached Twitter. He was fired in December 2015 — after which he reportedly returned to Saudi Arabia and took a job there with the government.While Twitter never issued any kind of public alert regarding the extent of the apparent intrusion, the Times report notes that steps were taken. A Dec. 11, 2015 safety email went out to \"the owners of a few dozen accounts Mr. Alzabarah had accessed.\" The list included \"security and privacy researchers, surveillance specialists, policy academics and journalists,\" a number of which were involved in the Tor project.The revelations about Alzabarah come in the midst of a larger report detailing Saudi Arabia's apparent playbook for silencing dissent on social media. Twitter has taken steps in recent days to shut down spambots pushing a pro-Saudi agenda, but the NYT report makes it clear that this kind of thing has been ongoing for a number of years."}