{"id": "MashableUber officially launches $15 monthly subscription ride passes", "paragraph": "Ordering a car ride is becoming more like Spotify Premium or Amazon Prime. You pay in advance for something extra — in this case, guaranteed cheaper rides, even if there’s heavy traffic or bad weather.Instead of paying per ride at whatever rate comes up, Uber is offering a monthly subscription service called Ride Pass that guarantees discounted rides and protection from surge pricing.  SEE ALSO: Uber will offer a 'Get to the Polls' button on Election DayIn Austin, Orlando, Denver, and Miami starting Tuesday, you can lock in discounted prices for UberX, Uber Pool, and Uber Express Pool rides for the monthly rate of $14.99. In Los Angeles, it's $24.99 per month, but that will eventually include e-bike and scooter access. Uber estimates in a month you'll save 15 to 20 percent on how much you'd normally spend on rides. You can cancel the monthly program anytime. To sign up, go into the Uber app and pull down the left-side menu and select \"Ride Pass.\" Once you pay the monthly fee, you're in. The app will show you how much you've saved on each ride. Image:  uberEarlier this month, Lyft unveiled its All-Access Pass, which similarly auto-renews each month. But instead of an open-ended subscription, Lyft's pass is good for 30 rides per month for a set monthly fee, which ends up being about as expensive as Uber's pass if you're a power user. San Francisco has had an Uber ride pass option for the past few months.Image:  screengrab / sasha lekachIn San Francisco for the past few months a version of the Ride Pass has been available to select users, but at a lower price ($9.99 activation fee) and only for rides between two set points, like the gym and your house. Any other rides with the pass were available for 15 percent off.The pass is only in these five cities for now, but should expand soon into other Uber markets. \nEvery product here is independently selected by Mashable journalists. If you buy something featured, we may earn an affiliate commission which helps support \nour work.\n"}