{"id": "MashableHere’s how to better support people who are suicidal", "paragraph": "I remember whispers, silence, and shame. When I was growing up in the 1960s and 70s, an older cousin violently ended his life. It was never openly discussed, leaving questions and grief surrounding his death to reverberate for years.Decades later, suicide continues to create quiet circles of despair, a circle that grows ever wider in this country: The latest Centers for Disease Control and Prevention numbers show a 25.4 percent jump in the national suicide rate from 1999 to 2016, when nearly 45,000 people ages 10 or older completed suicide. For every life lost, there are even more stories – from family, friends, and colleagues – that must be heard to eradicate the deep-seated stigma and the silence that contribute to this crisis.National Survivors of Suicide Day on Nov. 17 brings much-needed attention to the crisis and allows survivors a special time and place for solace and community. I am a member of that community. But we can do so much more to prevent these tragedies all year round so that more people actually survive suicidal thoughts or attempts to complete suicide.SEE ALSO: 21 reasons to keep living when you feel suicidalMy own personal experiences of witnessing the suffering of mental illness and substance abuse inspired me to help create an accessible system of mental health support and resources where none existed.As the first lady of New York City, I lead ThriveNYC, a city-wide mental health effort launched in 2015 that encompasses dozens of initiatives. We are bringing mental health resources to places where they are needed and teaching New Yorkers to take care of one another. We have now logged over 400,000 contacts to our helpline, 1-888-NYC-WELL, where you can talk, chat, or text with trained counselors.  One of the pillars of our program is Mental Health First Aid (MHFA), a course first developed in Australia to teach ordinary people to identify, understand, and respond to signs of mental illness and other distress. To date, we have trained 75,000 people and plan to train 250,000 by 2021. People who have taken the course know, for instance, that you don’t increase the risk for suicide by asking someone if they are thinking of hurting themselves. We have to talk openly and honestly about mental health with our friends and loved ones. If you want to learn more about how to have these conversations and connecting people to care, enroll in @MHFirstAidUSA training at: https://t.co/lzARLasE1W pic.twitter.com/37LcyEqFXA— Chirlane McCray (@NYCFirstLady) November 14, 2018Mavis Flowers, who took the training in the last year or so, discovered that her best friend planned to kill herself by overdosing on pills, only after Mavis took her to the hospital for what seemed like a panic attack. “If I didn’t have the Mental Health First Aid training, I wouldn’t have known she needed to go to the hospital,” Flowers said. “And I would never been able to ask her if she still had a plan, after leaving the hospital.”“The training has helped me have conversations with her about going to a therapist and having a support system,” said Flowers, a 52-year-old mother and health care consultant from the Bronx. “It has helped me find ways to support her — I’ll say ‘OK, we have to talk about this to your therapist.'” Flowers herself has been certified to conduct MHFA trainings.After taking the MHFA course and learning from other Thrive resources, a Staten Island family was able to understand the bipolar disorder of a young relative. He had been labeled “bad” for years, bullied by peers, and abandoned by his mother. He has since received proper medication and is college-bound.When it comes to suicide, we need many ways to break the cycle of pain.When it comes to suicide, we need many ways to break the cycle of pain for many populations, from schoolchildren to seniors, as well as people with serious mental illness or those facing unexpected crisis.For example, in our schools, staff members can take advantage of training to identify children in emotional distress. A “health promotion game” called Age-tastic is used in senior centers, allowing licensed clinicians at the centers to assess mental health in a fun way as seniors take stock of their finances and physical health.A Thrive team for veterans hands out information cards, pens, and refrigerator magnets at police precincts, community centers, and on the streets to guide veterans to free counseling. With the connections and resources of 12 major national African-American service organizations, we created Brothers Thrive and Sisters Thrive to reach underserved African-American communities through therapeutic “Listening Sessions” and MHFA trainings. We just started a similar effort called Latinx Thrive, with the help of elected officials and others, to serve Latinos and Latinas. In April we launched #BrothersThrive — to help us reach deeper into New York City's communities and equip young black men with more tools to care for themselves and others. pic.twitter.com/pfJjbchOGx— Chirlane McCray (@NYCFirstLady) November 9, 2018Because of historic and continuing inequity and discrimination, those communities of color need special assistance. Compared to white communities, they too often experience worse mental health outcomes, less access to care, and fewer culturally competent caregivers. Yonghwa and Katie Ha, who are Korean-American, created the Esther Ha Foundation in Queens to increase mental health understanding in the Korean community. They did so to honor their daughter, Esther Ha. Esther lived with depression and died by suicide at age 21. Through ThriveNYC, the foundation has now trained more than 400 staff and community members in MHFA.As the first to hear what is really going on in the people’s lives, many faith and community leaders have joined the movement to educate and eradicate stigma by hosting MHFA trainings in their houses of worship and community centers. Those leaders report more people talk openly about everything from marital woes to suicide.Since 2016 a growing number have participated in a dedicated weekend each May to explicitly address mental health. That effort began in New York. This year, 2,500 houses of worship — representing every major religion — did so in all 50 states. If you or someone you know is struggling or just needs someone to talk to, #NYCWell is there for you — 24 hours a day, 7 days a week. You are not alone. pic.twitter.com/2TwZYGnWv6— Chirlane McCray (@NYCFirstLady) November 5, 2018It is on all of us — individuals, government leaders, and educators — to prevent suicide. As voters, we can demand a public health approach to mental health and vote for candidates who vow to make mental health services a priority. Teachers can help children learn to name and manage their emotions to build emotional resilience. We can all improve our mental health literacy and support one another in navigating life’s inevitable challenges.   As the founder of the Cities Thrive Coalition, which has brought together nearly 200 mayors and thought partners in all 50 states to share best practices and advocate for federal support, I support a more integrated behavioral health system for all Americans. Instead of just bemoaning the suicide rate, leaders in every sector in every city can explicitly acknowledge that people cannot be healthy without good mental health. City governments, in particular, can make a commitment to ensure that their policies take mental health into consideration.  Mental health is the ultimate intersectional issue, affecting how we learn, love, and use our skills and talents. There is no ONE solution to preventing suicide — there are MANY. Tell your story and the stories of loved ones. Hold elected officials accountable. Fight for our lives.As first lady of New York City, Chirlane McCray fights for underserved communities and created ThriveNYC, the most comprehensive mental health plan of any city or state in the nation. She also spearheads the Cities Thrive Coalition, with more than 200 mayors and thought leaders from all 50 states, advocating for a more integrated and better-funded behavioral health system.If you want to talk to someone or are experiencing suicidal thoughts, text the Crisis Text Line at 741-741 or call the National Suicide Prevention Lifeline at 1-800-273-8255. Here is a list of international resources."}