{"id": "MashableThe 10 types of trolls you'll spot in the wild", "paragraph": "It's Troll Week on Mashable. Join us as we explore the good, the bad, and the ugly of internet trolling.Right now, you are on the internet. Thus, you have probably come across a troll. But the name \"troll\" is far from one-size-fits-all. In fact, there are lots of trollish internet types skulking around online, looking for the next thing to troll about.SEE ALSO: Ken M and the lost art of 'do no harm' trollingHere are the ten types you'll probably come across in the wild.Image:  vicky leta / mashableThis troll's objective is to say that the thing you're talking about is not worth talking about. This could be any subject at any time: politics, coffee, your own family, an election on the day of the election. Anything! No matter what, the troll will ask, \"Why is this news?\" Yes, even if it it news. Such is the nature of the troll.Image:  vicky leta / mashablePerhaps the most famous example of do-no-harm trolling is Ken M, the hilariously uninformed commenter who still has a shockingly active fanbase on Reddit. The do-no-harm troll's comments are confusing, but not harmful; weird, but not dangerous. They're based on a persona: that of a person who is wildly ignorant, but not necessarily in a toxic way. As trolls go, they are pretty good.Image:  vicky leta / mashableAdmit it: We all know a high-brow troll (or seven) who have the potential to inspire eye rolls every time they open their mouths. High-brow trolls are those people who live to reference New York Times articles to make their points, often calling it \"the Times\" to let you know they're so dedicated to reading the paper that they're on a nickname basis with it.They don't always feel the need for elaborate clapbacks, especially when there's spelling or grammar in need of correcting. To high-brow trolls, a simple \"*their\" is the most savage takedown imaginable.The high-brow troll essentially exists to put people in their place while also humble bragging. They love to show off their extensive vocabulary, and if they choose to engage in a more lengthy troll, rest assured that thorough research and numerous facts will be presented.Image:  vicky leta / mashableThese trolls will stop at nothing to ruin a pleasant discussion, no matter the subject matter. Even the lightest of topics aren't safe from their incessant negative energy. Recently, we were reading a nice thread on what to eat for breakfast and noticed one man popping up under any comment that mentioned eggs. \"Eggs are high in cholesterol,\" he wrote many, many times. \"Excellent, if your goal is to die of heart disease.\"Eggs are fine though, and he's a wet blanket troll. Please enjoy your breakfasts and ignore him.Image:  vicky leta / mashableThe meme-reliant trolls of the world are a unique bunch. While they have a lot of opinions and aren't necessarily afraid to share them, they only feel comfortable trolling if they can hide their social commentary behind the lighthearted veil of a meme.You'll rarely catch this troll tweeting directly about politics, but they'll never pass up the opportunity to transform the latest Trump drama into a lawn boy meme. As Midterm Elections approach they won’t outright urge people to vote, but they'll eagerly jump at the chance to retweet that Ariana Grande/Pete Davidson meme. And they take no shame in putting their extensive knowledge of Spongebob Squarepants episodes to use.Meme-reliant trolls enjoy the trolling game — and they’re good at it — but they aren’t out to ruffle too many feathers, which is why they cushion the blow and try to diffuse the tension by delivering their opinions in a hilarious package.Image:  vicky leta / mashableOne of the most heartbreaking trolls you'll encounter in life is probably the friendship troll, a person who you might be very close with, but who occasionally exhibits frenemy behavior.Friendship trolls takes it upon themselves to give their pals FOMO whenever possible. If they hang out one-on-one with a mutual friend, for example, they'll be sure to send photos letting you know that they’re having a great time despite your absence. If they go to eat at your favorite restaurant or see a band you like they might send you some \"thinking of you\" content. Rather than giving you FOMO, they could have just invited you to hang with them, but of course, they did not.Friendship trolls also aren't afraid to commit one of the ultimate social media betrayals: Snitch tagging. Though their actions aren't always malicious in intent, their thoughtlessness often leads to drama.Image:  vicky leta / mashableAnother especially irritating presence, the broken record troll has almost zero range in trolling. They come up with one good troll, think they've mastered the game, and keep it in their back pocket just waiting to whip it out whenever the opportunity presents itself. Broken record trolls also exist in bot form and behind Twitter accounts with very low follower counts. Anyone who joins social media for the sole purpose of scouring the site for posts related to a single issue (like politics, for example) and replying with the same canned insult falls under this category.Image:  vicky leta / mashableEver encountered someone online who carries on endlessly bleak conversations, often appears hopeless, and seems angry at the world? That's an existential void troll in the wild.An existential void troll's tweets document the desperate searching for purpose and meaning in this life. Much like the wet blanket, this troll's a real downer, and will make you want to scream things like, \"WHO HURT YOU?\" and \"WHY?\"Image:  vicky leta / mashableBrand trolls are extremely hit or miss. When they’re good (it's rare,) they set brands apart from the competition. But when they're bad, the social impact can be far-reaching and truly mortifying.For every Wendy's and Netflix, there’s an IHOP, Charmin, or Steak-umm just waiting to take things too far. Need some more specific brand troll examples? Check out some of the best and worst in the game here.Image:  vicky leta / mashableThese are the trolls who give trolls a bad name. Well, trolling already has a bad name, but it's these people's fault. They're mean, they're bigoted, and they make the internet a worse place for everyone. Maybe someday Twitter will kick them off the platform — cough, Jack, hello — but for now, they remain.Want more clever culture writing beamed directly to your inbox? Sign up here for the twice-weekly Click Click Click newsletter. It's fun – we promise."}