{"id": "MashableKobo Forma review: A great, but pricey Kindle alternativeRelated reviewsRelated reviews", "paragraph": "You’re in the market for a new e-reader. It should be as simple as going directly to Amazon and buying the newest Kindle, right?Not if Kobo has anything to say about it. Toronto, Canada-based Kobo is launching a brand new e-reader called the Forma that the company hopes will directly compete with Amazon's wildly popular Kindle e-readers. So can the Kobo Forma hold up against the brand new Kindle Paperwhite, which I recently called \"the best available e-reader in terms of value\" based on a hands-on with the device? I've spent the last two weeks using the Forma, and I have to say it was a surprisingly great experience.SEE ALSO: Here's how to set up a VPN and protect your dataOn paper, the Kobo Forma stacks up really well against the Kindle Paperwhite: It’s thinner, includes a similar lighting configuration around the edge of the screen that makes it possible for you to read at night, is equally waterproof (IPX8 rated), and adds the extra bonus of letting users change the lighting color from blue to yellow, making it easier on your eyes in the evening.But is all of this enough to make it worth purchasing instead of an Amazon Kindle? We’re here to break it down in our latest review. Let’s jump right in.The Kobo Forma is easily the nicest e-reader I've ever held. The screen is huge, and the battery life is phenomenal.Image:  ZLATA IVLEVA/MASHABLENo matter how you chalk it up, the Kobo Forma is  lovely machine. It looks spectacular, even sitting right next to an Amazon Kindle device. It’s noticeably thinner than my Kindle Voyage at just 0.17 inch, with the exception of the large grip on one side. The grip is where Kobo hides most of the hardware that powers the e-ink display and lights, but it’s sleek enough that it doesn’t hurt the overall look of the device, and even provides a nice handle for long reading sessions. Another interesting design choice is the inclusion of buttons on along the handle. The buttons are what you use to turn the pages. The top one moves the page backwards, and the bottom one moves the page forward. They aren't really necessary, though, since the display is a touchscreen, and all of the primary functions can be performed by tapping the screen instead of pushing buttons.One of the more incredible things about the Forma is that it includes a gyroscope in the handle, enabling the screen to automatically orient itself in the right direction regardless of how you hold it. So you can pretty much grab it off the table however you want, and whether you hold it with the binding on the left, right, or bottom — the screen automatically displays text properly.Finally, the weight of the device is, frankly, perfect. I wish my Kindle Voyage was more like the Forma. At just 197 grams, it’s exactly the type of lightweight feeling you want from something you expect to hold in your hands for several hours. It’s noticeably lighter than any other e-reader I've ever held.Image:  ZLATA IVLEVA/MASHABLEI get it. Not everyone is a fan of e-readers, especially people who grew up building book collections and who may still enjoy filling up all the space on their bookshelves. But for those of us who enjoy reading and love using technology to make life easier, an e-reader is really a must-have.One of the biggest benefits is that an e-reader lets you carry around your entire book collection. The Kobo Forma comes with 8GB of storage, which is plenty of space for most people to download dozens of their favorite books. You can't pick from models with extra storage like you can with the Kindle Paperwhite (which maxes out at 32GB), but for a large majority of readers, this really shouldn't be an issue. How many books do you actually read at one time, anyway?The Kobo Forma, like most other modern e-readers, has amazing battery life, too. I have been using mine for about two weeks, and have never had to worry about the battery. Kobo doesn’t say specifically how long the battery life is, but it’s safe to say you could read a couple of books on the device without ever having to worry about recharging it. In two weeks, I've used about 20 percent of the battery. So it should really be able to last any long flights or backpacking trips — especially if you don't use the reading light.Image:  ZLATA IVLEVA/MASHABLEThe Forma also has a few neat tricks that just aren’t typical of other readers. For example, one of my favorite tricks this device can do is change orientation based on how it's being held. This became a major boon because when I'm sitting on my couch, with my feet up, I prefer to hold the handle on the left side. When I'm reading before bed, I usually lean toward my right side and hold my e-reader with the same hand. The benefit of having automatic orientation became immediately apparent upon first use — and made me view my Kindle Voyage in a new, unflattering light. It simply isn't as comfortable to read while laying down.The gigantic 8-inch display was also a great upgrade compared to my tiny Kindle Voyage (which has a meager 6-inch display). Looking at a massive screen during reading sessions was a true joy, and made it easier to really immerse myself in the story I was reading. The only downside is that it's probably a little more difficult to travel with because it's so large. My Kindle Voyage fits just about anywhere: my back pocket, at the top of my carry-on, and simply in my hand. The Kobo Forma would take slightly more consideration before packing.Also, I have to say, the lighting on this device is amazing and significantly better than any available Kindle device. The Forma automatically changes the color of the light depending on the time of day, so it's easier on your eyes, or you can select the color temperature manually by using a slider on the home screen menu.This may not seem like a big deal, but blue light has been proven to negatively impact people’s sleeping habits.  So, if you’re like me, and you’re the type of person who likes to read right before bed, you’ll absolutely appreciate the fact that you can change your Forma to a much warmer yellow light rather than having those piercing blue LEDs shining in your face in the late hours of the evening.In sum, I absolutely loved my time with the Kobo Forma. It's easily the best e-reader I've ever used. Many of its special attributes seem really small at first, but inevitably make a huge difference in the reading experience.I loved changing the lighting scheme from blue to a much softer yellow — so much so that it's been hard going back to my normal Kindle device. I also really enjoyed having extra-large screen real estate. I question whether I'd appreciate it quite as much if I were frequently traveling, but the device is still small enough that it probably wouldn't make a difference.My only real complaint, if there is one, is that the build quality could have been a little better. The Kobo Forma is extremely lightweight, so much so that I always felt like I was going to accidentally snap the device in half. I've broken e-readers in my bag before, and this one would no doubt have trouble surviving in my rucksack. If you inevitably decide to shell out the hefty $279 for this product, do yourself a favor, and make sure you get a durable case with it.\nEvery product here is independently selected by Mashable journalists. If you buy something featured, we may earn an affiliate commission which helps support \nour work.\n"}