{"id": "MashableThe Pocophone F1 is the best smartphone for the buck right nowRelated reviewsRelated reviews", "paragraph": "Say you want a smartphone with top specs. Say you're absolutely disgusted with the prices of flagship smartphones these days. Amazingly, this is not a problem without a solution.Xiaomi, the Chinese smartphone manufacturer whose smartphones typically have top-notch specs and features while undercutting the prices of most flagships by a serious margin, has a new sub-brand: Pocophone. And the first smartphone to launch under the brand, the Pocophone F1, is all you'd expect from Xiaomi — even a little bit more. SEE ALSO: How to remove scratches from your phoneLaunched in late August, the Pocophone F1 (called the Poco F1 in some markets) has a very tough job: It has to make people buy it despite all the brand-new, ultra-powerful smartphones that closely followed it (Phonetober still isn't over, so there's more to come).After spending nearly two weeks with the phone, I'm convinced that this won't be a very hard task. The Pocophone F1 offers the best value on the smartphone market right now. First things first: The Pocophone F1 starts at $285, but you can spec it up to $407. It comes in several different flavors, ranging from 6GB to 8GB of RAM and 64GB to 256GB of storage. My unit was somewhere in the middle: an Armoured Edition, with a Kevlar back, 6GB of RAM and 128GB of storage.However, visual details and storage aside, the unit I tested performs exactly like the cheapest Pocophone F1, as it has the same amount of RAM and the same chips. Keep that in mind while reading this review; the performance I'm describing can be had for $285. Stereo speakers on the bottom, headphone jack on top.Image:  Stan Schroeder/MashableI've only held the variant of the Pocophone F1 coated in aramid fiber (Kevlar), and I love the design. The back of the phone feels soft and is extremely grippy — you won't be dropping this phone much unless you're really clumsy. The dark gray pattern on the back is simple but very effective. I love the modern-yet-somehow-also-retro look it gave the phone. Among the many Androids I've tested, this is the one that I'd wear around without a case, just to show off that back. The phone comes with a simple soft-plastic case which completely obscures the pattern on the back, making the device look a lot less exciting.The phone's plastic frame is also dark gray, which sounds boring, but somehow it isn't. Perhaps it's the red accents around the camera lenses on the back or the silver \"Pocophone\" logo on the bottom that complement the design so well.I've only got two qualms about the design. The fingerprint sensor is a bit too close to the cameras; I smudged the lower lens all the time while navigating my finger to the sensor. And the phone's chin on the front is a bit bigger than you'll see on most newer phones. I won't spent too much time on the notch given that basically every other phone has it these days. It's very iPhone-like in size, which isn't bad at all. Yes, the iPhone X (right) has a better screen than the Pocophone F1 (left). But the differences are small.Image:  Stan Schroeder/MashableThat notched, 6.18-inch, 2,246 x 1,080-pixel screen is an LCD, not an OLED, but it doesn't make a huge difference. I compared the Pocophone F1 against the iPhone X and it's only slightly dimmer on full brightness. I've watched some dark videos to see how the screen will handle very dark areas, and yes, the iPhone X has deeper blacks and better contrast. But had I not had such a superior screen to compare with, I wouldn't have any issues with the Pocophone F1's screen. I've seen a similar thing on several LCD-sporting Androids lately: LCD in general has gotten really good, and OLED screens simply aren't that much better anymore.The way content is shown on that screen is another matter. On YouTube, extending the video to full screen will make the video rounded on the right side, and cut off squarely below the notch on the left. Many apps will have important info obscured by the notch. These types of issues aren't unique to the Pocophone F1 — most notched Android phones have them — but they're annoying nevertheless. I don't spend too many words on brand-specific Android user interfaces these days. Almost every Android brand has one, and they're all pretty similar, as most of them try to nab the best mix of the pure Android experience and iOS.For the Pocophone F1, Xiaomi made a special, somewhat minimalist version of its MIUI interface. The experience is a tad more similar to stock Android — the app drawer is enabled by default, for example. Since I'm not a stock Android purist, this didn't matter to me, but it might matter to some users.Getting acquainted with the phone's settings took some time. For example, to rearrange the shortcuts that show up when you slide your finger downwards from the notch, you have to go to Settings > Notifications & Status Bar > Toggle Positions, and the toggling itself is done in a horribly unintuitive way. But once I'd found everything I needed, using the Pocophone F1 was similar to using any newer Android phone. The phone came with some degree of bloatware — including some Mi software and a bunch of Microsoft apps I didn't ask for — but nothing too aggressive.One downside: The phone runs Android 8.1 Oreo out of the box, not Android 9 Pie. Hopefully, it'll get upgraded sooner rather than later — Xiaomi promised it'll happen by the end of November. The Pocophone F1 has the best battery life of all the phones I've tested.Image:  Stan Schroeder/MashableThe Pocophone F1 has the best chip Qualcomm currently has to offer, the Snapdragon 845, coupled with an Adreno 630 graphics chip. With 6GB of RAM on board as well, this thing is fast. It's probably the fastest Android phone I ever tried, which was especially apparent after a few games of PUBG, which was absolutely stutter-free.Equally as important: The phone didn't overheat while I played the game. I barely experienced any extra heat at all. This could be due to Xiaomi's LiquidCool tech, which uses a heat pipe to drive excess heat away from the processor. This is a big deal — too many phones these days have nominally great specs but become awfully hot after you throw something a bit more demanding at them.Battery life on the F1 was excellent. I was able to regularly squeeze two days of heavy usage out of it, and most users will likely be able to use it for two and a half days without charging. It's easily the best phone, battery life-wise, that I've ever tested; only the bigger Huawei phones come close. Quick Charge 3.0 is supported, so you'll be able to charge the phone quickly once the battery finally runs out of juice.A few more tidbits. The F1 has a headphone jack and a stereo speaker. It's not the loudest around, nor does it packs the punchiest sound, but at least it doesn't get distorted at full volume.The game interface is partially obscured by the notch.Image:  Stan Schroeder/MashableI wouldn't call the Pocophone F1 buggy, but I did experience more than one bug during my usage. When I first fired up the camera, it crashed so bad that I had to reboot the phone to fix it. Also, the fingerprint sensor occasionally wouldn't work. Not in the sense that it wouldn't register my fingerprint correctly; it just stopped working completely until I manually unlocked the phone. Most of the time the phone worked fine, but on a phone that came out in August, this should not happen. On the bright side, I've received two updates while finalizing this text, one of which says it improves camera stability, so at least it looks like Xiaomi is ironing out the kinks.While not exactly a bug, I didn't like how the Pocophone handled automatic screen brightness. It was always either too bright or too dim, prompting me to switch to manual adjustment after a while.For some reason, my version of Pocophone F1 did not have face-unlock capabilities, even though these are present on the phone. Face unlocking on the F1 is definitely present in some markets, so it looks as if Xiaomi is rolling it out slowly, market by market, for some reason.Also, there's no water resistance or wireless charging. To be honest, I didn't expect these on a phone this cheap, but if these are important to you, you'll have to look elsewhere. Finally, there's no NFC, either, so if you planned to use Android Pay... sorry. Pocophone F1 has a fairly common dual camera combo: A 12-megapixel main sensor coupled with a 5-megapixel depth sensor.Image:  Stan Schroeder/MashableThe Pocophone F1's 12-megapixel main camera will produce good photos most of the time. I was impressed with how fast it was; I was typically able to fire it up and take decent shots of moving targets, which isn't always the case with Android phones.I'm not a big fan of AI-assisted photography that's all the rage lately. I don't mind the AI-assisted scene recognition, but I do mind the resulting photos, which are typically over-processed.The Pocophone F1 does does this, too: Check out that unnaturally blue water in the photo below — sure, it looks nice, but water was greenish that day, not blue. Luckily, you can turn the AI off with an easily accessible button on top of the camera UI.Image:  Stan Schroeder/MashableImage:  Stan Schroeder/MashableIf you don't mind the differences in color, though, both photos are pretty great. I was able to consistently get beautiful shots with the F1, as long as I had enough light.The secondary, 5-megapixel depth sensor is there for the bokeh-style shots, but they're a mixed bag. Unless you're at the right distance, and your subject is still, you'll get a pretty bad, unnaturally blurred shot. Pocophone F1's portrait mode works alright on humans. Try anything more complicated, and the blurring will be all over the place.Image:  Stan Schroeder/MashableIn the evening, the F1 sometimes took brighter shots than my iPhone X. But zoom in closer, and you'll see the photo is horribly soft and smudgy. The reason for this is likely another feature that the F1 doesn't have: optical image stabilization. You'll survive without it, but this is not the best phone for taking night-time photos. Image:  STAN SCHROEDER/MASHABLEImage:  STAN SCHROEDER/MASHABLETake the two photos above. From afar, the photo taken with the Pocophone F1 looks brighter and more vibrant. But the colors are fake; the iPhone X took a far more realistic photo. And check out the detail below; the boat and the edges of the hill in the distance are horribly smudgy, making the photo taken with the F1 look like a watercolor painting. Pocophone F1's camera just cannot cope with a low light scenario such as this one.Image:  Stan Schroeder/MashableThe 20-megapixel selfie camera will take huge, detailed selfies. They'll look good in the daylight, but don't expect miracles in low light.One thing that's great about Pocophone F1's selfie camera: Selfies aren't distorted.Image:  Stan Schroeder/MashableAll in all, while cameras won't be the main reason why you're buying this phone, most of the time the F1 will take photos that can hold their own against much more expensive phones. The Pocophone isn't perfect: It can be buggy, its camera is mediocre (though only if you measure it against the very best out there) and it lacks certain premium features like an OLED screen, water resistance and wireless charging. But in terms of performance and battery life, it might actually be the best phone around. Plus, extra features like liquid cooling tech and Kevlar-coated back (on the Armoured Edition) make it feel special. I love having a phone whose back doesn't scratch easily.Image:  Stan Schroeder/MashableNow, for the best part. Based on pricing in India, where the F1 was first launched, the 6GB/64GB version of the device costs just $285, partly due to the Indian rupee losing value compared to the dollar in recent months. The 6GB/128GB variant costs $326, the 8GB/256GB variant costs $394, and if you want the Kevlar back on top of that, it costs $407.Regardless of which version you get (provided you can get it where you live), that's an absolutely stellar deal. The old question of \"should you buy a flagship\" or \"should you buy three Xiaomi phones with roughly the same specs for the same price\" has never been more relevant.And even if you compare the Pocophone F1 with other price-mindful flagships such as OnePlus 6 or the Oppo F9, the Pocophone F1 is still cheaper and faster. Unless there's some specific detail about the F1 that really irks you, it's hard to argue against it being the best deal on the market right now. \nEvery product here is independently selected by Mashable journalists. If you buy something featured, we may earn an affiliate commission which helps support \nour work.\n"}