{"id": "MashableEmily Blunt on what it's really like to play Mary Poppins", "paragraph": "Mary Poppins is a woman with a talent for putting things back together again.Which is why it's rather apt that after 50 years, she's returning to our screens at a time when the world is arguably most in need of being put back together.SEE ALSO: Lin-Manuel Miranda shares what starring in 'Mary Poppins Returns' means to himAnd, Emily Blunt — who plays Mary Poppins in the upcoming sequel Mary Poppins Returns — is well aware of the impact her character has already had on the lives of those who watched the 1964 movie starring Julie Andrews. Standing in full Edwardian get-up inside Shepperton Studios, Blunt told Mashable that she has fond memories of watching the film as a child. \"The film, for me, and I think for most people, is one of those films that is seared into people's memory, an emblem of their nostalgia in many ways,\" says Blunt. \"That person coming in and so capable and so magical, and just sweeping it all up and making it right.\"\"I do remember it very fondly and took such a great comfort in it as a child,\" she continued. \"That was something that struck me — that person coming in and so capable and so magical, and just sweeping it all up and making it right.\"\"So I think we are trying to, obviously, continue that [comfort] now too with our film,\" Blunt added. Blunt hasn't revisited the film since childhood — not even prior to playing the part. That's because she's keen to make the part her own. \"I have not watched the original since I saw it as a child, cause I... no one is going to outdo Julie Andrews,\" says Blunt. \"I think I just want to — this is just going to be my version of her.\" Meryl Streep as Cousin Topsy and Emily Blunt as Mary Poppins.Image:  Jay MaidmentSo, how has Blunt gone about preparing for this iconic role? Just like she would any other role, Blunt says. \"I just try to approach her as I would any other character and not be caught up in the white noise of, 'Oh my God, you are Mary Poppins.'\"\"Meryl just seems to follow me into every film I do. It's quite creepy at this point.\"\"I think that has been my main focus, is just to approach her calmly, as I would any other character, how I would play her, with what I have been given on the page?\" Blunt continues. Meryl Streep — who starred alongside Blunt in The Devil Wears Prada and Into The Woods — also works with her in Mary Poppins Returns — playing Topsy, Mary Poppins' cousin. \"Meryl just seems to follow me into every film I do,\" says Blunt. \"It's quite creepy at this point.\"As for her other non-Meryl-Streep co-stars, she has nothing but lovely things to say about them. Blunt describes co-star Lin-Manuel Miranda as \"thrilling\" and \"one of the most positive people\" she's ever met. Director Rob Marshall and Emily Blunt on the set of Disney’s 'Mary Poppins Returns'.Image:  Jay Maidment\"When someone says, 'Hey, you want to take on Mary Poppins?' I'm like, 'Yeah!' and then you realise that all of your scenes are with children,\" says Blunt. \"Actually, our kids are particularly brilliant and it's been wonderful and quite moving to see them grow up in this experience and become real pros.\" She describes working with the actors who play the three Banks children — Pixie Davies, Nathanael Saleh, and Joel Dawson — as \"very moving\". \"They have become my closest friends really,\" she adds. Mary Poppins Returns will hit cinemas in the UK on December 21, 2018, and in the U.S. on December 19, 2018."}