{"id": "MashableFacebook really needs more people to watch Stories in its main app", "paragraph": "The future of Facebook is Stories.That was one of the biggest takeaways from Facebook's third-quarter earnings call, where Mark Zuckerberg and other executives repeated again and again that Stories will soon be bigger than News Feed.SEE ALSO: Here's how to install iOS 12.1 to get new emoji and Group FaceTimeWhile not the first time Facebook execs have made such a claim, it quickly became clear just how important Stories will be for future growth on Facebook.While the format has been incredibly successful on Instagram and WhatsApp, Zuckerberg noted that it's gotten a slower start in Facebook's main app, which the CEO attributed in part to early bugs in the experience. \"Our effort to switch Facebook from News Feed first to Stories first hasn't been as smooth as I hoped,\" Zuckerberg said.But Zuckerberg did say Stories is growing, and that he expects it to outpace News Feed in the \"not so distant future.\" Just how distant, though, is unclear, as he didn't share any metrics for Stories in the main Facebook app, where the feature has lagged significantly behind its counterparts on Instagram and WhatsApp. The bigger question, at least for investors, is how soon Facebook will able to monetize the format effectively, as the company is still in the early stages of experimenting with Story ads.\"We're following our normal playbook here of building out the best consumer products first, and focusing on succeeding there before ramping up ads. I'm optimistic we'll get ads in Stories to perform as well as feed over time,\" he told investors on the call.Or maybe they go there because that’s the only place on Instagram that doesn’t have ads. https://t.co/ijPrP6XEVY— Anthony Quintano ❄️ (@AnthonyQuintano) October 30, 2018In the meantime, it sounds like we can expect more ads in more places on Instagram. Zuckerberg hinted that ads may soon be coming to Instagram's Explore tab, which currently has no ads at all. He said that ads in Explore represent a significant opportunity for the company as Instagram users currently spend about 20 percent of their time in the  Explore tab.And Facebook Q3 earnings are in! Company once again lost users in Europe (only 1 million this quarter) and growth is still flat in US. but they gained 15 million in Asia and 9 million everywhere else $FB pic.twitter.com/hTcyzJseHC— Karissa Bell (@karissabe) October 30, 2018Overall, Facebook did manage to turn out stronger growth than last quarter's disastrous results. While daily active user growth remained flat in the United States and Canada, growth was up in other regions, including Asia. Europe, where new privacy legislation contributed to a loss of 3 million users last quarter, was the only region where the company lost users. Revenue was also up from last quarter to $13.73 billion, just barely under analysts' estimates.All that would seem to be relatively good news for the social media company, which still hasn't recovered from the nose dive that wiped out more than $100 billion off the company's market value following last quarter's earnings call."}