{"id": "Mashable6 tech gifts for the filthy rich", "paragraph": "Oh, hello! I didn't see you there, amongst my many possessions.You're looking for some guidance, you say, for this year's holiday season? Just a little, trinket? I see...Well, for the well-to-do lady or gentleman, nothing expresses love like a thoughtful gift. Cashmere, say. Or perhaps a little villa in the Riviera? A new cabana boy? That chalet in the Alps? SEE ALSO: The richest 1% will soon own half the world's wealthBut, I have an alternative... suggestion... if you will. Now listen, chap — you are a citizen of the world! You are on the cutting edge, my boy! Why settle for a mere object when you can present an item with a brain all its own?! Technology is the thing!  But not just any item, of course. You see, son, while... others... may have their little iPhones, their so-called smart homes, we desire technological mates that match our taste and breeding. Thankfully, there is plenty out there for the truly discerning. That is, if you know where to look. Come inside, let's begin.Gold or platinum? Really, it's just a matter of taste.Image:  BrikkQuite right, our mobiles are extensions of ourselves. And for your loved ones, I think this item may be just the thing. Never mind that it's made from 24k gold or platinum and covered in diamonds. What will really make this special is the craftsmanship and thoughtfulness of the design. And it does away with that gauche case, of course. Excuse my frankness, but who needs a case when you've got diamonds? This special edition Hublot can only be purchased with Bitcoin.Image:  HublotI know, I know, a watch is just so... expected. And, a Hublot? Classic, yes. But, exciting? Innovative? Actually, you might be surprised by this new offering. This watch may have something others do not: it is elusive. See, the Big Bang celebrates the 10-year anniversary of something the people call \"Bitcoin.\" Now, it is an automatic watch case made out of microblasted and polished black ceramic with a skeleton dial. But inside you'll see an homage to this new form of \"money,\" they say. And, the best part? You can only buy it with Bitcoin. That's right, you get it! Your old man would probably have no idea how to acquire this item! And isn't that itself worth its weight in, well, whatever it is you use to pay for this?Treat yourself.Image:  LeloPleasure is a foundational experience of life, is it not? So tell me, and don't be shy: why should we ever deign to give and receive pleasure with anything but the very best? This fine curves of this gold vibrator evoke the warmth of a St. Barthes beach; its shape, the shaft of your yacht as it plunges through the waves. The motto of the company behind this magnificent device is \"Lust Objectified.\" Tempting, tempting.This smart mirror is called 'Mirror.'Image:  mirrorOf course, what is pleasure without pain? What is beauty without sweat? This mirror, called 'Mirror,' allows you to stream an exercise course from your home gym, while never taking your eyes off of yourself. Yes, the mirror itself is the teacher, and you are her only pupil. She'll give you feedback based on your performance to sculpt a body deserving of your worthy soul within.The Aero french bulldog may be playful, but his bark is nothing short of aural luxury.Image:  Neimanmarcus.comNow now, this may seem a Koonsian gimmick. But it is so, so important that we keep our many responsibilities from leeching the joy from our burdensome lives. Don't you agree? One delightful way to remind us to play is with this delightful gentleman, the bulldog speaker, the life-like size of a frenchie, in neon pink. He's also more than just a pretty face. The little sir is an AeroSystems speaker. So you'll be able to blast \"Who let the dogs out\" in Great Hall to great effect! Perhaps he is not as refined as some might like. But I tend to think it is always nice to show a different side of oneself. Think of him as the bon bon on top of your many other holiday treats. The Serenity Solar Yacht is 74 feet and outfitted with 1,100 solar panels!Image:  neiman marcusIt is so, so important to give back, especially around the holidays. Which is why, for the sake of the planet, I recommend that you purchase the Serenity Solar Yacht fitted with solar panels. As you take a much-needed break after the travails of the holiday season, you could sail down the coast or even just take a quick trip to Barbados — all while helping the environment! And, I know you'll have your people handle payment. But I would be remiss not to mention that the Serenity is made possible by my colleagues at Neiman Marcus, who have so generously chosen to donate $50,000 out of the $7.1 million cost of the vessel to charity. Bravo! Consider this yacht one of your many good deeds for the year.Now, I must show you out. I hope that your visit has helped with the challenge that is holiday shopping. And, as you know, we are so much more than our worldly possessions. Who truly needs money or \"objects,\" really?! But, you and I, we work so hard. And with all of your foundations, and good works, you are just always thinking of others! So, perhaps, young man, think of yourself. Just this one, itty bitty time... indulge. \nEvery product here is independently selected by Mashable journalists. If you buy something featured, we may earn an affiliate commission which helps support \nour work.\n"}