{"id": "MashableHere's how to install iOS 12.1 to get new emoji and Group FaceTime", "paragraph": "New iPads weren't the only thing Apple revealed in Brooklyn. Apple released iOS 12.1 in addition to announcing the new home button-less iPad Pro, a Mac mini, and a refreshed MacBook Air. While this isn't an entirely new iOS, it's an important update that delivers promised features that the initial version of iOS 12 missed, as well as some much-needed performance improvements.SEE ALSO: Here’s where Apple hid your Camera Roll in iOS 12 MessagesThe big one, of course, is Group FaceTime. The ability to video call with up to 32 people on iOS and macOS devices is now available with this update. You'll also get several new emoji, including the hotly anticipated bagel with cream cheese. For iPhone XS and XS Max owners, there's now a fix for the automatic skin smoothing on selfies, and you can adjust the depth of field before you take a portrait mode shot. Additionally, the update turns on dual SIM support for the aforementioned models as well as the iPhone XR.Here's how to update your device to iOS 12.1 so you can reap all these benefits and more. Before completing any software upgrade, big or small, you'll want to perform a backup. It's always better to be safe than sorry, and if you end up losing data, it's good to have a copy of it for safekeeping. iOS devices can be backed up by plugging into iTunes for an automatic sync or by syncing with iCloud in the Settings menu on the device. iOS 12.1 is a relatively small update, but brings some nice features.Image:  screenshot by jake krol/mashableApple will let you update via an over-the-air method or through iTunes. The first route is certainly the easiest, by far. Just navigate over to Settings > General > Software Update, and then your device will look for the update. Once it finds iOS 12.1, it will give you a brief description of the update and its size. From there, click Download, then Install to start the update process. If you want to update via iTunes, you'll need to plug your iOS device into your Mac or PC. You'll also need to make sure you have the latest version of iTunes. Start by connecting your device to your computer, then open iTunes, and it should recognize the device. Click \"Check for Update,\" and iTunes will download the software update. Once it's on your computer, it will install on your iPhone.Whether you're updating on your device or via iTunes, you'll need to sign in with your Apple ID once it reboots. You'll need your Apple ID email and password, plus a device on which you'll receive your two-factor authentication code (if you have this extra layer of security turned on).After that, you're all set to enjoy iOS 12.1. Be sure to try the new emoji and FaceTime with 32 of your friends."}