{"id": "MashableHow to become a graphic designer without going to art school", "paragraph": "Look, it doesn't matter if you can't draw to save your life. You shouldn't let your inability to illustrate anything beyond stick figures and random doodles impede your pursuit of becoming a graphic designer. You're trying to become a digital artist here, not emulate Pablo Picasso's career.Plus, there's no need to bury yourself in loans and sell one of your kidneys to afford graphic design training. All you need is $29 and every ounce of determination to make it. The Ultimate Graphic Design Bundle is your $29 ticket to learning how to master the tools of design trade and create gorgeous content that very well may win the hearts of clients.Image:  PexelsThis training bundle features a wealth of resources that will help you become the graphic designer of your dreams (see also: Chip Kidd and Rob Janoff). It includes kinetic typography lessons that teach you how to blend motion and text to create striking animations. It covers logo design, where you'll get to dive deep into the process of building a brand's image. And, lastly, the included layout classes offer a wall-to-wall look at what it takes to create stunning real-world projects. Throughout all the courses, the hands-on training will help boost your portfolio. Of course, an artist is nothing without his or her tools, so you'll also gain access to courses that would help you achieve proficiency in today's top design programs, like Photoshop, Illustrator, and InDesign. There are even lessons on how to find and charge clients, so you'll be ready to build your own design business once you finish the training.All in all, the courses in this bundle amount to $1,592, but for a limited time, we're offering the Ultimate Graphic Design Bundle for only $29 — a savings of 98%. Image: Pexels  The Ultimate Graphic Design Bundle: Lifetime Access — $29 See Details \nHeads up: All products featured here are selected by Mashable's commerce team and meet our rigorous standards for awesomeness. If you buy something, Mashable may earn an affiliate commission. \n"}