{"id": "MashableLet these slow-motion videos of glorious giant bubbles cleanse your eyeballs", "paragraph": "This post is part of Hard Refresh, a soothing weekly column where we try to cleanse your brain of whatever terrible thing you just witnessed on Twitter.Life can be stressful, but you know what isn't? Watching giant, glistening soap bubbles float through the air.It might sound weird, but I recently learned first-hand how soothing the sight of an abnormally large bubble can be after an especially horrible news day. One night after leaving work I was racing through the rush hour crush of crowds when a man making giant soap bubbles in a nearby park caught my attention. I paused my autopilot commute home and joined the crowd of children and adults looking up in awe at the soapy orbs. And for a few minutes I just stared, entranced.SEE ALSO: Professional pumpkin carving videos are the official ASMR videos of fallThere's no denying tiny hand-held bubble wands are entertaining, but the sheer size of these massive bubbles give you the chance to really admire the translucent sphere and marvel at its rainbow tint.And while giant soap bubbles are a common act for street performers around the world, if you can't find a bubble master IRL, don't worry. This is what the internet is for. Videos of giant bubbles floating through the air are almost as satisfying as experiencing the magic in person.There's something about watching the soap slowly expand, morph through the air, and pop in a ripple effect that's especially soothing.For a few minutes the world feels like it's operating in slow motion and you're filled with the same childlike fascination you had when bubbles were first introduced into your life. If you're thoroughly captivated by the giant bubble videos and want to take your viewing experience to the next level, why not try testing your own skills? There are number of helpful tutorials online that explain how to make your own giant bubble wand, mix the perfect soapy solution, and master the giant bubble technique. Beginners can start by fashioning a wand with wooden dowel rods and a tri-string — the large loop that holds the soap. But if you're not in the DIY mood, a variety of soap bubble wands are sold online. So, next time you're looking for a way to de-stress, take a more unconventional approach to relaxation and just stare at some big ass bubbles.\nEvery product here is independently selected by Mashable journalists. If you buy something featured, we may earn an affiliate commission which helps support \nour work.\n"}