{"id": "MashablePlease Apple, don't kill MagSafe", "paragraph": "When Apple finally delivered its very long awaited MacBook Air upgrade, I was one of many MacBook Air devotees relieved to see that the laptop was finally getting some much needed attention.That is, until I realized it might spell the end of the one Apple accessory I've been using non-stop for more than a decade. I'm talking, of course, about Apple's MagSafe chargers.Because while the new MacBook Air is smaller and faster than ever (and finally has a Retina display), it comes not with the magnetic MagSafe connector of every other MacBook Air, but with two Thunderbolt 3.0 ports, the same USB-C ports on the rest of the MacBook line. And that makes me very, very worried about the future of MagSafe.SEE ALSO: Apple's new MacBook Air is fine. Just fine.To be clear: MagSafe isn't dead just yet. Apple is still selling the previous generation MacBook Air that was released last June, which uses MagSafe. But with all new MacBooks now using USB-C instead, if it's not dead yet, it's certainly on life support.And that may not be entirely surprising, as every other significant MacBook upgrade has come with USB-C instead. But it would be a damn shame if MagSafe were to fade away entirely. It's difficult to remember now, but when Apple debuted MagSafe back in 2006, it was unlike anything else. While most laptop charging cables were chunky, black bricks, MagSafe was relatively sleek. Though not everyone loved the easily-dislodged magnetic connector, everyone did love the idea that it could avert the kind of tripping disasters that had ruined so many pricey laptops before it. (MagSafe has saved my own laptops from dozens of potentially disastrous falls over the years.)Image:  appleBut switching to USB-C undoes all that peace of mind. Those of us with newer MacBooks once again have to worry about accidentally tugging on and tripping over cables.There are, however, a lot of good reasons why Apple opted for Thunderbolt 3.0 over MagSafe. As we've been saying for years, USB-C can simply do more. Besides powering your laptop, it can also transfer data and output video. It offers more flexibility, letting you charge from external battery packs. It's also smaller and thinner than larger, older USB ports, which helps as Apple continues its quest to make our devices thinner and thinner.But, even knowing all that, the idea of giving up my trusty MagSafe cable gives me serious anxiety. I've now been using MacBooks with MagSafe for more than 10 years. So long, in fact, I have a supply of extra chargers at home, in the office, and even at the apartment of my Windows-using boyfriend — just so I never have to be without. And, should that fail, the cable's become ubiquitous enough over the last 12 years, I know there's likely one not too far away, should I find myself at a friend's house or a meeting and in need of more juice. (I even carry around an extra MagSafe to MagSafe 2 adapter just to cover my bases.)USB-C, by the way, is supposed to be at nearly the same level of ubiquity. With nearly every major flagship smartphone (save, ahem, Apple), and more and more laptop makers, supporting USB-C, the standard is more common than ever. So switching out the MacBook chargers shouldn't be that big of a deal, right?Not so fast.As much as electronics makers have spent the last few years claiming that USB-C is going to fix all our charging cable nightmares, that's still far from the case. That's because there are actually still several different USB-C standards, and not all cables are created equally. Not all USB-C cables support Thunderbolt 3, meaning not all USB-C cables will actually be capable of charging your MacBook.Worse still, as Mashable Tech Editor Pete Pachal recently pointed out, there are a ton of sketchy, off-brand USB-C cables floating around right now. And, while off-brand cables may seem like a good idea when Apple's charging cables cost $19 and the 30W power brick is $49, they're often ineffective at best, or potentially laptop-destroying at worst. Sounds like a mess, right? Well, fortunately for MagSafe lovers like myself, there is a small glimmer of hope. Apple might just be working on a solution that could bridge the messy MagSafe/USB-C divide.Apple's proposed patent for a MagSafe adapter for USB-C.Image:  USPTOThe company is working on a MagSafe adapter that would be USB-C compatible, according to a patent that surfaced last year. The proposed gadget would let you plug in your old MagSafe cable into a USB-C attachment, which could effectively be the best of both worlds. Some third-party companies have already come up with similar solutions, like Griffin's magnetic BreakSafe power cables, though reviews have been mixed. Of course, just because Apple patented the idea doesn't mean such a product would actually launch. Loads of patents never end up becoming actual consumer products. But, at the very least, it gives us reason to hope that Apple might not be done with MagSafe yet, either. \nEvery product here is independently selected by Mashable journalists. If you buy something featured, we may earn an affiliate commission which helps support \nour work.\n"}