{"id": "MashableWhat your favorite home assistant command really says about you ", "paragraph": "No matter what kind of home assistant or smart speaker you’re on a first name basis with, chances are you’ve reached co-dependent status with it — because no one wants to physically do things when you can yell at a piece of plastic to do it instead. Playing actual board games? It’s not 1984. Jotting down things for your to-do list? Uh, pens are practically an endangered species. Knowing things? Please, there’s the internet for that. Our go-to commands get us through the day, but when you really think about it, your favorite requests actually reveal a lot about your character. Here, we take a closer look at what your choice commands could be saying about you. When you ask your home assistant to set a timer, you feel like the boss of your domain. Heaven forbid you should have to take out your phone to manually do it on some digital app. No, you have things to do! You are clearly a precise, punctual, and to-the-point person, which means you are efficient with your time and can’t waste precious seconds on anything beyond asking a timer to be set for you. We’re talking as little effort as possible — just a shout, if you will — because you’re too busy multitasking or trying to get in a 6-minute cat nap to worry about an alarm, too. If you ask a smart speaker to read you the news, you’re mildly interested in what’s happening around you and want the anyone who’s tracking your digital footprint to think that you’re smart. Optics are important to you, and how are you to keep up appearances if you don’t have a loose grasp on current events? A firm grasp might require actually picking up a newspaper or scrolling through a news site — but the former would get ink on your fingers and the latter would put you at risk for carpal tunnel, so you respectfully decline and prefer to consume your news aurally. It’s eco-friendly and efficient, and everyone loves a twofer.We all need to know what time it is, but our phones, clocks, or watches aren’t always nearby. Asking for the time is a natural question for a hands-free assistant, especially when you, well, have your hands full. Now, if you’re the type to ask what time it is multiple times, that’s just peak laziness. Get quiet, dig deep, and ask yourself: Are you happy with this sloth life? You also may be suffering from acute lethargy and should consider consulting a physician.Sometimes you have a song in your head and you just need to hear it in real life. Other times you just need to fill the deafening silence in the room. Either way, you’re a fantastic human being because you like music and everyone knows that music is awesome and makes the world go ‘round. Also, if you have friends who don’t like music, they’re probably robots and you should excise them from your social circle immediately. No longer can you make it through more than five waking minutes of the morning without knowing what the weather is. How will you decide what to wear? What if you’re too hot or too cold? Do you need an umbrella? Ultimately this says you’re the type who likes to be prepared for anything. Not only do you ask what the weather is, you also try to mine additional information by posing your question in other clever ways: What’s the temperature? Is it going to rain today? Fear not, A-types. To ensure you’re always primed for the elements, wear layers. And remember: If it’s fall or winter, it’s always sweater weather. "}