{"id": "MashableA brief history of presidents jogging in short-shorts", "paragraph": "Our current president takes the back seat in a golf cart instead of walking. He downs monster Big Macs in lieu of salads and guzzles Diet Cokes like they're water.But in better(ish!) times, even our most toxically masculine leaders seemed to care about exercise, and did so while rocking teeny-tiny runner's booty shorts.SEE ALSO: Jimmy Carter shook everyone's hands on a flight to Atlanta because that's his thingI can't say I ever longed to see any of my presidents in anything but profoundly boring suits. That being said, I find it soothing to see our leaders go outside to do something in nature that doesn't involve a golf course or a mediocre Florida resort.Whatever you think of our pre-Donald Trump presidents, at least they were marginally in touch with reality. Unlike Trump, they understood that the body doesn't have a \"finite amount of energy.\"Presidential jogging actually started with President Carter, who was in power when the form of cardio started gaining popularity in the 1970s.\"Carter is the classic jogger of the 1970s, albeit somewhat older,\" Paul Milvy, an assistant professor of community medicine at the Mount Sinai School of Medicine, told the Washington Post in 1979.Not only did Carter stan jogging, he did it while rocking incredible short-shorts. Look at Carter werk that aesthetic while president. He was in the late 50s when he decided to show this much thigh:White shorts aestheticImage:  Bettmann ArchiveHere's Jimmy Carter with his trainer in 1979. Again, he's in white shorts.Image:  Gamma-Rapho via Getty ImagesBring. Back. Sweatbands.Image:  Bettmann ArchiveClear eyes little shorts can't loseImage:  Corbis via Getty ImagesWhatever you think about his policies, Carter was a short-short jogging icon. Unfortunately, President Ronald Reagan didn't jog while in office, so it was eight years before his successor President George H.W. Bush could pick up where Carter left off.Bush was in his mid-sixties when he became president and started jogging regularly in front of the camera.There were far longer, more fashionable shorts in style at the time. Bush nonetheless chose...this look:In a collared shirt, no lessImage:  Bettmann ArchiveGeorge H.W. Bush was one step away from a Wigwam sockImage:  rick maiman/Rick MaimanGeorge H.W. Bush copping Carter's style in 1980Image:  cynthia johnson/Getty ImagesPresidential stretchingImage:  cynthia johnson/Getty ImagesThe single-term president showed a lot of of skin for sure. Frankly, however, my favorite photo of the era is this image of Barbara Bush \"jogging,\" according to the original photo caption. The woman is in full-length chino pants and a white polo. She's not breaking a sweat, she's not even trotting. She's got a fresh perm. This, my friends, is how you jog. Barbara Bush jogging coutureImage:  mark reinstein/Corbis via Getty ImagesThen we had President Bill Clinton, who took the jogging short-short and made it even tinier. The man basically wore bikini underwear in public.Then Vice President Al Gore tried to sex it down with a map-print T-shirt, but even he couldn't resist the appeal of the short-short.Unprecedented upper-thigh transparencyImage:  tim clary/AFP/Getty ImagesClinton rocking fuschia and then  Sen. Joe Lieberman in a UConn Huskies tee.Image:  Robert Giroux/AFP/Getty ImagesPut on some pants, Mr. PresidentImage:  Cynthia johnson/Getty ImagesClinton even occasionally struggled with a classic '90s athleisure problem: wearing tiny shorts with an oversized shirt (or in his case, sweatshirt,) making it appear as if he's wearing a mini dress.The president in a shorty short \"dress\"Image:  luke frazza/AFP/Getty ImagesTragically for some I guess, Clinton and the short-shorts era came to an end with the election of President George W. Bush. Over time, Bush extended the length of the presidential jogging short to a more traditional, mid-thigh length. The era of the radical short-shorts was dead.Please wear track pantsImage:  paul buck/AFP/Getty ImagesCould use a sweatbandImage:  Paul AFP/Getty ImagesYou might imagine that President Barack Obama was a big jogger. Unfortunately, Obama typically exercised in private (except for that time he and then Vice President Joe Biden jogged in their office attire, which has its own kind of appeal.) And President Trump does this.Trump is technically moving, so there's thatImage:  ludovic marin/AFP/Getty ImagesSigh. Let's not get too nostalgic. I'm not particularly interested in seeing any of these men in short-shorts in the future.We all, however, should aspire to see something better, like a president who moves, or who at the very least demonstrates knowledge of the U.S. Constitution."}