{"id": "MashableThis fifth grader's baked potato costume is better than whatever you've planned for Halloween", "paragraph": "This is One Good Thing, a weekly column where we tell you about one of the few nice things that happened this week.Halloween is fast approaching and while you may think your planned costume's impressive, there's a very good chance it won't top this fifth grader who dressed as a baked potato.Reddit user seal2781, a 24-year-old named Celia, recently shared a throwback Halloween picture from 2004 — the year she followed her heart and dressed as a baked potato wrapped in foil with a li'l pat of butter on top. Precious! Delicious! All around wholesome!The costume is one of the closest things we've seen to absolute Halloween perfection, and the kind of ensemble we should all strive to put together this time of year. If you're having doubts about how great it is, we're not exaggerating. See for yourself...In 5th grade I was a baked potato for Halloween from r/picsSEE ALSO: This Kevin from 'The Office' Halloween costume for babies needs to exist IRLCelia told Mashable via Reddit that she fashioned the wearable baked potato for her elementary school Halloween costume contest. The costume won first prize and for that, she received a whole $5! \"The day before the contest I decided I wanted to be a baked potato,\" she wrote. \"I'm not really sure why — I just thought it would be funny.\" She says her dad Ron helped make the costume out of cardboard boxes.\"I really felt like a baked potato wearing it.\"\"We covered the boxes in wide plastic wrap to hold it all together, and then covered it in foil and added the fluff and brown paper 'skin.' The pad of butter was just a small pizza box covered in yellow cellophane paper.\"The baked potato has everything you'd want from a good costume. The homemade aspect shows off your resourceful side, it'll give people a good laugh, and you'll also stand out from a crowd of store bought superheroes, princesses, and more. Though it does have one downfall...\"The main thing I remember about the costume was how hot it was. I really felt like a baked potato wearing it,\" Celia said. But still, an overall success.Celia's family has been cranking out next-level costumes for years, she explained, recalling her brother's most memorable ensemble: a massive five-foot tall baseball bat. Stunning.Image:  seal2781/redditWant more clever culture writing beamed directly to your inbox? Sign up here for the twice-weekly Click Click Click newsletter. It's fun – we promise."}