{"id": "MashableBest gifts for teenage girls: Stuff she'll actually want to show off on InstagramThe Instax Mini 9The Fitbit Charge 3Some decorative neon lightsThe Beats Solo 3A Clarisonic Sonic Face BrushThe HyperchillerThe Amazon Echo LookA real DSLR cameraA personalized phone caseThe Asus Chromebook FlipA succulent terrariumA 4-in-1 curler and straightenerThe Nintendo SwitchA Birchbox subscriptionA selfie stick for dogsA water resistant backpackA portable phone chargerA portable Bluetooth speakerA gel polish UV lampA few bath bombsA digital picture frame", "paragraph": "Warning: If you thought shopping for women in general was hard, just know that it gets harder. Try shopping for a teenage girl.Juuls, Tide Pods, Converse (but only the white ones), and saying LOL (ironically) — yup, we’re talking about the ever-changing hell that is teenage girl trends. It can be tricky to choose a gift that she’ll like and use for longer than a month, but does that mean you throw in the towel and plop a gift card in an envelope? That’s basically code for “I don’t get you at all.” Instead of resorting to looking like an old, there is a way to show the teenage girl on your gift list that you “get them.” We’re talking music tech, phone accessories, room decor, artsy cameras, and more — all things to help her live her best life with her friends, branch out and be social, and help her figure out her passions. (Also known as gifts that won’t be met with an eye roll or her tweeting about you.) Even if her \"thank you\" is sauced in sarcasm, receiving a gift that she can use over and over again that she knows you put thought into will have her feeling appreciative. (I would know — I was a picky teenage girl.)Here are the best gifts for teenage girls:\n\n\n\n\n\n\n\n\n\n\nFUJIFULM\nBEST FOR THE INSTAGRAM WARRIOR\nThe Instax Mini 9\nHigh school is like, the most photographable period ever. Friends, sleepovers, dances —she’ll need to document it all. The Fujifilm Instax Mini 9 is the perfect partner in crime. The Mini 9 is the newest of the Instax family, with five colors and fun new features like automatic exposure measurement and a selfie mirror. Once printed, she can hang them from clip lights or display them in a glittery frame.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$69.99\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nFITBIT\nBEST FOR THE SPORTS PLAYER\nThe Fitbit Charge 3\nTeenagers are picky, and most girls wouldn’t be caught dead in some clunky fitness tracker. The new Fitbit Charge 3 is sophisticated and rocks an OLED screen, available in muted shades to match her style. Ace for the girl who plays sports year round, the Charge 3's personalized fitness score can help track her progress, as well as track sleep, steps, and calories. Battery life is five days, so she’s set for a week.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$149.95\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nDELICORE\nBEST FOR THE HIPSTER GIRL\nSome decorative neon lights\nNothing is as important as bedroom #aesthetics, especially when sleepovers happen on a weekly basis. Help her amp up her décor these neon lights. Choose from palm trees, moons, cats, flamingos, hearts, and 20 more.\n\nThe lights can be hung with the included strip or sit on a surface, powered by AA batteries or a USB cable. (Plus, it’s an easy thing to take to college to spice up a dorm.)\n\n\n\n\nFrom AMAZON\n\n\n\n\n$13.99\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nBEATS\nBEST FOR THE CONCERT GOER\nThe Beats Solo 3\nIf she gets in the car, immediately puts on headphones, and ignores everyone, here’s your gift. The Beats Solo3 are pretty perfect, especially if she has an iPhone 7 or up (for Apple’s wireless chip). These Beats were made for concert lovers, sounding superb on low-end dubstep and modern, auto-tuned vocals — all for 40 hours on one charge. But that color selection, though. Choose from metallic, matte, and vibrant shades to match her personal style.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$197\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nCLARISONIC\nBEST FOR THE GIRL WITH STUBBORN SKIN\nA Clarisonic Sonic Face Brush\nSkin problems are an inevitable part of adolescence — and as a teenage girl, showing up to school with a zit seems like the *literal* worst ever. The Clarisonic Mia 2 Facial Sonic Brush claims to remove six times more makeup than wipes and unclogs pores to make skin more receptive to cleansing. The spinning helps reduce oily spots, dry patches, and already-there blemishes, while making skincare actually fun.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$169\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHYPERCHILLER\nBEST FOR THE COFFEE OBSESSIVE\nThe Hyperchiller\nStarbucks: Cool to Instagram, way too expensive. Save your teenager some time and money without making her skip out on her caffeine. The HyperChiller is a portable iced coffee maker that keeps coffee and ice in two separate stainless steel chambers, so the brew can be cooled without being watered down — in less than a minute. If she’s still concerned with flexing a Starbucks cup, a reusable one is ace.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$29.99\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nAMAZON\nBEST FOR THE ONLINE SHOPPING ADDICT\nThe Amazon Echo Look\nForget selfie sticks — the Amazon Echo Look is the new camera in town. It’s an AI-infused \"style assistant\" that judges outfits and takes full-length pictures, with a Style Check feature to help decide which clothes to keep, which look best together, and can even help organize her closet based on season. Aside from playing fashion police, the Look can be used for Alexa commands like asking for the weather or ordering pizza. \n\n\n\n\nFrom AMAZON\n\n\n\n\n$199\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nCANON\nBEST FOR THE CREATIVE GIRL\nA real DSLR camera\nIf she's an aspiring photographer, something more intense than a Polaroid is necessary. The Canon EOS Rebel T7i is ideal for beginners, featuring a user-friendly menu and touchscreen with illustrations to show her the ropes. Because it's a DSLR, she can also switch lenses to her heart's content. It's a little pricey for a starter camera, but it's going to last her for years — so you can sleep well knowing she's getting her (your) money's worth.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$849\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nCASETIFY\nBEST FOR THE NONSTOP TEXTER\nA personalized phone case\nMirror selfie levels: Maximized. She'll be ecstatic to see her name, initials, or favorite Instagram memories on the back of a phone case from Casetify. Font and backdrop combos are endless, including glitter, marble, pressed flowers, neon sand liquid, and more. Plus, this ensures that no one grabs her phone by accident. Not only are they the cutest ever, but they're also encased in rubber to absorb shock from drops (up to 6.6 feet, apparently)\n\n\n\n\nFrom CASETIFY\n\n\n\n\n$45\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nASUS\nBEST FOR THE GIRL WHO LOVES SCHOOL\nThe Asus Chromebook Flip\nHigh schoolers need a laptop that’s light, heavy duty, and will make them look cool. The Asus Chromebook Flip C302 is it. Weighing under two pounds, transporting the Flip in a backpack will be a breeze, with a 12.5-inch HD touchscreen and 360-degree hinges for Netflix marathons anywhere. Her files will be cloud-stored, so she won't be screwed if something happens to her device. The 10-hour battery life makes long study sessions a go, and the laptop can easily follow her to college.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$499\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nNCYP\nBEST FOR THE OUTDOORSY GIRL\nA succulent terrarium\nDesert plants are the hippest little decor pieces nowadays. Even the drabbest rooms or college dorms can be brightened up with a mini terrarium full of colorful succulents, small enough to sit on her desk or a small shelf. Amazon's Plant Shop sells them in packs of five, and then all she'll need is a precious hexagonal glass planter to show the off in. Care is minimal, so being a full-time plant mom isn't required.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$15.95\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOMMIT\nBEST FOR THE GIRL WITH WILD LOCKS\nA 4-in-1 curler and straightener\nThe Hommit 2-in-1 Hair Straightener and Curler is the answer to hair prayers, featuring rounded, negative ion plates to straighten, curl, or wave while locking moisture in. Hommit isn't as well-known as the Revlons or Chis of the world, but this puppy sees more purchases and better reviews than the expensive 2-in-1 models.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$56.99\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nNINTENDO\nBEST FOR THE GAMER GIRL\nThe Nintendo Switch\nWho wouldn’t want the gift of never being bored? Named after its ability to switch from TV to on-the-go gaming, the handheld Nintendo Switch is a middle ground if she's not into the bigger consoles — complete with detachable controllers to play with friends and a 6-hour battery. Classics like Mario Kart turn the most boring days into parties, with new versions of Super Smash Bros. and Super Mario Party coming soon.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$299\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBIRCHBOX\nBEST FOR THE BEAUTY BEGINNER\nA Birchbox subscription\nA Birchbox subscription for a teenage girl is a no-brainer. It’s great if she’s a beauty guru who’s watched every makeup tutorial YouTube can offer, but especially perfect if she’s a beginner with no idea where to start. Each month, she’ll receive a box with five makeup, skin, or hair care samples, allowing her to discover new favorites she never knew about before. It’s literally the holiday gift that keeps on giving.\n\n\n\n\nFrom BIRCHBOX\n\n\n\n\n$10\n / month\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nPOOCH SELFIE\nBEST FOR DOG MOMS\nA selfie stick for dogs\nFor girls who like dogs more than they like people, Pooch Selfie is the selfie stick alternative made specifically for taking pictures with doggos. Clip it to your phone and show Fido the tennis ball on top. Pooch Selfie gets him or her to do the impossible: Actually look at the camera, basically guaranteeing money shot after money shot. (There's also one with a little bell for cats.)\n\n\n\n\nFrom AMAZON\n\n\n\n\n$9.99\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nFJALLRAVEN\nBEST FOR THE PRACTICAL GIRL\nA water resistant backpack\nSome girls prefer to sport an oversized purse as a backpack, while some would prefer a durable, adventure-ready knapsack. The Scandinavian designers at Fjallraven have perfected their classic school backpack, the Kanken, and teenagers have taken notice — these things are everywhere. The water and dirt resistant Vinylon makes these durable enough for years of wear and tear, plus each has countless pockets (including one for a laptop) and comfy straps.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$79.95\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nANKER\nBEST WHEN YOU'RE STUMPED\nA portable phone charger\nHaving a dead phone in public is basically the end of the world — that’s not a teenage girl problem, that’s an everyone problem. Claiming to be one of the most powerful out there, this mini portable charger can apparently fully charge an iPhone almost twice. (For something the size of a lipstick, that's amazing.) It also comes with an 18-month warranty, but based on the 26,000 customer reviews, we don’t think she’ll need that.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$19.99\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nULTIMATEEARS\nBEST FOR THE ENERGIZER BUNNY\nA portable Bluetooth speaker\nA girl who's the life of the party deserves a gift that keeps up. The Ultimate Ears Wonderboom is the *ultimate* gift. This cylindrical speaker is adorable, easily transported, and more powerful than it looks: The pod shape offers 360-degree booming sound, plus 10 hours of battery life. It's also waterproof enough to be submerged in three feet for 30 minutes, so when things get wild the tunes will stay on.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$68\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nSUNUV\nBEST FOR THE GIRL WITH EXPENSIVE TASTE\nA gel polish UV lamp\nTrips to the nail salon every few weeks is a grossly expensive habit — especially for teenage girls who are likely in school and have part-time jobs at most. She's not about to give it up completely, so help her save by doing the fancy stuff at home with a UV lamp for gel nails. After a few easy steps, she can give herself manicures said to last three weeks before chipping.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$44.99\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nLUSH\nBEST FOR THE STRESS BALL\nA few bath bombs\nAesthetically pleasing bath art? Hypnotizing smells? Soft skin? She'll love these. Not only are these fizzing (and sometimes glittery) balls of soap super 'grammable, but they come in relaxing amber, mood-boosting citrus, and about 15 other scents. When trigonometry sucks, the soccer season looks bleak, or first dates are hell, bath bombs act as a makeshift spa day. The coolest part? The Da Bomb company is run by a pair of teenage sisters.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$8.95\n\n\nSee Details\n\n\n\n\n\n\n\n\n\n\n\n\n\nNIXPLAY\nBEST FOR THE SOCIAL BUTTERFLY\nA digital picture frame\nWhen traditional picture frames just aren't enough, an Alexa-enabled digital picture frame from Nixplay can do the trick. It'll shuffle through her best memories (photos and videos) and change when it senses motion to ensure that each gets its time to shine. Now she can skip the hassle of printing and hanging by adding her new pics to the queue through the app.\n\n\n\n\nFrom AMAZON\n\n\n\n\n$149.99\n\n\nSee Details\n\n\n\n\n\n\n\n\nHigh school is like, the most photographable period ever. Friends, sleepovers, dances —she’ll need to document it all. The Fujifilm Instax Mini 9 is the perfect partner in crime. The Mini 9 is the newest of the Instax family, with five colors and fun new features like automatic exposure measurement and a selfie mirror. Once printed, she can hang them from clip lights or display them in a glittery frame.Teenagers are picky, and most girls wouldn’t be caught dead in some clunky fitness tracker. The new Fitbit Charge 3 is sophisticated and rocks an OLED screen, available in muted shades to match her style. Ace for the girl who plays sports year round, the Charge 3's personalized fitness score can help track her progress, as well as track sleep, steps, and calories. Battery life is five days, so she’s set for a week.If she gets in the car, immediately puts on headphones, and ignores everyone, here’s your gift. The Beats Solo3 are pretty perfect, especially if she has an iPhone 7 or up (for Apple’s wireless chip). These Beats were made for concert lovers, sounding superb on low-end dubstep and modern, auto-tuned vocals — all for 40 hours on one charge. But that color selection, though. Choose from metallic, matte, and vibrant shades to match her personal style.Skin problems are an inevitable part of adolescence — and as a teenage girl, showing up to school with a zit seems like the *literal* worst ever. The Clarisonic Mia 2 Facial Sonic Brush claims to remove six times more makeup than wipes and unclogs pores to make skin more receptive to cleansing. The spinning helps reduce oily spots, dry patches, and already-there blemishes, while making skincare actually fun.Starbucks: Cool to Instagram, way too expensive. Save your teenager some time and money without making her skip out on her caffeine. The HyperChiller is a portable iced coffee maker that keeps coffee and ice in two separate stainless steel chambers, so the brew can be cooled without being watered down — in less than a minute. If she’s still concerned with flexing a Starbucks cup, a reusable one is ace.Forget selfie sticks — the Amazon Echo Look is the new camera in town. It’s an AI-infused \"style assistant\" that judges outfits and takes full-length pictures, with a Style Check feature to help decide which clothes to keep, which look best together, and can even help organize her closet based on season. Aside from playing fashion police, the Look can be used for Alexa commands like asking for the weather or ordering pizza. If she's an aspiring photographer, something more intense than a Polaroid is necessary. The Canon EOS Rebel T7i is ideal for beginners, featuring a user-friendly menu and touchscreen with illustrations to show her the ropes. Because it's a DSLR, she can also switch lenses to her heart's content. It's a little pricey for a starter camera, but it's going to last her for years — so you can sleep well knowing she's getting her (your) money's worth.Mirror selfie levels: Maximized. She'll be ecstatic to see her name, initials, or favorite Instagram memories on the back of a phone case from Casetify. Font and backdrop combos are endless, including glitter, marble, pressed flowers, neon sand liquid, and more. Plus, this ensures that no one grabs her phone by accident. Not only are they the cutest ever, but they're also encased in rubber to absorb shock from drops (up to 6.6 feet, apparently)High schoolers need a laptop that’s light, heavy duty, and will make them look cool. The Asus Chromebook Flip C302 is it. Weighing under two pounds, transporting the Flip in a backpack will be a breeze, with a 12.5-inch HD touchscreen and 360-degree hinges for Netflix marathons anywhere. Her files will be cloud-stored, so she won't be screwed if something happens to her device. The 10-hour battery life makes long study sessions a go, and the laptop can easily follow her to college.Desert plants are the hippest little decor pieces nowadays. Even the drabbest rooms or college dorms can be brightened up with a mini terrarium full of colorful succulents, small enough to sit on her desk or a small shelf. Amazon's Plant Shop sells them in packs of five, and then all she'll need is a precious hexagonal glass planter to show the off in. Care is minimal, so being a full-time plant mom isn't required.The Hommit 2-in-1 Hair Straightener and Curler is the answer to hair prayers, featuring rounded, negative ion plates to straighten, curl, or wave while locking moisture in. Hommit isn't as well-known as the Revlons or Chis of the world, but this puppy sees more purchases and better reviews than the expensive 2-in-1 models.Who wouldn’t want the gift of never being bored? Named after its ability to switch from TV to on-the-go gaming, the handheld Nintendo Switch is a middle ground if she's not into the bigger consoles — complete with detachable controllers to play with friends and a 6-hour battery. Classics like Mario Kart turn the most boring days into parties, with new versions of Super Smash Bros. and Super Mario Party coming soon.A Birchbox subscription for a teenage girl is a no-brainer. It’s great if she’s a beauty guru who’s watched every makeup tutorial YouTube can offer, but especially perfect if she’s a beginner with no idea where to start. Each month, she’ll receive a box with five makeup, skin, or hair care samples, allowing her to discover new favorites she never knew about before. It’s literally the holiday gift that keeps on giving.For girls who like dogs more than they like people, Pooch Selfie is the selfie stick alternative made specifically for taking pictures with doggos. Clip it to your phone and show Fido the tennis ball on top. Pooch Selfie gets him or her to do the impossible: Actually look at the camera, basically guaranteeing money shot after money shot. (There's also one with a little bell for cats.)Some girls prefer to sport an oversized purse as a backpack, while some would prefer a durable, adventure-ready knapsack. The Scandinavian designers at Fjallraven have perfected their classic school backpack, the Kanken, and teenagers have taken notice — these things are everywhere. The water and dirt resistant Vinylon makes these durable enough for years of wear and tear, plus each has countless pockets (including one for a laptop) and comfy straps.Having a dead phone in public is basically the end of the world — that’s not a teenage girl problem, that’s an everyone problem. Claiming to be one of the most powerful out there, this mini portable charger can apparently fully charge an iPhone almost twice. (For something the size of a lipstick, that's amazing.) It also comes with an 18-month warranty, but based on the 26,000 customer reviews, we don’t think she’ll need that.A girl who's the life of the party deserves a gift that keeps up. The Ultimate Ears Wonderboom is the *ultimate* gift. This cylindrical speaker is adorable, easily transported, and more powerful than it looks: The pod shape offers 360-degree booming sound, plus 10 hours of battery life. It's also waterproof enough to be submerged in three feet for 30 minutes, so when things get wild the tunes will stay on.Aesthetically pleasing bath art? Hypnotizing smells? Soft skin? She'll love these. Not only are these fizzing (and sometimes glittery) balls of soap super 'grammable, but they come in relaxing amber, mood-boosting citrus, and about 15 other scents. When trigonometry sucks, the soccer season looks bleak, or first dates are hell, bath bombs act as a makeshift spa day. The coolest part? The Da Bomb company is run by a pair of teenage sisters.When traditional picture frames just aren't enough, an Alexa-enabled digital picture frame from Nixplay can do the trick. It'll shuffle through her best memories (photos and videos) and change when it senses motion to ensure that each gets its time to shine. Now she can skip the hassle of printing and hanging by adding her new pics to the queue through the app."}