{"id": "Mashable10 books by women who are changing the world", "paragraph": "If you keep up with Oprah's Book Club — or at the very least, have been online recently — then you know Michelle Obama finally released her memoir, Becoming, on Nov. 13. In it, the former first lady opens up in ways she never has before, revealing intimate details about marriage counseling, her miscarriage, and the reason why she'll \"never forgive\" Donald Trump. Obama will undoubtedly continue these candid conversations in the coming weeks, as she travels across the country for her book tour. SEE ALSO: Michelle Obama says she can 'never forgive' Donald TrumpShe's not the only woman trailblazer to share her story. In 2018 alone, we've heard from the cofounder of Black Lives Matter, Patrisse Cullors; journalist Asha Bandele; Sarah McBride, the national press secretary for the Human Rights Campaign; and Ibtihaj Muhammad, the first U.S. Olympian to wear a hijab while competing.Whether you're looking for life lessons, life inspiration, or an inside look into the lives of your favorite icons, consider reading these books by and about badass women: Image:   Crown Publishing GroupBecoming By Michelle ObamaFormer first Lady Michelle Obama has accomplished so much in the White House and beyond. Now she's giving readers a play-by-play on how she got it all done. Take notes!  Even after you close the book, you can expect to hear more from Obama. \"So I’m still becoming, and this is the story of my journey,\" she told Oprah. Image:  Potter/Ten Speed/Harmony/RodaleModern HERstory: Stories of Women and Nonbinary People Rewriting HistoryBy Blair Imani (Foreword by Tegan and Sara) The history books don't always get it right. In fact, they often skip, ignore, or suppress the accomplishments of women and nonbinary people. This collection of profiles helps give a fuller picture, sharing the stories of 70 leaders who are making the world a better place. Image:  Hachette BooksProud: My Fight for an Unlikely American DreamBy Ibtihaj Muhammad, with Lori Tharps In 2016, fencer Ibtihaj Muhammad made history when she became the first Muslim woman from the U.S. to compete in the Olympics in a hijab. In her book, she describes the many obstacles she had to overcome to get to that moment. Image:   Atria BooksSurpassing Certainty: What My Twenties Taught MeBy Janet MockJanet Mock's twenties involved going to the University of Hawaii as a first-generation college student and learning how to navigate school, love, being away from home, and figuring out her next steps — just like so many of us. The trans rights activist talks about it all in her inspiring book. Image:  TouchstoneMake Trouble: Standing Up, Speaking Out, and Finding the Courage to Lead — My Life StoryBy Cecile RichardsFor years, Cecile Richards was the president of Planned Parenthood Federation of America and the Planned Parenthood Action Fund. Her career in activism actually started way back when she was in just seventh grade. In this book, she shares the ups and downs of her life as an activist. Image:  Crown/ArchetypeTomorrow Will Be Different: Love, Loss, and the Fight for Trans EqualityBy Sarah McBride (Foreword by Joe Biden)Although it's devastating to hear all the ways the Trump administration has attacked trans people's rights, there's also plenty of reason to have hope. Activist Sarah McBride is one of those reasons. Image:  St. Martin's PressWhen They Call You a Terrorist: A Black Lives Matter MemoirBy Patrisse Khan-Cullors and Asha Bandele (Foreword by  Angela Davis)This is the story of why Patrisse Khan-Cullors, Alicia Garza, and Opal Tometi co-founded Black Lives Matter, and how the original hashtag #BlackLivesMatter turned into the movement we know today. Image:  Random House Children's BooksBeing Jazz: My Life as a (Transgender) TeenBy Jazz JenningsWhether you've seen her on YouTube or her TLC reality show, I Am Jazz, chances are, you've heard of teen activist Jazz Jennings. She is one of the youngest voices advocating for transgender equality. In this book, you'll learn about her personal and very public journeys. Image:   Random House Publishing GroupMy Life on the RoadBy Gloria SteinemGloria Steinem does it all. She's a writer, speaker, and an activist for women's rights. She also co-founded New York magazine and Ms. magazine, and she currently serves as an advisor to TIME'S UP. As the title suggests, her book explores critical moments on the road that shaped her life and the women's liberation movement.Image:  Little,  Brown and CompanyI Am Malala: The Girl Who Stood Up for Education and Was Shot by the Taliban Malala Yousafzai, with Christina Lamb Malala Yousafzai has fearlessly advocated for girls' education for years, even after she was shot by the Taliban. Read her story and you'll understand why she became the youngest person to win the Nobel Peace Prize."}