{"id": "MashableElon Musk celebrates The Boring Company's L.A. tunnel completion with a video", "paragraph": "There's light at both ends of The Boring Company's first tunnel.Elon Musk celebrated his tunneling company's success on Friday night as a key phase in one of two ongoing Los Angeles projects came to an end. Just before 8:00 p.m. PT, Musk shared a video of a mammoth boring machine breaking through an opening to mark the end of the company's Hawthorne tunnel.pic.twitter.com/TQhb9hQRxQ— Elon Musk (@elonmusk) November 17, 2018Congratulations @BoringCompany on completing the LA/Hawthorne tunnel! Cutting edge technology! pic.twitter.com/80WbSQekCQ— Elon Musk (@elonmusk) November 17, 2018SEE ALSO: Elon Musk's 'Teslaquila' isn't meshing with Mexico's tequila industryWork on The Boring Company's first \"Hawthorne test tunnel\" began in mid-2017. It runs the SpaceX headquarters (another Musk-founded company) and follows Hawthorne's 120th St. for about two miles.An opening ceremony is planned for Dec. 10, at which point the public will be able to check out the tunnel for the first time. It's worth noting that The Boring Company's website describes the soon-to-be-completed bit that will open on Dec. 10 as only the \"first section\" of what will presumably be a longer Hawthorne tunnel.There are other projects in development as well. Also in L.A. is the \"Dugout Loop,\" which will give the residents of Los Felix, East Hollywood, and Rampart Village easier access to Dodger Stadium. Outside of California, The Boring Company is also working on a \"Chicago Express Loop\" for easier access to the city's O'Hare Airport and an \"East Coast Loop\" that will connect Washington, D.C. and Maryland.The Hawthorne tunnel is the smallest of those projects, and can accurately be characterized as The Boring Company's proof-of-concept tunnel. Still, with the Dec. 10 opening now less than a month away, opening up the other end of the tunnel — which workers have been sealing off behind the boring machine — is a major step forward."}