{"id": "MashableHow 'Halloween' uses side-splitting humor to give its victims a pulse", "paragraph": "\"I've got peanut butter on my penis.\" That's an actual line from the new Halloween—and it is as amazing in context as it is out of context. The latest addition to the Halloween franchise has been praised for revitalizing the horror of Michael Myers, cleverly throwing back to John Carpenter's original masterpiece, and giving the franchise's most infamous victim the conclusion she deserves. One of the lesser discussed assets of 2018's Halloween (although Mashable's Angie Han nailed it weeks ago) is the uproariously funny gaggle of prey Michael slays before his final face-off with Laurie Strode. The slasher victims' deaths aren't particularly chuckle-worthy, but the short vignettes they star in leading up to Myers' horrifying appearances are memorably hilarious. SEE ALSO: The best gifts for your horror movie loving friendFrom a yo-yo-loving dad to the most endearing babysitter and kid pairing ever, each victim of Halloween brings personality and depth to the 40-year-old backdrop of Haddonfield, Illinois in a way that makes the story not only more sympathetic, but also vastly more compelling. Filling horror films with hauntingly hysterical victims isn't exactly a novel approach to the genre. Shaun of the Dead and The Cabin in the Woods are just two of many movies that have done it well. But Halloween's comical casualties are so timely and endearing that we can't help but honor this particular take on the trope.In memory of those lost to the 11th bout of Myers killings, here is a look back at some of the most memorable victims of 2018's Halloween. (Excluding the Strode women—they deserve a retrospective that is all their own.)Number one: I love a good podcast drag. Number two: The dynamic of these two \"investigative journalists\" is so Sarah Koenig meets Piers Morgan, it had me gasping for air between laughs.You shouldn't taunt a notorious serial killer—even if it's for your podcast.The true crime world is a pretty easy one to mock—if only because it can be so melodramatic and self-important. (Notably, it isn't always that way. Shout out to My Favorite Murder.) The characters of Dana Haines and Aaron Korey embody this reality in all the right ways. First, Aaron assumes shouting at Michael Myers, an infamously mute villain, will finally get him to talk. (Subtle.) Then, in an obvious breach of journalistic ethics, Dana pays Laurie, a victim of a horrifying crime, $3,000 for a bad interview she does not want to participate in. Finally, the two get slaughtered in a gas station bathroom because they couldn't quite figure out that you shouldn't taunt a notorious serial killer. Even if it's for your podcast.This scene wasn't particularly funny, but it was quirky, charming, and unquestionably the sweetest part of the film. Driving along a backroad in Haddonfield, an unnamed father and son are headed back from a long day of hunting. But they're not discussing deer or rifles. Instead, they focus on the topics of time management and a passion for dance. The young boy explains that his devotion to dance class and becoming a better performer may mean that he has less time to go hunting with his father. The dad seemingly understands the predicament, but is sad to see his son's time becoming divided. The boy lovingly assures him that they can still go hunting \"on weekends.\" It is a precious exchange that turns horribly heartbreaking when they drive up on the scene of a bus crash—one that resulted in the escape of Michael Myers. It's a short vignette, but will stick with those who have a love of family and a soft spot for kids' dreams.Image:  ryan green / universal picturesWho knew the murder of a teenage girl could be packed with so many chuckles?This horrifying sequence begins with a stunning string of zingers between Vicky, a laid-back babysitter, and Julian, her favorite ward. The two talk marijuana and browser history in an exchange that can only be described as mutual blackmail. Vicky ultimately quips that Julian is now one of her least favorite kids to babysit for.While that insult could be seen as mean-spirited when directed at such a young kid, it turns unbelievably sweet when Vicky assures Julian that he is in fact her favorite. She wishes him goodnight and he drifts off to sleep. Then, Michael Myers shows up. Vicky is brutally murdered, but Julian manages an escape. Sadly, that means we'll never get the incredible buddy comedy spinoff these two could have nailed. At least we enjoyed it while it lasted.SEE ALSO: Let's talk about that last-minute twist in the end credits of 'Halloween'Okay, we shouldn't be sad only because this kid reminded us a lot of Riverdale's Jughead, played by Cole Sprouse. But it's totally okay for it to add to our grief. Vicky's boyfriend, Dave, is present at the time of her killing. Prior to Michael's arrival, he flirts with Vicky, alludes to a tattoo he got to honor Halloween, and, while dressed as a farmer, names his adorable toy horse. Overall, he seems like a bit of an asshole, but the kind you'd date for a while. (He's especially dateable considering the actor who plays him, Miles Robbins, is the son of Tim Robbins and Susan Sarandon. Who doesn't want to be in that family?)Ultimately, Dave tries to take on Michael Myers in a battle of the butcher knives and loses big. In an homage to the original 1978 take, Dave is tacked to the wall via knife to the head. His tattoo is revealed to read \"10-31-18.\" RIP Dave and his silly tattoo. Image:  ryan green / universal picturesI like my coworkers a lot. (Hello to the editor reading this piece!) However, it would take a pretty special circumstance for me to bring them a customized lunch unasked.Officer Richards and Officer Francis are your typical squad car duo. The two sit side by side guarding the Strode house and aimlessly passing the time like old pals. In a delightful bit of banter, Richards reveals that he has had a novel \"peanut butter and jelly banh mi\" sandwich made for his picky eater of a partner. Francis refuses the offer saying he brought a brownie for lunch. It is adorable and still gives me the giggles.Unfortunately, Richards is later found with a scalpel-like blade jutting out of his head and Francis's severed cranium is gutted and carved like a pumpkin. (That second part, by the way, seems like it would have taken more time and skill than Michael had at his disposal? Not sure how to do that fact-check though...) Our crime-fighting buddies biting the big one is pretty unfortunate. But maybe it'll make you nicer to the people you work with?Any man who can say, \"I got peanut butter on my penis\" with a straight face is a man worth saving. The men of the Strode family don't play a big role in this heroine-centric drama. But Ray, Karen's husband and Allyson's dad, does make a few shining appearances. No amount of peanut butter on your penis can save you from certain death.First introduced saying the aforementioned peanut butter line (he drops peanut butter on his pants and chooses to phrase it this way, motive unknown), Ray tags along as Karen's plus one through the film's sinister developments, occasionally tossing in a bizarre quip. When Ray joins Karen at her mother's bunker where they are set to hide out from Michael, he cheerfully hangs out in the background and at one point does tricks with a yo-yo. But then he decides to offer coffee to the police officers stationed outside the house and things go... south. Michael quickly strangles Ray and leaves him dead on the lawn, heralding the beginning of the film's finale standoff. Ray's story arc highlights two major things. First, too many people don't take Laurie seriously enough until it's too late. Second, no amount of peanut butter on your penis can save you from certain death.Lots of horror movies can make you laugh unintentionally. (Night of the Lepus comes to mind.) But the writers of Halloween knew exactly what they were doing when they packed their fright fest with comedy. In an interview with Vulture, cowriter Danny McBride was asked about how the new take modernized the Strode heroines. McBride's response aptly emphasized the ways in which ensemble comedy can enhance stories of any genre. \"... In a horror movie it makes the stakes way better, because you’re seeing someone that you identify with or you admire or you like or there’s something about them that makes you root for them,\" he said. \"It’s just finding an angle on these characters that’s going to make the audience identify with them and want them to get through the night alive.\"With this generous application of comedy in mind, horror-averse moviegoers should still consider seeing Halloween. Even if you're not in it for the screams, you should be in it for the laughs—they lurk behind every corner. "}