{"id": "MashableAmy Schumer supports protesting NFL players by saying no to Super Bowl ads", "paragraph": "The Super Bowl is the biggest night of the year for two things: Pro football and very expensive commercials. Amy Schumer has decided to use one to influence the other.Her concern stems from ongoing protest actions in which certain players kneel, raises fists, or stand together united during pre-game National Anthem performances. They're doing it to take a stand against police brutality and racial inequality in America — sticking to the message of exiled NFL quarterback Colin Kaepernick.SEE ALSO: Nike makes Colin Kaepernick one of the faces of its 'Just Do It' campaignSchumer isn't involved in football, but she does acknowledge that there's one place she can push back: Super Bowl ads. She's not doing them this year. She also urges Maroon 5 — the next Super Bowl's halftime band — to drop out.It should be noted here that Schumer's post is in many way a response to a report that Rihanna had been offered the headlining halftime show gig, but she said no because she supports Kaepernick.     \n\n\n\n\n  View this post on Instagram\n\n \n   \n\n  \n\n   \n\n Friday thought. I wonder why more white players aren’t kneeling. Once you witness the truly deep inequality and endless racism people of color face in our country, not to mention the police brutality and murders. Why not kneel next to your brothers? Otherwise how are you not complicit? I think it would be cool if @maroon5 backed out of super bowl like @badgalriri Did. I personally told my reps I wouldn’t do a Super Bowl commercial this year. I know it must sound like a privilege ass sacrifice but it’s all i got. Hitting the nfl with the advertisers is the only way to really hurt them. I know opposing the nfl is like opposing the nra. Very tough, but don’t you want to be proud of how you’re living? Stand up for your brothers and sisters of color. And the hottest thing a guy can do is get down on one knee. Not to propose but to reject the treatment of his teammates by this country. Anyone who says its disrespectful to our military please read up on the fact that a lot of veterans are proud of what @kaepernick7 is doing and fully support him. What are your thoughts?A post shared by @ amyschumer on Oct 19, 2018 at 8:11am PDTSchumer acknowledges that her own act of protest isn't exactly going to turn things around on its own. After noting that she's already told her team to turn down any Super Bowl commercial offers, she accepts that her words \"must sound like a privilege ass sacrifice.\" Then she adds, \"but it's all I got.\"Pricey Super Bowl advertisements — they cost multiple millions for just 30 seconds of airtime —  have long been positioned as another valid reason to watch pro football's post-season championship game. Brands pull out all the stops for these ads, which are often the subject of round-ups and critiques the next day.Some of Schumer's critics have pointed out that, as far as anyone knows, she wasn't booked for any Super Bowl ads. So, they contend, this whole thing is just a play for attention. It doesn't change anything. Those people are missing the point. Schumer seems to be hoping that, by following Rihanna's (reported) lead, she'll encourage others to make a similar decision of saying no up front, before an offer surfaces. She openly exhorts Maroon 5 to bow out of the halftime show, and there's a strong suggestion that other concerned celebrity-types might want to follow Schumer's lead.She's not wrong about the advertising. Ad dollars mean a lot to any pro sports league, and the Super Bowl — historically ground zero for preposterously pricey commercials — is the NFL's biggest night. Celebrity involvement often plays a big role in that regard, so convincing other big names to steer clear is its own form of protest.The NFL continues to engage with the player protest side of the issue by not engaging at all. There was a brief period before the current season started when the league weighed a ban on all public forms of protest in connection to weekly games. That wasn't received so well, and the league ultimately stepped back from its decision.Still, some interests inside the league have imposed anti-protest rules at the club level. The most public of those is Jerry Jones, the deeply conservative Dallas Cowboys owner. He's made it clear to the team — by his own admission — that players who ignore the team's rule requiring everyone to be present and stand for the National Anthem are at risk of being cut."}