{"id": "MashableWatch Michelle Obama's eyebrows as she reveals that Melania Trump ignored her offer for advice", "paragraph": "The complicated relationship between former First Lady Michelle Obama and current First Lady Melania Trump got another wrinkle on Monday.Michelle Obama, during an interview with ABC to promote her upcoming memoir Becoming, talked about how Laura Bush had reached out to her before she became First Lady in 2008. Michelle extended the same offer to Melania after Donald Trump was elected, but when asked by Robin Roberts if Melania had accepted, Michelle replied only, \"No, no she hasn't.\".@MichelleObama tells @RobinRoberts @FLOTUS Melania Trump has never reached out for advice. #MichelleObama #Michellehttps://t.co/GG1GiLxNVX pic.twitter.com/FLC42eG1Oj— Good Morning America (@GMA) November 12, 2018Obama's little eyebrow raise at the end says all you need to know about the way the rest of that story goes. Of course, Michelle is remembered for the legendary side-eye she delivered at Trump's inauguration, and she admits in Becoming that, on that dreary day, \"I made my own optic adjustment. I stopped even trying to smile.\"  “I stopped even trying to smile,” @MichelleObama shares what she was feeling during President Trump’s 2017 Presidential Inauguration. #MichelleObama #Michellehttps://t.co/GG1GiLxNVX pic.twitter.com/iBq38HR5hv— Good Morning America (@GMA) November 12, 2018This pairs well with the other tidbit about the Trump-Obama beef that we already knew: That Michelle has understandably said she'd \"never forgive\" Donald Trump for his role in spreading and weaponizing his birther conspiracy theory against her husband.The one remaining thing we need to learn is Michelle's thoughts on that time Melania straight-up plagiarized one of her speeches during the 2016 Republican National Convention. (And that was not even the only time Melania has ripped off an Obama production.)This feud could really beat any beef that Drake is a part of."}