{"id": "MashableThe Polk Command Bar levels up your TV experience with Alexa and better audioRelated reviewsRelated reviews", "paragraph": "We're in the golden age of soundbars. It's a world flush with affordable, high-quality speakers for your TV that don't require putting different kinds of speakers all over your room, with multiple diagrams and sync options to ensure everything is just so. The soundbar is a gift for people who want to hear, and feel, their entertainment without the hassle of multiple wires.The soundbar world is on the brink of a big change, though: the integration of digital assistants. The Polk Command Bar is one of the first of the breed, a soundbar with Amazon Alexa built int. At $299, it's one of the most affordable options out there, and it's worth your hard-earned currency — if you've bought into the Alexa ecosystem, that is.SEE ALSO: Echo vs. Echo Dot: What's the difference?The Polk Command Bar starts off as an unwieldy, albeit cleverly designed, package. The shipping box itself is shaped like a guitar case or a saxophone, with the soundbar providing the length while the subwoofer is in the compartment atop the soundbar. There's a handle for easier transport.Unpacking is easy enough. Take the subwoofer out, slide the soundbar away from the box, and collect the various plugs and cables to begin setting up your new audio system.The Command Bar easily connects to your TV. Plug it into power, connect the HDMI cable from the HDMI port on your Command Bar to your TV, and you're all done. Polk provides an optical cable if you happen to have a non-ARC HDMI input. For the subwoofer, all you have to do is plug it in and it'll automatically wirelessly sync up with the Command Bar.You can find two HDMI inputs in the back of the Command Bar along with a dedicated port for the Amazon Fire Stick, plus a USB port. You can switch between inputs using the remote or your voice once you connect everything to the Command Bar’s HDMI ports. There's also built-in Bluetooth if you want to use your phone to stream music.The subwoofer is deceptively large and round, so it won't fit elegantly on the shelf. But, you can hide it away in a corner easily enough. If you care about looks, the Command Bar is not as sleek as the Sonos Beam. It's heftier (it weighs just under 5 pounds), and it measures about 43 inches long. At two inches tall, the Command Bar fits discreetly underneath your TV. Alternatively, you can mount the soundbar to the wall.Within the plastic and fabric housing are two three-inch drivers located near the center of the Command Bar and two one-inch tweeters located on opposite sides. You also get Dolby/DTS surround sound decoding that supplies the \"theater\" in home theater.With all of that out of the way, it was time to watch a movie.Right away, I could tell I was having an improved television experience from the built-in speakers of my TV. I could hear and feel the bass rattling the floor. Out of the box, the sound itself felt richer.Polk provides many ways to customize your experience. You can pump up or turn down the bass depending on your preference. There's also a handy way to increase vocal clarity.If you're not inclined to tinker with audio settings, there are four preset modes. Night mode lowers the bass and increases the vocal clarity so you don't disturb neighbors or sleeping kids with late-night binges. Sport mode highlights vocal clarity and crowd sounds. Movie mode offers a dynamic mix that highlights bass and the soundtrack. Music mode adds some fullness to your tunes.As with all things nowadays, there's also a Polk Command app. It's... there. It exists to connect your Command Bar with your WiFi. After that, it'll just take up room on your phone. There are some helpful reminders and a few settings for changing your Amazon and Alexa settings, but that's all there is to this app. All of the firmware updates are automatically downloaded to the Command Bar.I soon settled in with the Command Bar, using it for a binge session, some disappointing football results, and a few movies for good measure. There's been a big difference in the sound compared to what was coming out of the TV. I wasn't straining to hear the dialogue on some of the quieter shows I've watched. Movies sound fuller and sports sounded lively. The Command Bar also checks the box when it came to music.Surround sound wasn't the best. Did I ever feel like an onscreen plane was flying overhead, or someone was sneaking up on me from behind? Not really, but the Command Bar is definitely an upgrade from my TV's speakers even if it's not delivering a truly immersive experience in my dream surround sound scenario.I appreciate more than enjoy bass, so it's usually the first thing I fiddle with. The subwoofer adds a hefty thump to proceedings, but it can feel gratuitous at times. However that can be remedied with a simple press of a button.Best of all, though, you can use your voice to ask Alexa to raise the volume, drop the bass, or tell you the day's weather.Amazon's voice assistant is what separates the Command Bar from the pack, with Alexa's distinctive light ring located in the center of the soundbar. Polk eschews subtlety for functionality, essentially plopping an Echo Dot into this speaker. And, guess what. It works.Alexa functionality is well-integrated into the Command Bar. You can ask her a whole range of questions, and she responds as you would expect. When you ask Alexa something, your program is momentarily muted, so maybe wait until a commercial or a break in the action.However, pretty much everything you would normally do with Alexa works here. Turning on lights or playing your Spotify playlist can all be accomplished with ease. I never experienced a moment where the Command Bar and Alexa didn't hear me.There are times when the remote works better than asking Alexa to do it for you. If you don’t want to distract from the viewing experience, a quick volume or vocal clarity adjustment is just a button away.The Polk Command Bar doesn't support every Alexa feature just yet. The Drop In intercom feature, multi-room music playback, using an alternative wake word, messaging, and custom alarm sounds are a few Alexa features that aren't yet supported by the Command Bar. Polk says it is working closely with Amazon and all features will be automatically downloaded to the Command Bar when they're available. If you’re a smart home enthusiast, the Command Bar should have you covered. The soundbar is compatible with Philips Hue lighting, Samsung SmartThings, WeMo plugs, Amazon connected devices, and Ecobee devices. The Polk Command Bar offers up some useful guidance for using Alexa.Image:  Charles Poladian/MashableIf you have a smart home and want to make it smarter, the Command Bar may be a great hub to  lock the doors, dim the light, load up the old Fire Stick, and start watching Netflix. If you don't have all of that and want to check the weather or see if there are any delays on your morning commute, you can do that, too. There's a lot to enjoy about the Command Bar in its current state and you can definitely see a scenario where Polk's soundbar continues to get smarter with frequent updates. So, the sound is pretty solid and Alexa works. However, there's a Sonos-sized elephant that needs to be addressed.While I don't own a Sonos Beam, the reviews have been overwhelmingly positive from users and reviewers, which is what you would expect from a respected player like Sonos. The Beam has a few more bells and whistles than the Command Bar, including a calibration system within the Sonos app.\"For watching TV, the Beam is a huge improvement over the wimpy speakers built into my skinny flat screen,\" our own Raymond Wong wrote in his review of the Sonos Beam. However, the Beam also retails for $399. At $299 (and at a recent sale price of $250), the Polk Command Bar is the more affordable option for Alexa-enabled sound.If you haven't already bought into the Sonos brand and can do without a couple of extras, the Polk Command Bar delivers a clear improvement from your TV’s speakers, and the Alexa integration is just as good. That’s not bad for $299 and certainly sounds even better at $249.99.\nEvery product here is independently selected by Mashable journalists. If you buy something featured, we may earn an affiliate commission which helps support \nour work.\n"}