{"id": "Gubernatorial candidates make final pitches to voters", "paragraph": "\n              Democrat Ned Lamont, center, answers a question as he and the other two leading candidates for Connecticut Governor; petitioning candidate Oz Griebel, left, and Republican Bob Stefanowski face off in their final gubernatorial debate one week before the election Tuesday, Oct. 30, 2018 at at the Premier Ballroom at Foxwoods in Ledyard, Conn. (Sean D. Elliot/The Day via AP)\n            MASHANTUCKET, Conn. (AP) — The three major candidates for Connecticut governor gave their closing arguments to the voters Tuesday in what has become a tight race.While Republican businessman Bob Stefanowski doubled-down on his call to reduce or phase out state taxes to jump start the economy, Democratic businessman reminded voters that he would “fight for Connecticut values, not Trump values,” referring to the GOP president.Meanwhile, petitioning independent candidate Oz Greibel repeated his call for voters to reject the “duopoly” of the two-party system and vote for a team that will provide “real leadership” for a state facing massive fiscal challenges.Tuesday’s debate at Foxwoods Resort Casino, sponsored by the Connecticut Conference of Municipalities, the Hartford Courant and WTNH-News 8, marked the final matchup before Election Day. It comes as a new Quinnipiac University Poll shows the race between Lamont and Stefanowski is very close.Here are some new issues the candidates addressed:___GUNS AND POLICE RELATIONSA question about how to improve police and community relations in Connecticut’s cities evolved into a debate over guns, school safety and leadership in the wake of tragedies like the deadly synagogue shooting in Pittsburgh and the Newtown school shooting.“We’ve got to do everything we can in terms of protecting our real serious gun laws coming after Sandy Hook. Bob has talked about taking them back, revoking them. That’s the exact wrong thing to do,” said Lamont, who has stepped up such accusations against Stefanowski, who has received an A-rating from the NRA.While Stefanowski ignored the accusation during the debate, he reiterated to reporters afterward there that was “no chance” a repeal bill would reach the governor’s desk. He repeated his calls to step up security in Connecticut’s schools and his criticism of a prisoner release program.Griebel, meanwhile, argued that setting an example of tolerance for the rest of the state is critical to addressing violence, racial issues and acts of violence, adding how “it’s more than just guns.”___VOTING RECORDIt took a question about early voting for Stefanowski’s lack of voting to come up.Asked if they supported legislation that would allow Connecticut voters to cast their ballots before Election Day, all three either supported the idea or agreed to consider it.“Anything to increase the participation rate would be good,” said Stefanowski, who did not vote for 16 years, including in the 2016 presidential election.That prompted Griebel to quip: “Well, I’m glad Bob feels strongly about voting given his track record.”Lamont voiced concern that he’s heard complaints from people around the state who don’t believe their vote makes a difference. He said he wants to “get this negative tone out of the body politic,” give people something to believe in and convince them how their vote matters.“If the election of Donald Trump doesn’t remind you, elections make a difference,” he said.___DEATH WITH DIGNITYTaxes, jobs and the state’s economy have dominated the gubernatorial debates so far. For the first time, the three candidates were asked whether they’d sign legislation that that would allow people with less than six months to live to obtain a prescription allowing them to end their lives.Both Lamont and Stefanowski appeared open to the idea, speaking about the recent deaths of their parents.“I loved them to death. I was with them every chance I could. But I think they knew when they were ready to go,” said Lamont, who said he’d consider such legislation, including legal safeguards. “It’s an intensely personal decision that each and every family has to do.”Stefanowski spoke of his mother who recently died after suffering for two years from dementia.“I talked to my dad about it and he said, ‘for better or for worse, I want your mother home,’” Stefanowski said. “I would tend to leave it up to the family, I think it’s a very personal decision that each family should make.”Greibel said he didn’t disagree with his rivals, saying he’d want to understand the legal safeguards.“But the concept of letting individuals rather than the government make decisions,” he said, “I’m fairly supportive of that concept.”"}