{"id": "‘Super coral’ scientist dies in Hawaii at age 56", "paragraph": "\n              In this Sept. 28, 2015 file photo, Hawaii Institute of Marine Biology director Ruth Gates talks about her project to create \"super coral\" near her lab on Coconut Island in Kaneohe, Hawaii. Gates, who dedicated much of her career to saving the world's fragile and deteriorating coral reefs, has died at age 56. The University of Hawaii, where Gates was the director of the Hawaii Institute of Marine Biology, said Tuesday, Oct. 30, 2018, that the researcher died in Honolulu on Thursday, Oct. 25, 2018.  (AP Photo/Caleb Jones, File)\n            HONOLULU (AP) — Pioneering coral reef scientist Ruth Gates, who dedicated much of her career to saving the world’s fragile and deteriorating underwater reef ecosystems, has died. She was 56.Gates died in Honolulu on Thursday, the University of Hawaii said Tuesday. The researcher, also the president of the International Society for Reef Studies, was diagnosed with brain cancer in May and had been on medical leave since.Gates became known globally for her idea to speed up coral evolution and create more resilient reefs.The Associated Press first wrote about her project to breed ”super coral ” in 2015. Her goal was to develop coral that could withstand the devastating effects of climate change. Her work was featured in the 2017 Netflix documentary “Chasing Coral.”Warmer ocean temperatures can cause corals to go through a process known as bleaching, where the animals become weak and sick. Repeated bleaching events can lead to coral death and the loss of entire reef ecosystems.Gates’ colleague and partner in the assisted evolution project, professor Madeleine van Oppen of the Australian Institute of Marine Science, said Gates was “a great inspiration” to many.“She was intelligent, professional and had a wonderful sense of humour,” Van Oppen told the AP in an email. “She was a great ambassador for the reef and a role model for women in coral reef science.”Van Oppen said it’s a shame she will not be able to see the long-term impacts of their research. “But I will work extra hard to try and make it a success in her honour,” she said.Gates was known for her innovative science, but she was also widely admired for her welcoming, energetic and cheerful personality.“Ruth was not only a shining star in coral research, but an indomitable spirit in every aspect of life,” said Judy Lemus, interim director the Hawaii Institute of Marine Biology and friend of Gates. “Her enthusiasm was contagious, and she absolutely loved what she did. Her loss will be felt deeply within our own community and throughout the broader research community.”Mark Eakin, coordinator of the National Oceanic and Atmospheric Administration’s Coral Reef Watch program, said Gates’ death is a loss for the entire scientific community.“Ruth was really a force of nature, I mean she was just an amazingly productive scientist, one of the brightest, most inquisitive minds that we had in the whole field of coral reef science. Her energy was boundless,” Eakin said in a phone interview.Gates faced a “whole suite of criticisms” over her plan to breed stronger corals, but “rather than dismissing those criticisms, she would embrace them” Eakin said. “She is the kind of great leader who has trained so many and left a legacy of students who will be able to pick up and continue this work.”Mariana Rocha de Souza, a doctoral student in Gates’ lab, said in an email to the AP that her mentor was an advocate for women in science.“We are a very gender balanced lab and she encouraged us as PhD students to do the same when selecting the professors in our committee. She motivated us, women in science by telling her experience and encouraging us to fight,” Rocha de Souza said.Gates’ research won the support of philanthropist and Microsoft co-founder Paul Allen, allowing her to expand, develop and test her theories in a lab on Oahu’s Coconut Island.“Ruth Gates realized before most others that for corals to survive climate change, their adaptation to warming waters will have to be assisted,” said Lauren Kickham, director of product management at Paul G. Allen Philanthropies. “She believed in their resilience and ultimately offered hope for the future.” Allen, 65, died Oct. 15 from complications of non-Hodgkin’s lymphoma.Gates was born in Akrotiri, Cyprus, in 1962 and is survived by her wife, Robin Burton-Gates, and her brother, Tim Gates.___Follow AP Hawaii Correspondent on Twitter: https://twitter.com/CalebAP___This story has been corrected to show the release date of the documentary “Chasing Coral” was 2017, not 2018."}