{"id": "Analysis: Hood’s downcast pitch clashes with sunny GOP take", "paragraph": "JACKSON, Miss. (AP) — At times, it seemed like the politicians addressing the Mississippi Economic Council last Thursday were mainly there to boost or oppose Republican Cindy Hyde-Smith’s bid to retain the U.S. Senate seat to which Gov. Phil Bryant appointed her.Lt. Gov Tate Reeves even made it explicit, saying he wasn’t going to talk about the 2019 state elections, which relieved him of affirming that he would indeed run for governor.“The most important elections to the future of Mississippi’s economy are the ones taking place next Tuesday,” Reeves told attendees at the council’s Hobnob event at the Mississippi Coliseum.But Attorney General Jim Hood, the Democrat who seeks to deny Reeves’ ascension to the governor’s chair, didn’t get the memo. Hood made the case that members of the state’s chamber of commerce should consider supporting him. The organization has stuck close to Reeves, with MEC President Scott Waller praising him Thursday for delivering a signature goal of the group, a phase-out of Mississippi’s franchise tax on business capital.It was an unusually animated speech for Hood, and at times sounded as if it came from an alternate universe rather than the one occupied by the state’s Republican leaders.“They’re going to tell you how great things are, but let me tell you the truth about what our economy is,” Hood said. “Mississippi has the worst economy of any state in the union.”He also argued that the special session earlier this year that ended in a deal for more money for roads was “smoke and mirrors” in part because it didn’t produce as much money as was needed to cover the needs of the state highway system. Hood also criticized Mississippi’s refusal to expand Medicaid, arguing that’s the root cause of rural hospital struggles.This is the challenge that Democrats have. Has growth been poky for years in Mississippi coming out the recession? Yes, and it still is, compared to the rest of the nation. But it would have been an easier case to make in 2014 or 2015, when the state’s economy slid back into recession while the rest of the nation was growing. It would have also been easier in 2016 and 2017, when Gov. Phil Bryant was making mid-year budget cuts or lawmakers were whacking the budgets of state agencies.Since then, things have gotten better, both in terms of the economy and state tax receipts. Average weekly wages in the first quarter of 2018 were up about 2 percent, while the state’s economy has added 20,000 jobs this year.“I guess the lowest unemployment in Mississippi’s history just doesn’t matter,” said Bryant, clearly mocking Hood. “Tell that to the 77,000 Mississippians who have a job now that didn’t have a job in 2011.”Bryant, taking offense at Hood’s downcast assessment of his two terms in office, threatened to take to the campaign trail to “strip some bark. I’m not going to stand by and let any politician criticize what we have accomplished.”Reeves, for his part, didn’t keep his promise to not talk about 2019. After praising educational improvement and the road funding deal, he offered a preview.“I look forward to talking about our vision for the future of Mississippi — a vision that includes a balanced budget, a vision that includes less debt on the books, a vision that includes fewer taxes,” he said.Hood will have to overcome that pitch, plus Republican affirmations that things are getting better. But maybe Hood is more aware of this challenge than he lets on. After all, at one point during Thursday’s speech, he said: “Leadership is about telling people something maybe they don’t want to hear.”___Jeff Amy has covered politics and government for The Associated Press in Mississippi since 2011. Follow him on Twitter at http://twitter.com/jeffamy ."}