{"id": "Johnson, pass rush positive signs from Arizona’s loss at KC", "paragraph": "\n              Arizona Cardinals running back David Johnson (31) scores a touchdown past Kansas City Chiefs defensive lineman Derrick Nnadi (91) during the second half of an NFL football game in Kansas City, Mo., Sunday, Nov. 11, 2018. (AP Photo/Ed Zurga)\n            TEMPE, Ariz. (AP) — Although the Arizona Cardinals went down to their seventh defeat of the season, there were positive aspects to their 26-14 loss at Kansas City.David Johnson broke loose for his best game of the year and the Cardinals defense harassed Chiefs quarterback Patrick Mahomes better than anyone has all season.Johnson, who had been bottled up through the first half of the season as part of the worst-ranked offense in the NFL, accumulated 183 yards from scrimmage — 98 yards rushing (in 21 carries) and 85 yards receiving (on seven catches).Johnson scored both of Arizona’s touchdowns, on a nine-yard pass from Josh Rosen and a one-yard run.“It felt good,” Johnson said after the game. “Like I was saying, it made me feel like it was back to ... the 2016 offense. We got some momentum going as an offense running the ball. We got some good confidence going as well.”It was the second game for Arizona with Byron Leftwich as offensive coordinator.“I thought it was a great game plan by the offensive coaches,” coach Steve Wilks said in his weekly Monday news conference. “I thought Byron did a tremendous job calling the game and getting into the flow and rhythm of the game. As we all have seen — and you guys have been here before myself — what David is capable of doing. We saw that with some hard runs inside the tackles and did some good things getting outside as well as in the pass game. I thought Byron did a tremendous job in just really trying to get him the ball.”Johnson has topped 100 yards from scrimmage in each of the past two games after failing to do so in the first seven of the season.“It means that we are moving in the right direction,” Wilks said. “It means that we’re evolving on the offensive side of the ball. We came into this game talking about trying to steal some possessions and trying to keep those guys off the field. We did that by sustaining drives — a 14-play drive and starting the third quarter with a 13-play drive, and they both ending in touchdowns. Where we came up short was the consistency after that, not being able to get back into the end zone.”Arizona used up 6:01 in its first touchdown drive and 7:12 in the second.The Cardinals had the ball down 26-20 and Rosen’s 23-yard pass to Johnson put the ball on the Arizona 40 early in the fourth quarter. But Rosen’s screen pass, intended for Johnson, was intercepted by Justin Houston at the Cardinals 35. That led to a Kansas City touchdown. After that, Rosen was battered behind some shaky pass protection as Arizona was forced to mainly abandon the run.On defense, poor play in the Arizona secondary led to a quick Kansas City touchdown on the game’s first possession. But the Cardinals were tough after that, sacking Mahomes five times — two by Chandler Jones. Mahomes had never been sacked more than twice in a game before Sunday.“I thought the D-line did a tremendous job of staying in their rush lanes,” Wilks said. “Coverage-wise, I thought those guys at times when we were able to get to him, he was holding the ball. So, we did a good job complementing one another. Then there were times we just pressured him. It was great to be able to get to him five times. I just wish we could have come up with some takeaways.”The 26 points were a season low for Kansas City.It might have been about as good as the Cardinals could have expected on the road against the Chiefs, who improved to 9-1.“There are no moral victories in this game,” Wilks said. “We went to Kansas City to win a football game, and we came up short. Now, there are a lot of things we can build off to get better. It was very encouraging, some of the things you saw on both sides of the ball, as well as in special teams, and that’s what we are going to continue to try to do.”The Cardinals will find themselves in the unusual position of being favored on Sunday when they host the Oakland Raiders.Notes: Wilks said he hadn’t received the results of an MRI on right guard Justin Pugh’s injured knee.___More AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL"}