{"id": "Backers distance themselves from Iowa GOP Rep. Steve King", "paragraph": "\n              FILE - In this June 8, 2018, file photo, Rep. Steve King, R-Iowa, at a hearing on Capitol Hill in Washington. King is coming under fire ahead of the midterm election as top Republican officials and campaign donors balk at standing with a Republican congressman who regularly espouses extreme views on race and immigration. (AP Photo/J. Scott Applewhite, File)\n            WASHINGTON (AP) — Conservative Rep. Steve King is coming under fire ahead of the midterm election as top Republican officials and campaign donors balk at standing with a Republican congressman who regularly espouses extreme views on race and immigration.King is still favored to win another term representing his rural Iowa district in next week’s election. But in the aftermath of the synagogue shooting in Pittsburgh, the congressman’s latest comments in support of a neo-Nazi party in Europe sparked a strong rebuke Tuesday from the House Republicans’ campaign chairman, Rep. Steve Stivers of Ohio.“Congressman Steve King’s recent comments, actions, and retweets are completely inappropriate,” said Stivers. “We must stand up against white supremacy and hate in all forms, and I strongly condemn this behavior.”The Land O’ Lakes Inc. PAC said Tuesday it “will no longer support Rep. Steve King.” The political action committee, based in neighboring Minnesota, said it wants its contributions “to be a positive force for good” and tries to ensure that “recipients of our contributions uphold our company’s values.”Technology giant Intel Corp. also said it would no longer support King, according to reports.King on Tuesday posted a tweet denouncing the attacks against him as “orchestrated by the nasty, desperate and dishonest fake news. Their ultimate goal is to flip the House and impeach Donald Trump.”The Iowa congressman has long tested the limits of the Republican Party’s tolerance for fringe views, notably his harsh anti-immigration rhetoric. On Saturday, the day of the deadly Pittsburgh shooting, he defended the groups he associated with, including Austria’s Freedom Party, which was founded by former Nazis.“If they were in America pushing the platform that they push, they would be Republicans,” King told The Washington Post.King has represented the Sioux City-area congressional district for eight terms, and was so widely expected to win again that the National Republican Congressional Committee has not been spending any resources on the race.NRCC spokesman Matt Gorman said that after the accumulation of King’s “bigoted words and actions, the time had come for Chairman Stivers to speak out.”A Democratic challenger, former pro baseball player J.D. Scholten, has been pummeling King with ads, and an outside group has been airing one that suggests the congressman is approved by white supremacists, according to Dave Wasserman, an analyst at the Cook Political Report. That election forecaster on Tuesday shifted King’s race slightly toward the Democrat, while reporting it is still “likely” to be won by the Republican.Still, Wasserman tweeted that King’s campaign is “virtually broke” and “with a week left, it’s unclear who’s going to bail him out.”"}