{"id": "Authorities still assessing why California shooter snapped", "paragraph": "THOUSAND OAKS, Calif. (AP) — Investigators are still trying to piece together what led a former Marine to open fire at a Southern California country music bar last week, killing 12 people before fatally shooting himself.Authorities have not publicly shared what motive they think might have led Ian David Long to snap late Wednesday night.“An investigation of this magnitude takes time, and it’s not something that we’re going to piecemeal out along the way,” Ventura County Sheriff’s Sgt. Eric Buschow said Monday. “People are going to have to be patient.”The Borderline Bar and Grill remained roped off with crime tape Monday. People stopped by a nearby memorial for victims, which includes 12 large white crosses with every victim’s name on them.Meanwhile, a federal official briefed on the investigation told The Associated Press that Long, 28, posted to social media at least twice during the shooting. According to the official, who was not authorized to discuss the investigation publicly and spoke to the AP on condition of anonymity, the posts were three minutes apart.The first said that others would guess why he committed the attack, and his answer was: “life is boring so why not?” The second post discussed people judging whether he was sane.Both Facebook and Instagram have scrubbed Long’s accounts from their public platforms.With the Los Angeles suburb of Thousand Oaks still reeling, people who knew Long have described a man whose aggressive outbursts dated back at least a decade.Two coaches on his high school track team have described Long as volatile and intimidating.Neighbors have said they often heard yelling and banging noises coming from the house Long shared with his mother. One ruckus was so extreme that a next-door neighbor called authorities, who assessed Long’s mental health but determined he was not a candidate for involuntary commitment.___Balsamo reported from New York. Justin Pritchard in Los Angeles contributed."}