{"id": "The Latest: Alabama, Clemson, LSU, Notre Dame top CFP", "paragraph": "\n              FILE - In this Jan. 7, 2018 file photo Charley Green buffs the NCAA college football championship trophy before a coaches news conference in Atlanta. The College Football Playoff selection committee begins its fifth season Tuesday, Oct. 30, 2018 of presenting weekly rankings and if form holds two schools in the first top four will go on to play in the semifinals. The usefulness of the committee’s work and the nationally televised reveal is debatable. But what if anything can be learned from the first four years of CFP rankings? Of the 16 teams the committee ranked in the top four of its initial rankings from 2014-17, half made the playoff. (AP Photo/David Goldman, file)\n            GRAPEVINE, Texas (AP) — The Latest on the first College Football Playoff rankings of the season (all times local):6:20 p.m.Alabama, Clemson, LSU and Notre Dame are the top four teams in the first College Football Playoff rankings of the season.The 13-member selection committee released the first of its five weekly top 25s before the four-team field is set for the College Football Playoff semifinals on Dec. 2.Michigan is fifth, followed by Georgia and Oklahoma.The top four teams were no surprise. The same four teams are Nos. 1-4 in the latest Associated Press college football poll, just with Notre Dame third and LSU fourth.Next week’s rankings figure to look a lot different. Four games matching top-20 teams will be played Saturday, including Alabama at LSU.UCF was the highest ranked team from outside the Power Five conferences at 12th.___2:30 a.m.If form holds, two of the top four teams in the first College Football Playoff ranking of the season will go on to play in the national semifinals.After meeting for a day and a half at a hotel outside Dallas, the CFP selection committee will unveil its initial top 25 Tuesday night, the first of the nationally televised weekly revelations until the one that really counts on Dec. 2.Of the 16 teams the committee ranked in the top four of its initial rankings from 2014-17, half made the playoff. Last season, for the first time, three teams (Georgia, Alabama, Clemson) started in the top four and finished there (Clemson was the only team to be somewhere in the top four in all six rankings from the committee).___More AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25"}