{"id": "Latest: Wyo. laws aimed at trespassing activists struck down", "paragraph": "\n              FILE - In this Dec. 8, 2011 file photo, retired Federal District Judge William Downes, left, shakes hands with his replacement District Judge Scott Skavdahl during an investiture ceremony in Casper, Wyo. On Monday, Oct. 30, 2018, Skavdahl ruled that two Wyoming laws that prohibit trespassing to collect environmental data violate the U.S. Constitution's free-speech protections, siding with two environmental groups and a news photographer association. (Tim Kupsick/Star-Tribune via AP, File)\n            CHEYENNE, Wyo. (AP) — The Latest on a judge ruling (all times local):6 p.m.:A spokesman for Wyoming Gov. Matt Mead says state officials will evaluate what if anything they will do next after a judge ruled that two Wyoming laws barring people from trespassing to collect environmental data run afoul of the U.S. Constitution.U.S. District Judge Scott Skavdahl in Casper ruled Monday that the laws violate free-speech rights.The laws are an example of so-called “ag-gag” statutes states have enacted to shield the agriculture industry from monitoring by environmentalists and animal-welfare activists.Wyoming’s laws seek to discourage environmentalists from documenting damage to streams and grasslands because of livestock grazing. Violating one of the two similar laws is punishable by up to a year in jail, double the possible jail time for simple trespassing.Two environmental groups and a photographer’s association sued to contest the laws.The groups praise the ruling.___12:59 p.m.:A judge has ruled that two Wyoming laws barring people from trespassing to collect environmental data run afoul of the U.S. Constitution.U.S. District Judge Scott Skavdahl in Casper ruled Monday that the laws violate free-speech rights.The laws are an example of so-called “ag-gag” statutes states have enacted to shield the agriculture industry from monitoring by environmentalists and animal-welfare activists.Wyoming’s laws seek to discourage environmentalists from documenting damage to streams and grasslands because of livestock grazing. Violating one of the two similar laws is punishable by up to a year in jail, double the possible jail time for simple trespassing.Two environmental groups and a photographer’s association sued to contest the laws.The groups praise the ruling. Wyoming officials didn’t immediately respond to requests for comment."}