{"id": "A week before election, McSally focuses on border security", "paragraph": "\n              A photograph of Corine Turner, who was murdered by an immigrant living in the United States illegally, is displayed as Carrie Utz speaks, Tuesday, Oct. 30, 2018, in Mesa, Ariz. Utz was speaking at a news conference held by U.S. Rep. Martha McSally, R-Ariz., who is running for the U.S. Senate. McSally was drawing attention to \"angel families\",  people who lost loved ones at the hands of immigrants living the the United States illegally. (AP Photo/Matt York)\n            MESA, Ariz. (AP) — Senate candidate Martha McSally hammered down on her promises to strengthen border security and crack down on immigrants who commit crimes as she faces criticism over her position on health coverage for people with pre-existing conditions.With a week until Election Day, McSally held a news conference Tuesday in Mesa to publicize her endorsements from three members of “angel families” — people who lost loved ones at the hands of immigrants living in the United States illegally.She also said the caravan of Central American migrants in Mexico headed to the United States is awakening Americans to the dangers at the border. “This caravan just shows the insanity of the border crisis that’s happening everyday single day here in Arizona,” McSally said.McSally, a Republican, faces Democrat Kyrsten Sinema in the race to succeed retiring U.S. Sen. Jeff Flake. McSally has recently been accused of using the migrant caravan to divert attention away from her views on coverage for people with pre-existing conditions.“What are you talking about?” McSally said of the criticism. “Every single day, everywhere I go, people are asking me about the caravan. Every single day, they are asking about what we are doing to secure our border.”The Sinema campaign released a statement saying Sinema has a strong record on border security, including supporting an increase in the penalties on immigrant smugglers and helping get more customs officers at Arizona’s ports of entry.Despite McSally’s current claims that she supports coverage for people with pre-existing conditions, her vote to repeal the Affordable Care Act did in fact weaken protections for people with pre-existing conditions. The bill would have let states permit insurers to charge people with pre-existing conditions more for health insurance. It narrowly passed the House on a party-line vote but was never voted on in the Senate.McSally has shifted to the right on immigration, helping draft a bill last year that would have sharply cut legal immigration. She also signed onto another bill that would have let young immigrants known as “Dreamers” to stay in the country, but was loaded with so many new regulations on them and other limits on immigration that the Dreamers themselves, all Democrats — including Sinema — and many Republicans opposed it.Steve Ronnebeck, whose 21-year-old son Grant was fatally shot in 2015 at a convenience store in Mesa by a man who was in the country illegally, said he was endorsing McSally because the migrants in the caravan shouldn’t be allowed to cross into the United States.Authorities say Ronnebeck’s son, who was working as a clerk at the store, was killed by Apolinar Altamirano, a 33-year-old Mexican man who was in the United States illegally and is awaiting trial on a murder charge in Grant Ronnebeck’s death.Altamirano is accused of fatally shooting Ronnebeck after the store clerk insisted that Altamirano pay for a pack of cigarettes. Authorities say Altamirano then stepped over Ronnebeck to get several packs of cigarettes before leaving the store.“These are stories that are all too normal at this point,” Steve Ronnebeck said. “And I don’t want to call them normal, but that’s what it’s getting to be — normal.”Altamirano has already been sentenced to six years in prison for his earlier guilty pleas in the case to misconduct involving weapons. He still faces murder, robbery and other charges in Ronnebeck’s death. He has pleaded not guilty to the remaining charges.___Associated Press writer Nicholas Riccardi in Denver contributed to this report.___Follow Jacques Billeaud at www.twitter.com/jacquesbilleaud"}