{"id": "Analysis: Louisiana political focus set on 2019, not Tuesday", "paragraph": "BATON ROUGE, La. (AP) — Though an election looms Tuesday, Louisiana’s politicians, prognosticators, and campaign donors already have moved on, looking to the 2019 races when voters choose the governor, six other statewide elected officials and state lawmakers.That’s the big election year.In political circles, conversations regularly turn to whether Democratic Gov. John Bel Edwards can win re-election and which Republicans might enter the race against him, rather than how Louisiana’s congressional incumbents will fare on this week’s ballot or who will fill out a one-year term as secretary of state.Perhaps that’s because the governor historically is the center of Louisiana’s political universe. Or maybe it’s because the U.S. House races are less interesting when no one seems likely to be ousted. Or maybe it’s that folks can’t get jazzed about a secretary of state job that’s largely a ministerial position.Whatever the reason, the 2018 elections have been overshadowed nearly from the start by the 2019 competitions.Republican U.S. Sen. John Kennedy, seemingly ready to jump into the governor’s race against Edwards, isn’t even waiting until the Dec. 8 runoffs wrap up this year’s election cycle. He said he’ll announce whether he’s in or out of the gubernatorial contest by Dec. 1.Kennedy already picked up an early endorsement last week, from Republican state Rep. Jay Morris of Monroe, who emailed supporters saying he hopes Kennedy will run. Morris described Kennedy as bringing “a conservative and common sense approach.”“John Kennedy doesn’t kowtow to anyone even if they are powerful donors.  That kind of integrity is rare in government,” Morris wrote.Edwards certainly appears to have moved to campaign mode, with his office releasing weekly videos touting the accomplishments of individual Cabinet agencies since the governor took office in 2016. Outside groups and PACs backing Edwards are active on social media promoting the governor and trashing those who might run against him.Already one GOP candidate has entered the race. Eddie Rispone filed state paperwork in October declaring his candidacy for the election.The wealthy Baton Rouge businessman, founder of an industrial contracting company and longtime donor to conservative candidates isn’t well-known outside of political groups yet. But Rispone said he’s willing to put up $5 million or more of his own money to change that, making him a major contender in the race as soon as he got into it.If he decides to add himself to the gubernatorial candidate list, Kennedy would be a formidable candidate, maintaining high approval ratings with voters. He also wouldn’t have to give up his U.S. Senate seat to run against Edwards, though already speculation is rampant about who might fill that Senate position if Kennedy were to win the governor’s race.Other Republicans still mulling the race include U.S. Rep. Ralph Abraham, Attorney General Jeff Landry, state Sen. Sharon Hewitt, and Louisiana Association of Business and Industry President Stephen Waguespack. As he seeks re-election to his congressional seat on Tuesday’s ballot, Abraham ran what just as easily could be seen as a biographical ad introducing him to a broader audience in case he enters the governor’s race.Edwards’ approval ratings have hovered around 50 percent in recent polls, and he’s already reported raising $5 million for his re-election bid. He said he’s proud to run on his performance, “and I look forward to earning another four years by continuing to put Louisiana first.”Millions of dollars from donors inside and outside of Louisiana are expected to pour into the race, with Republicans trying to reclaim a seat they feel should be theirs and Democrats trying to hold onto a seat they believe shows their candidates can win in conservative states.Beyond the governor’s race, other statewide incumbents are gearing up re-election bids. Republican Lt. Gov. Billy Nungesser recently promoted raising $500,000 during two fundraisers that were described as kick-off events for his 2019 campaign.Term-limited lawmakers are jockeying for other political jobs they can land in the next term.And the winner of this fall’s election for secretary of state will have to turn around and run again next year to hold onto the seat.___EDITOR’S NOTE: Melinda Deslatte has covered Louisiana politics for The Associated Press since 2000. Follow her at http://twitter.com/melindadeslatte"}