{"id": "Military contract information session draws strong interest", "paragraph": "FAIRBANKS, Alaska (AP) — Construction at military facilities in interior Alaska is attracting strong interest from contractors.The Procurement Technical Assistance Program in Fairbanks announced a presentation, scheduled for Wednesday, on how to do business with the military, the Fairbanks Daily News-Miner reported .Organizers expected about 30 people to sign up, said contract specialist Pierre Thompson. Instead, they quickly filled reservations last week for the planned venue with responses from 135 people.“This blew up in my face,” Thompson said. “I put it out on Monday, and it was pretty much filled on Tuesday.”Likewise, by the weekend, there were only a few seats in Anchorage for a live-stream version of the presentation at the office of Associated General Contractors of Alaska.The meeting will feature Army and Air force military contractor officials.“It’s going to be all-encompassing, so if you are an electrician, or if you cater, or if you do anything that would be involved with doing a lot of construction, then these contracts will be something that you will be interested in,” said Jacqueline Summers, a program specialist in Anchorage for the Procurement Technical Assistant Program.The meeting is planned as the Defense Department continues $500 million in construction projects at Eielson Air Force Base south of Fairbanks in preparation for the arrival of F-35 fighter jets in 2020.Fort Wainwright in Fairbanks has an upcoming environmental remediation project. Fort Greely at Delta Junction is installing additional missile defense interceptors, and Clear Air Force Station is installing a new long-range radar system.The meeting will include staff from the 354th Contracting Squadron at Eielson and the 715th Contracting Team at Fort Wainwright.“Usually those contracting officers are really hard to get a face-to-face meeting with, so the fact that they’re coming out and actively recruiting is kind of a sign that there’s a lot going on,” Summers said.Staff from the U.S. Small Business Administration and the Associated General Contractors of America will also be at the meeting.The program hopes to hold additional meetings about military contacting next spring, Thompson said.___Information from: Fairbanks (Alaska) Daily News-Miner, http://www.newsminer.com"}