{"id": "The Latest: Obama says Indiana voters don’t want ‘a yes man’", "paragraph": "\n              Former President Barack Obama, right, greets Democratic supporters at Genesis Convention Center, Sunday, Nov. 4, 2018, in Gary, Ind. Obama rallied Democrats on behalf of Sen. Joe Donnelly, D-Ind., who faces a stiff challenge from Republican businessman Mike Braun. (AP Photo/Nam Y. Huh)\n            GARY, Ind. (AP) — The Latest on former President Barack Obama’s campaign rally for Democratic Indiana Sen. Joe Donnelly (all times local):5:20 p.m.Former President Barack Obama has praised Democratic Sen. Joe Donnelly during a rally in northwest Indiana as someone who’s honest and direct, telling voters “You don’t want just a yes man.”Obama’s rally Sunday in Gary came between his successor’s trips to Indiana on Friday and Monday to campaign for Republican Senate candidate Mike Braun.Donnelly has often sounded far more like President Donald Trump than Obama on issues. He’s angered some Democrats by embracing some of Trump’s priorities, such as a border wall with Mexico. But he has supported the Affordable Care Act, the health care overhaul passed under Obama.Obama told thousands of cheering supporters that he and Donnelly don’t always agree. But he says it’s more important to elect a senator who will put what’s best for his state over his party.___12 a.m.Former President Barack Obama’s national campaign tour to boost Democratic candidates takes an unusual path with an Indiana rally for Sen. Joe Donnelly, who has sounded far more like Donald Trump.Obama’s rally for the Democratic senator Sunday in Gary will be sandwiched between his successor’s trips to the state Friday and Monday on behalf of GOP Senate candidate Mike Braun.For Braun, a businessman who has campaigned as a steadfast Donald Trump ally, the current president’s appearances in Indianapolis and Fort Wayne are a no-brainier in a state he won two years ago by 19 points.But for Donnelly, the Obama rally is more complicated. Donnelly has angered some Democrats by tacking to the right and embracing some of Trump’s pet priorities, such as a border wall with Mexico."}