{"id": "Authorities probing immigrant Saudi sisters’ mystery deaths", "paragraph": "\n              In this undated police sketch provided by the New York Police Department, sisters Rotana, left and Tala Farea are shown. The New York Police Department says the sister's bodies were found bound together lying on rocks along the Hudson River on Wednesday, Oct. 24, 2018. (New York Police Department via AP)\n            NEW YORK (AP) — Police are investigating the mysterious deaths of two sisters from Saudi Arabia whose bodies, bound together with tape, washed up on New York City’s waterfront last week.The sisters, Tala Farea, 16, and Rotana Farea, 22, were discovered Oct. 24 on a bank of the Hudson River, about 225 miles from Fairfax, Virginia, where they lived and were reported missing in August.As of Tuesday, investigators still had not determined how they died. The sisters’ bodies were taped together and facing each other, but had no obvious signs of trauma, police said. They were both fully clothed.Their mother told detectives the day before the bodies were discovered, she received a call from an official at the Saudi Arabian Embassy, ordering the family to leave the U.S. because her daughters had applied for political asylum, New York police said Tuesday.Saudi Arabia’s Consulate General in New York said in a statement that it had “appointed an attorney to follow the case closely.”New York City police sent a detective to Virginia to learn more about the sisters. Chief of Detectives Dermot Shea said they were particularly interested in finding out what happened since they were reported missing and what led them to New York City.“We are looking at all clues in their past life,” Shea said.The medical examiner’s office was investigating the cause of death. The lack of obvious trauma appeared to rule out a theory they jumped into the river from the George Washington Bridge.In its statement, the Saudi Consulate General said embassy officials in Washington had contacted the family and “extended its support and aid in this trying time.” It said the sisters were students “accompanying their brother in Washington.”Tala and Rotana moved to the U.S. from Saudi Arabia with their mother in 2015, settling in Fairfax, a suburb of Washington D.C., police said.Rotana was enrolled at George Mason University, but left in the spring. A George Mason spokesman called the news of her death “tragic,” and said the university was cooperating with police.Police said the sisters left their family home and were placed in a shelter after an earlier disappearance, in December 2017.They were reported missing again Aug. 24.Police initially struggled to identify the bodies as much of the city and the country was transfixed by another mystery: the package bombs sent to a dozen prominent Democrats and CNN’s New York City bureau.Police released sketches of the sister’s faces and posted repeated calls for the public’s help in identifying them on social media.“We are out to get justice for those two girls and find out exactly what happened,” Shea said.__Follow Mike Sisak at www.twitter.com/mikesisak"}