{"id": "Jason Witten set for first visit to Cowboys as broadcaster", "paragraph": "\n              FILE - In this May 3, 2018, file photo, Dallas Cowboys tight end Jason Witten announces his retirement from football at the NFL team's training facility and headquarters in Frisco, Texas. Witten vividly remembers Tony Romo’s return to the home of the Cowboys for the first time as a broadcaster last year after retiring as the storied franchise’s all-time passing leader. Now it is the 15-year tight end’s turn. (AP Photo/Richard Rodriguez, File)\n            ARLINGTON, Texas (AP) — Jason Witten vividly remembers Tony Romo’s return to the home of the Dallas Cowboys for the first time as a broadcaster last year after retiring as the storied franchise’s all-time passing leader.Now it’s the 15-year tight end’s turn.Witten’s move from the field to ESPN’s “Monday Night Football” booth was a little more sudden and surprising than Romo’s decision to join CBS after he had lost his job to Dak Prescott.The club’s career leader in catches and games was still a starter when he left, and probably a little more beloved than his best friend and former quarterback. The fans figure to illustrate as much when the Cowboys (3-4) host the pro team from Witten’s home state, the Tennessee Titans (3-4), on Monday night.“It will certainly be emotional for me,” Witten said. “Why wouldn’t it be after 15 years and so many relationships inside that building with fans and teammates and management and coaches and all that stuff?”Unlike Romo, Witten had a ceremony to say goodbye in the spring after he had already started his offseason training at the team’s facility. The announcement days before his 36th birthday came after the realization that it would be difficult for Witten turn down a chance to be one of the NFL’s lead analysts.Also unlike Romo, Witten’s transition has been rough. He’s been criticized more than Romo, who was an instant hit by showing the ability to predict plays and has shown more an ability to connect with viewers.The most notable moment for Witten so far came when he slipped and said Green Bay quarterback Aaron Rodgers had pulled “another rabbit out of his head” with a tying touchdown pass late in a 33-30 overtime win against San Francisco.“I would never walk into something like that and say, ‘Hey, I’m going to be on this level from minute one,’” Witten said. “I’m not going to be perfect but I think over time if you listen, you win them over by saying, ‘Man, the guy is sharing a lot of football with us that we didn’t necessarily know.’“I believe in myself. I believe I’ll be good at it.”Witten will have a friendly audience at AT&T Stadium, regardless of whether people are watching from their devices in the stands.“His leadership in the locker room and the practice field throughout games was off the charts and a great example for all of us how to go about your job,” Cowboys coach Jason Garrett said. “A rare guy, a special guy we are all fortunate to have been around.”The obvious question is whether Witten will hesitate to criticize Prescott, or Garrett, or any of the tight ends trying to replace him. Prescott thinks so.“I expect Witten to be critical,” said Prescott, who had Witten for his first two years in the league, both as the Dallas starter. “I tell the story about when I first came in, how tough he was on me then. So now I don’t expect it to be any different.”Witten kept his composure during his 15-minute retirement speech in May at team headquarters, about 35 miles from the stadium. It should be pretty easy to do the same when he’s shown from the booth, mostly likely after a tribute video on the giant screen that hangs above the field.“I think that’s why when I made the decision back in May, why I put so much time into it, was because I knew once I did I wasn’t going to allow myself or was going to try really hard not to get to the emotions of it all,” Witten said. “Will it be different? Absolutely. Will be it be awkward going into that stadium? Of course it will be.”Just as it was for Romo a year ago.___More AP NFL: https://apnews.com/tag/NFL and https://twitter.com/AP_NFL"}