{"id": "AP Explains: How US birthright citizenship emerged, endured", "paragraph": "\n              FILE - In this Sept. 16, 2015 photo, in Sullivan City, Texas, a woman who is in the country illegally plays with her 2-year-old daughter who was born in the in the United States but was denied a birth certificate. Lawyers for immigrant families denied birth certificates for their U.S.-born children by Texas health officials who refuse to recognize as valid certain forms of identification will argue for a federal judge to intervene against the state. U.S. citizenship through birth comes via the 14th Amendment, which was ratified after the Civil War to secure U.S. citizenship for newly freed black slaves. It later was used to guarantee citizenship to all babies born on U.S. soil after court challenges. (AP Photo/Eric Gay, File)\n            ALBUQUERQUE, N.M. (AP) — President Donald Trump said Tuesday he wants to end a constitutional right that automatically grants citizenship to any baby born in the United States. Trump, in an interview with “Axios on HBO,” said his goal is halting guaranteed citizenship for babies of noncitizens and unauthorized immigrants.U.S. citizenship through birth comes via the 14th Amendment , which was ratified after the Civil War to secure U.S. citizenship for newly freed black slaves. It later was used to guarantee citizenship to all babies born on U.S. soil after court challenges.Here is a look at the Citizenship Clause and how citizens worked to be included in it throughout U.S. history:THE 14TH AMENDMENTIn the aftermath of the Civil War, radical Republicans in Congress sought to push through a series of constitutional protections for newly emancipated black slaves. The 13th Amendment, which was ratified in December 1865, outlawed slavery. The 14th Amendment, ratified in July 1868, assured citizenship for all, including blacks. And the 15th Amendment, ratified in February 1870, awarded voting rights to black men, stating those rights should not be denied based on “race, color or previous condition of servitude.”“All persons born or naturalized in the United States and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside,” the 14th Amendment says. “No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States.”During a debate over the 14th Amendment, U.S. Sen. Edgar Cowan of Pennsylvania said birthright citizenship could result in “a flood of immigration of the Mongol race.” He was referring to immigrants from Mongolia and China.By extending citizenship to those born in the U.S., the amendment nullified the Supreme Court’s 1857 decision in Dred Scott v. Sandford, which held that those descended from slaves could not be citizens.Dred Scott and his wife Harriet were slaves who sued for their freedom after they were taken from the slave state of Missouri to the non-slave territories of Wisconsin and Illinois where slavery had been prohibited by the Missouri Compromise.FIGHT FOR CITIZENSHIPDespite the Citizenship Clause and equal protections afforded under the 14th Amendment, Native Americans were consistently denied the benefits of U.S. birthright citizenship and it took decades for them to receive full citizenship, according to the nonpartisan National Constitution Center.Native Americans who remained under tribal structures were not considered in determining the number of representatives for states in Congress. And if Native Americans left tribal structures, they weren’t eligible for naturalization under the general naturalization laws because only whites could become naturalized citizens, Rutgers University School of Law professor Earl M. Maltz told the National Constitution Center in a conversation about citizenship.Congress finally granted citizenship to all Native Americans born in the U.S. in 1924.The idea that the children of immigrants born in the U.S. were automatically U.S. citizens remained unclear until 1898. That’s when the U.S. Supreme Court ruled that San Francisco-born Wong Kim Ark was a U.S. citizen because he was born in the U.S. The federal government had tried to deny the son of Chinese immigrants re-entry in the U.S. after a trip abroad on grounds he wasn’t a citizen under the Chinese Exclusion Act.Still, U.S.-born Mexican-Americans in the 1930s were denied citizenship protections when authorities in California and Texas deported them to Mexico during the Great Depression. U.S.-born Japanese-Americans were denied citizenship protections when they were forced into Japanese internment camps during World War II.AN EXECUTIVE ORDERGeoffrey Hoffman, director of the Immigration Clinic at the University of Houston Law Center, says some proponents of immigration restrictions have argued the words “subject to the jurisdiction thereof” in the 14th Amendment allows the U.S. to deny citizenship to babies born to those in the country illegally.However, Hoffman said those arguments are false since any person in the U.S., besides diplomats, would be subject to U.S. laws regardless of immigration status.Any executive order by Trump or any president could be subjected to a judicial challenge and there are many articles in the Constitution that would make a fight against the Citizenship Clause difficult.Besides the 14th Amendment itself, Hoffman said an executive order banning the Citizenship Clause would violate Article 2 of the Constitution, which states the president “shall take Care that the Laws be faithfully executed.”Hoffman said such an executive order would violate laws of denaturalization and would attempt to strip citizenship retroactively — another violation of the Constitution.___Associated Press Writer Russell Contreras is a member of the AP’s race and ethnicity team. Follow Contreras on Twitter at http://twitter.com/russcontreras ."}