{"id": "Cowboys look for win streak after saving season in Philly", "paragraph": "\n              Dallas Cowboys running back Ezekiel Elliott (21) gestures while leaving the field after an NFL football game against the Philadelphia Eagles, Sunday, Nov. 11, 2018, in Philadelphia. The Cowboys won 27-20. (AP Photo/Matt Slocum)\n            FRISCO, Texas (AP) — Dak Prescott and Ezekiel Elliott played off each other in a season-saving win over Philadelphia much the same way they did during their remarkable rookie year together in 2016.Now the star quarterback and running back of the Dallas Cowboys need a winning streak, although it won’t have to be as long as the franchise-record run two years ago, the last time they made the playoffs.“I don’t go back and look and try to compare now to then,” Prescott said after throwing for a touchdown and running for one in a 27-20 win . “This is the team we have and this is when everything is clicking and we’re playing the way we need to be playing. This is what we’re capable of.”The Cowboys (4-5) were in a desperate spot visiting the defending champion Eagles because of an up-and-down season notable for its struggles on offense. Now that they have their first road win, they have to do it again Sunday at Atlanta (4-5).Dallas and Philadelphia trail NFC East-leading Washington by two games with seven remaining. The Cowboys have one more game against each rival, having lost to the Redskins on the road.“We needed this just as bad as we need every win going forward,” defensive tackle Tyrone Crawford said. “I call it a movement because that’s the only thing we can do now is get ‘dubs.’ We can’t take no ’L’s.”Against Philadelphia, coach Jason Garrett dumped a conservative approach that was costly in a couple of losses by planning to go for it on fourth down in Dallas territory on the first play of the second quarter before a false start aborted that bold move.The Cowboys faked a punt later in the quarter, which led to Elliott almost cleanly hurdling Tre Sullivan before a stumble on a clear path to the end zone forced Dallas to settle for a field goal. At the time, it sort of symbolized the season for an inconsistent offense.Still, Elliott had 151 yards rushing and a touchdown, with another 36 yards receiving and a score. Prescott’s line looked similar to 2016 as well: 270 yards passing, no turnovers and a 100-plus rating.The 2016 NFL Offensive Rookie of the Year led two 75-yard drives to touchdowns in the fourth quarter, both of them answers to tying TDs from the Eagles. Elliott finished off each of them after big plays to several receivers along the way.“It just showed the attitude of this team going into this game,” said Elliott, who surged two spots to second in the NFL in rushing behind MVP contender Todd Gurley of the Rams. “We knew we had to win. I’m proud of these guys.”The Cowboys ran off 11 straight wins when Prescott and Elliott were rookies on the way to an NFC-best 13 wins. Dallas slipped to 9-7 and out of the playoffs last season with a deteriorating performance from the offense.The receivers have struggled without Dez Bryant, released in the offseason, but appear to be benefiting from the trade for Amari Cooper, acquired from Oakland for a first-round pick.Injuries and mistakes in an offensive line that has been one of the NFL’s best in recent years have at times made things difficult for Elliott and contributed to Prescott already matching last year’s career high of 32 sacks barely more than halfway through the season. But that line stood out against the Eagles.“This is a winning team and it’s great when you go on the road and win,” Prescott said. “It’s important to us just to feel that energy in the locker room and to make sure we don’t forget that. That’s what we’re trying to do every time that we go on the road, or every game.”NOTES: Garrett said he received a “favorable report” on RG Zack Martin, who missed part of the Philadelphia game when he aggravated the left knee injury he’s been battling since hyperextending the knee in the preseason. ... LG Xavier Su’a-Filo had a solid game filling in for injured rookie Connor Williams, who had arthroscopic knee surgery last week. Garrett said the team hasn’t made any determinations on who would start when Williams is ready to return.___More AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL"}