{"id": "Roger Stone associate expects to be charged in Mueller probe", "paragraph": "\n              FILE - In this Sept. 26, 2017, file photo, longtime Donald Trump associate Roger Stone arrives to testify before the House Intelligence Committee, on Capitol Hill in Washington. An associate of Stone said Monday, Nov. 12, 2018, that he expects to face charges in the special counsel’s Russia investigation. Conservative conspiracy theorist Jerome Corsi said on his YouTube show that negotiations fell apart with special counsel Robert Mueller’s team and he expects in the coming days to be charged with making false statements. (AP Photo/Andrew Harnik, File)\n            WASHINGTON (AP) — An associate of longtime Trump confidant Roger Stone said Monday that he expects to face charges in the special counsel’s Russia investigation.Conservative conspiracy theorist Jerome Corsi said on his YouTube show that negotiations fell apart with special counsel Robert Mueller’s team and he expects in the coming days to be charged with making false statements.“I’m going to be indicted,” Corsi said on his show. “That’s what we were told. Everyone should know that, and I’m anticipating it.”The Associated Press couldn’t immediately confirm Corsi’s claims that charges against him are forthcoming. Corsi’s attorney, David Gray, declined to comment Monday evening. A spokesman for the special counsel’s office also declined to comment.Corsi is one of several Stone associates who have been questioned by investigators as Mueller probes Stone’s connections with WikiLeaks. American intelligence agencies have concluded that Russian agents were the source of hacked material released by WikiLeaks during the 2016 campaign, including emails belonging to former Clinton campaign chairman John Podesta. And Mueller’s office is trying to determine whether Stone and other associates of President Donald Trump had advance knowledge of WikiLeaks’ plans.Corsi, the former Washington bureau chief of the conspiracy theory outlet InfoWars, said Monday that he had no recollection of ever meeting WikiLeaks founder Julian Assange.“To the best of my recollection, what I knew in advance about what Julian Assange was going to do in terms of having the Podesta emails, I figured out,” he said.Corsi said Monday that he has been cooperating with the Mueller investigation since receiving a subpoena in late August. He said he gave investigators two computers, a cell phone and access to his email accounts and tweets.But he said talks with investigators recently had “blown up.”“I fully anticipate that in the next few days, I will be indicted by Mueller,” he said, as he made a pitch for donations to his legal defense fund.Stone, who has also said he expects to be indicted, has denied being a conduit for WikiLeaks, which published thousands of emails stolen from Podesta in the weeks before the election.In a telephone interview with the AP last month, Stone said: “I had no advanced notice of the source or content or the exact timing of the release of the WikiLeaks disclosures.”"}